Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/java/java_deviceManagement.po
Languages: de, fr, ko

source: Factory Reset
fr: Réinitialiser avec les paramètres d'usine
ko: 팩토리 재설정

source: The device needs to do the following activities to support Device Actions:
de: Die Einheit muss folgende Aktivitäten ausführen, damit Einheitenaktionen unterstützt werden:
fr: Le terminal doit effectuer les opérations suivantes pour prendre en charge les actions sur les terminaux :
ko: 디바이스는 디바이스 조치를 지원하기 위해 다음 활동을 수행해야 합니다.

source: **1. Inform server about the Device Actions support**
de: **1. Informieren des Servers über die Einheitenaktionsunterstützung**
fr: **1. Signaler au serveur la prise en charge des actions sur les terminaux**
ko: **1. 디바이스 조치 지원에 대해 서버에 알림**

source: In order to perform Reboot and Factory Reset, the device needs to inform the Internet of Things Foundation Connect about its support first. This can achieved by invoking a following method with a boolean value:
de: Um einen Reboot und ein Factory-Reset durchzuführen, muss die Einheit zunächst Internet of Things Foundation Connect über ihre Unterstützung informieren. Dies kann durch Aufrufen der folgende Methode mit einem booleschen Wert erreicht werden:
fr: Pour effectuer les actions Réamorcer et Réinitialiser avec les paramètres d'usine, le terminal doit d'abord signaler à Internet of Things Foundation Connect la prise en charge de ces actions. Cette opération peut être effectuée en appelant la méthode suivante avec une valeur booléenne :
ko: 다시 부팅 및 팩토리 재설정을 수행하려면 디바이스는 먼저 해당 지원에 대해 Internet of Things Foundation 연결에 알려야 합니다. 부울 값으로 다음 메소드를 호출하면 가능합니다.

source: As the manage request informs the Internet of Things Foundation Connect about the device action support, manage() method needs to be called right after setting the device action support.
de: Während die Verwaltungsanforderung Internet of Things Foundation Connect über die Einheitenaktionsunterstützung informiert, muss die Methode manage() direkt nach dem Festlegen der Einheitenaktionsunterstützung aufgerufen werden.
fr: Comme la demande de gestion signale à Internet of Things Foundation Connect la prise en charge de l'action sur le terminal, la méthode manage() doit être appelée juste après la définition de la prise en charge de l'action sur les terminaux.
ko: 관리 요청이 디바이스 조치 지원에 대해 Internet of Things Foundation 연결에 알리므로 디바이스 조치 지원을 설정한 후 즉시 manage() 메소드를 호출해야 합니다.

source: **2. Create the Device Action Handler**
de: **2. Erstellen des Einheitenaktionshandlers
fr: **2. Créer le gestionnaire d'actions sur les terminaux**
ko: **2. 디바이스 조치 핸들러 작성**

source: In order to support the device action, the device needs to create a handler and add it to ManagedDevice. The handler must extend a DeviceActionHandler class and provide implementation for the following methods:
de: Zur Unterstützung der Einheitenaktion muss die Einheit einen Handler erstellen und diesen zu ManagedDevice hinzufügen. Der Handler muss eine DeviceActionHandler-Klasse erweitern und die Implementierung für die folgenden Methoden bereitstellen:
fr: Pour prendre en charge l'action sur les terminaux, le terminal doit créer un gestionnaire et l'ajouter à ManagedDevice. Le gestionnaire doit étendre une classe DeviceActionHandler et implémenter les méthodes suivantes :
ko: 디바이스 조치를 지원하기 위해 디바이스는 핸들러를 작성하고 ManagedDevice에 추가해야 합니다. 핸들러는 DeviceActionHandler 클래스를 확장하고 다음 메소드에 대한 구현을 제공해야 합니다.

source: **2.1 Sample implementation of handleReboot**
de: **2.1 Beispielimplementierung von handleReboot**
fr: **2.1 Exemple d'implémentation de handleReboot**
ko: **2.1 handleReboot의 샘플 구현**

source: The implementation must add a logic to reboot the device and report the status of the reboot via DeviceAction object. The device needs to update the status along with a optional message only when there is a failure (because the successful operation reboots the device and the device code will not have a control to update the Internet of Things Foundation Connect). A sample reboot implementation for a Raspberry Pi device is shown below:
de: Die Implementierung muss eine Logik hinzufügen, um für die Einheit einen Warmstart durchzuführen und den Status des Reboots über das Objekt DeviceAction zu melden. Die Einheit muss den Status zusammen mit einer optionalen Nachricht nur dann aktualisieren, wenn ein Fehler vorliegt (da eine erfolgreiche Operation die Einheit neu bootet und der Einheitencode keine Kontrolle über die Aktualisierung von Internet of Things Foundation Connect hat). Eine Beispiel-Reboot-Implementierung für eine Raspberry Pi-Einheit wird nachfolgend dargestellt:
fr: L'implémentation doit ajouter une logique permettant de réinitialiser le terminal et signaler le statut du réamorçage via l'objet DeviceAction. Le terminal doit mettre à jour le statut et envoyer un message facultatif uniquement en cas d'échec. (En effet, la réussite de l'opération réamorce le terminal et le code du terminal n'a pas de contrôle pour mettre à jour le statut Internet of Things Foundation Connect). Un exemple d'implémentation du réamorçage pour le terminal Raspberry Pi est présenté ci-dessous :
ko: 구현에서는 DeviceAction 오브젝트를 통해 디바이스를 다시 부팅하고 다시 부팅 상태를 보고하는 로직을 추가해야 합니다. 디바이스는 장애가 있는 경우에만 선택적 메시지와 함께 상태를 업데이트해야 합니다(오퍼레이션이 완료되면 디바이스가 다시 부팅되고 디바이스 코드는 Internet of Things Foundation 연결을 업데이트할 수 있는 권한이 없으므로). Raspberry Pi 디바이스의 샘플 다시 부팅 구현은 다음과 같습니다.

source: The complete code can be found in the device management sample `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__.
de: Den vollständigen Code finden Sie im Einheitenmanagementbeispiel `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__.
fr: Le code complet est disponible dans l'exemple de gestion des terminaux `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__.
ko: 전체 코드는 디바이스 관리 샘플 `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__에서 찾을 수 있습니다.

source: **2.2 Sample implementation of handleFactoryReset**
de: **2.2 Beispielimplementierung von handleFactoryReset**
fr: **2.2 Exemple d'implémentation de handleFactoryReset**
ko: **2.2 handleFactoryReset의 샘플 구현**

source: The implementation must add a logic to reset the device to factory settings and report the status via DeviceAction object. The device needs to update the status along with a optional message only when there is a failure (because as part of this process, the device reboots and the device will not have a control to update status to Internet of Things Foundation Connect). The skeleton of the Factory Reset implementation is shown below:
de: Die Implementierung muss eine Logik hinzufügen, um die Einheit auf Werkseinstellung zurückzusetzen und den Status über das Objekt DeviceAction melden zu können. Die Einheit muss den Status zusammen mit einer optionalen Nachricht nur dann aktualisieren, wenn ein Fehler vorliegt (da als Teil dieses Prozesses die Einheit einen Warmstart durchführt und die Einheit keine Kontrolle zum Aktualisieren des Status für Internet of Things Foundation Connect hat). Das Gerüst der Factory-Reset-Implementierung wird nachfolgend dargestellt:
fr: L'implémentation doit ajouter une logique permettant de réinitialiser le terminal avec les paramètres d'usine et signaler le statut via l'objet DeviceAction. Le terminal doit mettre à jour le statut et envoyer un message facultatif en cas d'échec. (En effet, dans le cadre du processus, le terminal est réamorcé et n'a pas de contrôle pour mettre à jour le statut à Internet of Things Foundation Connect.) Le squelette de l'implémentation Réinitialiser avec les paramètres d'usine est affiché ci-dessous :
ko: 구현에서는 DeviceAction 오브젝트를 통해 디바이스를 팩토리 설정으로 재설정하고 상태를 보고하는 로직을 추가해야 합니다. 디바이스는 장애가 있는 경우에만 선택적 메시지와 함께 상태를 업데이트해야 합니다(이 프로세스의 일부분으로 디바이스가 다시 부팅되고 디바이스는 Internet of Things Foundation 연결에 대한 상태를 업데이트할 수 있는 권한이 없으므로). 팩토리 재설정 구현의 스켈레톤은 다음과 같습니다.

source: **3. Add the handler to ManagedDevice**
de: **3. Hinzufügen des Handlers zu ManagedDevice**
fr: **3. Ajouter le gestionnaire à ManagedDevice**
ko: **3. ManagedDevice에 핸들러 추가**

source: The created handler needs to be added to the ManagedDevice instance so that the ibmiotf client library invokes the corresponding method when there is a device action request from Internet of Things Foundation Connect.
de: Der erstellte Handler muss der ManagedDevice-Instanz hinzugefügt werden, sodass die ibmiotf-Clientbibliothek die entsprechende Methode aufrufen kann, wenn eine Einheitenaktionsanforderung von Internet of Things Foundation Connect vorliegt.
fr: Le gestionnaire créé doit être ajouté à l'instance ManagedDevice afin que la bibliothèque client ibmiotf appelle la méthode correspondante lorsqu'une demande d'action sur le terminal est émise par Internet of Things Foundation Connect.
ko: Internet of Things Foundation 연결로부터 디바이스 조치 요청이 있는 경우 ibmiotf 클라이언트 라이브러리가 해당 메소드를 호출하도록, 작성된 핸들러를 ManagedDevice 인스턴스에 추가해야 합니다.

source: Refer to `this page <../device_mgmt/operations/device_actions.html>`__ for more information about the Device Action.
de: Weitere Informationen zur Einheitenaktion finden Sie auf `dieser Seite <../device_mgmt/operations/device_actions.html>`__.
fr: Pour plus d'informations sur l'action sur les terminaux, reportez-vous à cette `page <../device_mgmt/operations/device_actions.html>`__.
ko: 디바이스 조치에 대한 자세한 정보는 `이 페이지 <../device_mgmt/operations/device_actions.html>`__를 참조하십시오.

source: Listen for Device attribute changes
de: Empfangsbereit für Einheitenattributänderungen sein
fr: Ecouter les modifications de l'attribut Device
ko: 디바이스 속성 변경 청취

source: This ibmiotf client library updates the corresponding objects whenever there is an update request from the Internet of Things Foundation Connect, these update requests are initiated by the application either directly or indirectly (Firmware Update) via the Internet of Things Foundation Connect ReST API. Apart from updating these attributes, the library provides a mechanism where the device can be notified whenever a device attribute is updated.
de: Diese ibmiotf-Clientbibliothek aktualisiert die entsprechenden Objekte immer dann, wenn eine Aktualisierungsanforderung von Internet of Things Foundation Connect vorliegt; diese Aktualisierungsanforderungen werden von der Anwendung entweder direkt oder indirekt (Firmware-Update) über die REST-API von Internet of Things Foundation Connect initiiert. Neben der Aktualisierung dieser Attribute bietet die Bibliothek einen Mechanismus bei dem die Einheit benachrichtigt werden kann, wann immer ein Einheitenattribut aktualisiert wird.
fr: Cette bibliothèque client ibmiotf met à jour les objets correspondants lorsqu'il y a une demande de mise à jour d'Internet of Things Foundation Connect. Ces demandes de mise à jour sont lancées par l'application directement ou indirectement (Mettre à jour le microprogramme) via l'API REST d'Internet of Things Foundation Connect. Outre la mise à jour de ces attributs, la bibliothèque fournit un mécanisme qui permet de notifier le terminal lorsqu'un de ses attributs est mis à jour.
ko: 이 ibmiotf 클라이언트 라이브러리는 Internet of Things Foundation 연결의 업데이트 요청이 있을 때마다 해당 오브젝트를 업데이트하며 이러한 업데이트 요청은 직접 또는 Internet of Things Foundation 연결 ReST API를 통해 간접적으로(펌웨어 업데이트) 애플리케이션이 시작합니다. 이러한 속성의 업데이트 외에 라이브러리는 디바이스 속성이 업데이트될 때마다 디바이스에 알릴 수 있는 메커니즘을 제공합니다.

source: Attributes that can be updated by this operation are location, metadata, device information and firmware.
de: Durch diese Operation können die Attribute für Position, Metadaten, Einheitendaten und Firmware aktualisiert werden.
fr: Les attributs qui peuvent être mis à jour par cette opération sont l'emplacement, les métadonnées, les informations et le microprogramme du terminal.
ko: 이 오퍼레이션에서 업데이트될 수 있는 속성은 위치, 메타데이터, 디바이스 정보 및 펌웨어입니다.

source: In order to get notified, the device needs to add a property change listener on those objects that it is interested.
de: Damit eine Benachrichtigung erfolgen kann, muss die Einheit einen Listener für Eigenschaftsänderungen bei den Objekten hinzufügen, die von Interesse sind.
fr: Pour recevoir une notification, le terminal doit ajouter un code d'écoute des modifications de propriétés sur les objets qui l'intéressent.
ko: 알림을 받으려면 디바이스는 관심이 있는 오브젝트에서 특성 변경 리스너를 추가해야 합니다.

source: Also, the device needs to implement the propertyChange() method where it receives the notification. A sample implementation is as follows:
de: Darüber hinaus, muss die Einheit die Methode propertyChange() implementieren; dort erhält sie die Benachrichtigung. Folgende Beispielimplementierung:
fr: Le terminal doit également implémenter la méthode propertyChange() à l'endroit où il reçoit la notification. Un exemple d'implémentation est présenté ci-dessous :
ko: 또한 디바이스는 알림을 받은 경우 propertyChange() 메소드를 구현해야 합니다. 샘플 구현은 다음과 같습니다.

source: Refer to `this page <../device_mgmt/operations/update.html>`__ for more information about updating the device attributes.
de: Weitere Informationen zur Aktualisierung der Einheitenattributen finden Sie auf `dieser Seite <../device_mgmt/operations/update.html>`__.
fr: Pour plus d'informations sur la mise à jour des attributs de terminaux, reportez-vous à cette `page <../device_mgmt/operations/update.html>`__.
ko: 디바이스 속성 업데이트에 대한 자세한 정보는 `이 페이지 <../device_mgmt/operations/update.html>`__를 참조하십시오.

source: Examples
de: Beispiele
fr: Exemples
ko: 예제

source: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - A sample agent code that shows how to perform various device management operations on Raspberry Pi.
de: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - Ein Beispiel-Agenten-Code, der die Ausführung verschiedener Einheitenmanagementoperationen unter Raspberry Pi zeigt.
fr: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - Exemple de code d'agent indiquant comment effectuer différentes opérations de gestion sur le terminal Raspberry Pi.
ko: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - Raspberry Pi에서 다양한 디바이스 관리 오퍼레이션을 수행하는 방법을 표시하는 샘플 에이전트 코드입니다.

source: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - A sample code that shows how one can perform both device operations and management operations.
de: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - Ein Beispielcode, der zeigt, wie Einheitenoperationen und Managementoperationen ausgeführt werden.
fr: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - Exemple de code indiquant comment effectuer des opérations liées aux terminaux et des opérations de gestion.
ko: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - 디바이스 오퍼레이션과 관리 오퍼레이션을 모두 수행하는 방법을 표시하는 샘플 코드입니다.

source: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - A sample agent code with custom MqttAsyncClient.
de: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - Ein Beispielagentencode mit angepasstem MqttAsyncClient.
fr: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - Exemple de code d'agent avec code MqttAsyncClient personnalisé.
ko: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - 사용자 정의 MqttAsyncClient를 사용하는 샘플 에이전트 코드입니다.

source: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - A sample agent code with custom MqttClient.
de: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - Ein Beispielagentencode mit angepasstem MqttClient.
fr: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - Exemple de code d'agent avec code MqttClient personnalisé.
ko: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - 사용자 정의 MqttClient를 사용하는 샘플 에이전트 코드입니다.

source: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - A sample implementation of FirmwareHandler for Raspberry Pi.
de: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - Eine Beispielimplementierung von FirmwareHandler für Raspberry Pi.
fr: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - Exemple d'implémentation de FirmwareHandler pour le terminal Raspberry Pi.
ko: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - Raspberry Pi에 대한 FirmwareHandler의 샘플 구현입니다.

source: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - A sample implementation of DeviceActionHandler
de: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - Eine Beispielimplementierung von DeviceActionHandler
fr: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - Exemple d'implémentation de DeviceActionHandler
ko: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - DeviceActionHandler의 샘플 구현입니다.

source: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - A sample that shows how to send regular manage request with lifetime specified.
de: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - Ein Beispiel, das das Senden einer regulären Verwaltungsanforderung mit der angegebenen Lebensdauer zeigt.
fr: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - Exemple qui indique comment envoyer une demande de gestion standard avec une durée de vie définie.
ko: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - 영구를 지정하여 일반 관리 요청을 보내는 방법을 표시하는 샘플입니다.

source: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - A sample listener code that shows how to listen for a various device attribute changes .
de: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - Ein Beispiel-Listener-Code, der zeigt, wie die Empfangsbereitschaft für verschiedene Änderungen bei Einheitenattributen erfolgt.
fr: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - Exemple de code d'écoute qui indique comment détecter différentes modifications apportées à des attributs de terminal.
ko: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - 다양한 디바이스 속성 변경을 청취하는 방법을 표시하는 샘플 리스너 코드입니다.

source: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - A sample that shows how to add ErrorCode without waiting for response from the server.
de: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - Ein Beispiel, das das Hinzufügen von ErrorCode ohne Warten auf eine Antwort vom Server zeigt.
fr: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - Exemple indiquant comment ajouter un code d'erreur sans attendre la réponse du serveur.
ko: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - 서버로부터 응답을 기다리지 않고 ErrorCode를 추가하는 방법을 표시하는 샘플입니다.

source: Recipe
de: Anleitung
fr: Recette
ko: 지침서
