Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/java/javaintro.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: Java Client Library - Introduction
de: Java-Clientbibliothek - Einführung
es: Biblioteca de cliente Java - Introducción
fr: Bibliothèque client Java - Introduction
it: Libreria client Java - Introduzione
ja: Java クライアント・ライブラリー - 概要
ko: Java 클라이언트 라이브러리 - 소개
pt_br: Biblioteca do Cliente Java - Introdução
zh_cn: Java 客户机库 - 简介
zh_tw: Java 用戶端程式庫 - 簡介

source: Use the Java client library for interacting with the `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ and to automate commands using Java 7 or Java 8. The client library can be used to simplify interactions with the IBM Internet of Things Foundation. The following libraries contain instructions and guidance on using the java ibmiotf client library to interact with devices and applications within your organizations.
de: Verwenden Sie die Java-Clientbibliothek für die Interaktion mit `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ und für die Automatisierung von Befehlen unter Verwendung von Java 7 oder Java 8. Die Clientbibliothek kann zur Vereinfachung der Interaktionen mit IBM Internet of Things Foundation verwendet werden. Die folgenden Bibliotheken enthalten Anweisungen und Informationen zur Verwendung der Java-ibmiotf-Clientbibliothek für die Interaktion mit Einheiten und Anwendungen in Ihren Organisationen.
es: Utilice la biblioteca de cliente Java para interactuar con `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ y para automatizar los mandatos utilizando Java 7 o Java 8. La biblioteca de cliente se puede utilizar para simplificar las interacciones con IBM Internet of Things Foundation. Las siguientes bibliotecas contienen instrucciones y guías para utilizar la biblioteca de cliente ibmiotf Java para interactuar con los dispositivos y aplicaciones de sus organizaciones.
fr: Utilisez la bibliothèque client Java pour interagir avec `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ et automatiser les commandes à l'aide de Java 7 ou Java 8. Cette bibliothèque permet de simplifier les interactions avec IBM Internet of Things Foundation. Les bibliothèques ci-dessous contiennent des instructions et des conseils à suivre si vous utilisez la bibliothèque client Java ibmiotf pour interagir avec des terminaux et des applications dans vos organisations.
it: Utilizzare la libreria client Java per interagire con `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ e per automatizzare i comandi utilizzando Java 7 o Java 8. La libreria client può essere utilizzata per semplificare le interazioni con IBM Internet of Things Foundation. Le seguenti librerie contengono istruzioni ed orientamenti sull'utilizzo della libreria client ibmiotf java per interagire con i dispositivi e le applicazioni all'interno dell'organizzazione.
ja: Java クライアント・ライブラリーを使用して `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ と対話し、Java 7 または Java 8 を使用してコマンドを自動化します。このクライアント・ライブラリーを使用して、IBM Internet of Things Foundation との対話を簡略化できます。以下のライブラリーには、組織内のデバイスやアプリケーションと対話するための Java ibmiotf クライアント・ライブラリーの使用に関する指示およびガイダンスが含まれています。
ko: `IBM Internet of Things Foundation(<https://internetofthings.ibmcloud.com>)과 상호작용하고 Java 7 또는 Java 8을 사용하여 명령을 자동화하기 위해 Java 클라이언트 라이브러리를 사용하십시오. IBM Internet of Things Foundation과의 상호작용을 단순화하는 데 클라이언트 라이브러리를 사용할 수 있습니다. 다음 라이브러리는 사용자의 조직 내에서 디바이스 및 애플리케이션과 상호작용하기 위해 Java ibmiotf 클라이언트 라이브러리 사용에 대한 지시사항 및 안내를 포함합니다.
pt_br: Use a biblioteca do cliente Java para interagir com o `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ e para automatizar comandos usando o Java 7 ou Java 8. A biblioteca do cliente pode ser usada para simplificar interações com o IBM Internet of Things Foundation. As bibliotecas a seguir contêm instruções e orientações sobre como usar a biblioteca ibmiotf java para interagir com dispositivos e aplicativos dentro de suas organizações.
zh_tw: 使用 Java 用戶端程式庫與 `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ 進行互動，以及使用 Java 7 或 Java 8 進行指令自動化。該用戶端程式庫可用來簡化與 IBM Internet of Things Foundation 的互動。下列程式庫包含有關使用 Java ibmiotf 用戶端程式庫與您組織內的裝置和應用程式互動的指示和指引。

source: This client library documentation is divided into two sections:
de: Diese Clientbibliotheksdokumentation ist in zwei Abschnitte unterteilt:
es: Este cliente se divide en dos secciones:
fr: La documentation de cette bibliothèque client est divisée en deux sections.
it: La documentazione di questa libreria client è suddivisa in due sezioni:
ja: このクライアント・ライブラリー資料は、2 つのセクションに分かれています。
ko: 이 클라이언트 라이브러리 문서는 두 개의 절로 구분되어 있습니다.
pt_br: A documentação desta biblioteca do cliente é dividida em duas seções:
zh_tw: 此用戶端程式庫文件分成兩個區段：

source: The Devices section contains information on how devices publish events and handle commands using the Java ibmiotf Client Library.
de: Der Abschnitt mit den Einheiten enthält Informationen dazu, wie Einheiten Ereignisse publizieren und Befehle mit der Java ibmiotf-Clientbibliothek verarbeiten.
es: La sección Dispositivos contiene información sobre cómo los dispositivos publican los sucesos y manejan los mandatos utilizando la biblioteca de cliente Java ibmiotf.
fr: La section Terminaux (Devices) contient des informations expliquant comment les terminaux publient des événements et traitent des commandes à l'aide de la bibliothèque client Java ibmiotf.
it: La sezione Dispositivi contiene informazioni su come i dispositivi pubblicano gli eventi e gestiscono i comandi utilizzando la libreria client ibmiotf Java.
ja: デバイス・セクションには、デバイスが Java ibmiotf クライアント・ライブラリーを使用してイベントをパブリッシュしコマンドを処理する方法に関する情報が含まれます。
ko: 이 디바이스 절은 디바이스가 이벤트를 공개하고 Java ibmiotf 클라이언트 라이브러리를 사용하여 명령을 처리하는 방법에 대한 정보를 포함합니다.
pt_br: A seção Dispositivos contém informações sobre como os dispositivos publicam eventos e manipulam comandos usando a Biblioteca do Cliente ibmiotf Java.
zh_tw: 「裝置」區段包含裝置如何使用「Java ibmiotf 用戶端程式庫」來發佈事件及處理指令的相關資訊。

source: The Managed Device section contains information on how devices can connect to the Internet of Things Foundation Device Management service using Java ibmiotf Client Library and perform device management operations like firmware update, location update, and diagnostics update.
de: Der Abschnitt 'Verwaltete Einheiten' enthält Informationen dazu, wie Einheiten die Verbindung zum Internet of Things Foundation Device Management-Service mithilfe der Java ibmiotf Client Library herstellen können und Einheitenmanagementoperationen (wie Firmware-Updates, Positions-Updates und Diagnose-Updates) ausführen können.
es: La sección Dispositivo gestionado contiene información sobre cómo se pueden conectar dispositivos al servicio de gestión de dispositivos de Internet of Things Foundation utilizando la biblioteca de cliente Java ibmiotf y llevar a cabo operaciones de gestión de dispositivos como la actualización de firmware, la actualización de ubicaciones y la actualización de diagnósticos.
fr: La section Terminal géré contient des informations sur le mode de connexion des terminaux au service de gestion des terminaux Internet of Things Foundation à l'aide de la bibliothèque client Java ibmiotf et effectue des opérations de gestion des terminaux, comme la mise à jour du microprogramme, de l'emplacement et des diagnostics.
it: La sezione Dispositivo gestito contiene informazioni su come i dispositivi possono connettersi al servizio di gestione dispositivo di Internet of Things Foundation utilizzando la libreria client Java ibmiotf ed eseguire operazioni di gestione dispositivo come l'aggiornamento del firmware, l'aggiornamento dell'ubicazione e l'aggiornamento della diagnostica.
ja: 管理対象デバイスのセクションには、Java ibmiotf クライアント・ライブラリーを使用してデバイスを Internet of Things Foundation デバイス管理サービスに接続する方法や、ファイアウォールの更新やロケーションの更新、診断の更新などのデバイス管理操作を実行する方法に関する情報が記載されています。
ko: 관리 디바이스 절에는 디바이스가 Java ibmiotf 클라이언트 라이브러리를 사용하여 Internet of Things Foundation 디바이스 관리 서비스에 연결하고 펌웨어 업데이트, 위치 업데이트 및 진단 업데이트와 같은 디바이스 관리 오퍼레이션을 수행하는 방법에 대한 정보가 있습니다.
pt_br: A seção Dispositivo Gerenciado contém informações sobre como os dispositivos podem se conectar ao serviço de gerenciamento de dispositivos do Internet of Things Foundation Connect usando a biblioteca do cliente Java ibmiotf e executar operações de gerenciamento de dispositivos, como atualizações de firmware, atualizações de local e atualizações de diagnóstico.
zh_tw: 「受管理裝置」區段包含裝置如何使用「Java ibmiotf 用戶端程式庫」來連接至「Internet of Things Foundation 裝置管理」服務，並執行裝置管理作業（例如，韌體更新、位置更新以及診斷程式更新）的相關資訊。

source: Download
de: Herunterladen
es: Descargar
fr: Télécharger
it: Scarica
ja: ダウンロード
ko: 다운로드
zh_cn: 下载
zh_tw: 下載

source: The latest version of the client library is available `here <https://github.com/ibm-messaging/iot-java/releases/latest>`__ to download.
de: Die neueste Version der Clientbibliothek ist `hier <https://github.com/ibm-messaging/iot-java/releases/latest>`__ zum Download verfügbar.
es: La última versión de la biblioteca de cliente está disponible para su descarga aquí <https://github.com/ibm-messaging/iot-java/releases/latest>`__.
fr: La dernière version de la bibliothèque client peut être téléchargée `ici <https://github.com/ibm-messaging/iot-java/releases/latest>`__.
it: È possibile eseguire lo scaricamento dell'ultima versione della libreria client `qui <https://github.com/ibm-messaging/iot-java/releases/latest>`__.
ja: クライアント・ライブラリーの最新版は、`ここから <https://github.com/ibm-messaging/iot-java/releases/latest>`__ ダウンロードできます。
ko: 최신 버전의 클라이언트 라이브러리는 `여기 <https://github.com/ibm-messaging/iot-java/releases/latest>`__에서 다운로드할 수 있습니다.
pt_br: A versão mais recente da biblioteca do cliente está disponível `aqui <https://github.com/ibm-messaging/iot-java/releases/latest>`__ para download.
zh_cn: 客户机库的最新版本可 `在此 <https://github.com/ibm-messaging/iot-java/releases/latest>`__ 下载。
zh_tw: 您可以 `在此 <https://github.com/ibm-messaging/iot-java/releases/latest>`__ 下載最新版本的用戶端程式庫。

source: The zip module contains the following files,
de: Das ZIP-Modul enthält die folgenden Dateien,
es: El módulo zip contiene los siguientes archivos,
fr: Le module zip contient les fichiers suivants :
it: Il modulo zip contiene i seguenti file,
ja: zip モジュールには、以下のファイルが含まれています。
ko: zip 모듈에는 다음 파일이 있습니다.
pt_br: O módulo zip contém os seguintes arquivos,
zh_cn: zip 模块中包含以下文件：
zh_tw: zip 模組包含下列檔案：

source: com.ibm.iotf.client-<version>.jar - Client library that enables one to talk to Internet of Things Foundation Connect.
de: com.ibm.iotf.client-<version>.jar - Clientbibliothek, die Nachrichten an Internet of Things Foundation Connect ermöglicht.
es: com.ibm.iotf.client-<version>.jar - Biblioteca de cliente que le permite hablar con Internet of Things Foundation Connect.
fr: com.ibm.iotf.client-<version>.jar - Bibliothèque client qui permet de communiquer avec Internet of Things Foundation Connect.
it: com.ibm.iotf.client-<version>.jar - Libreria client che consente di comunicare con Internet of Things Foundation Connect.
ja: com.ibm.iotf.client-<version>.jar - Internet of Things Foundation Connect との対話を可能にするクライアント・ライブラリー。
ko: com.ibm.iotf.client-<version>.jar - Internet of Things Foundation 연결과 대화할 수 있도록 지원하는 클라이언트 라이브러리입니다.
pt_br: com.ibm.iotf.client-<version>.jar - A biblioteca do cliente que permite a comunicação com o Internet of Things Foundation Connect.
zh_cn: com.ibm.iotf.client-<version>.jar - 客户机库，使用户能够与“Internet of Things Foundation 连接”交互。
zh_tw: com.ibm.iotf.client-<version>.jar - 可讓用戶端與「Internet of Things Foundation 連接」通訊的用戶端程式庫。

source: com.ibm.iotf.samples-<version>.jar - Contains samples.
de: com.ibm.iotf.samples-<version>.jar - Enthält Beispiele.
es: com.ibm.iotf.samples-<version>.jar - Contiene ejemplos.
fr: com.ibm.iotf.samples-<version>.jar - Contient des exemples.
it: com.ibm.iotf.samples-<version>.jar - Contiene esempi.
ja: com.ibm.iotf.samples-<version>.jar - サンプルが含まれています。
ko: com.ibm.iotf.samples-<version>.jar - 샘플이 있습니다.
pt_br: com.ibm.iotf.samples-<version>.jar - Contém amostras.
zh_cn: com.ibm.iotf.samples-<version>.jar - 包含样本。
zh_tw: com.ibm.iotf.samples-<version>.jar - 包含範例。

source: DMDeviceSample.properties - Properties file used to configure the list of options required to connect to Internet of Things Foundation Connect and perform device management operations.
de: DMDeviceSample.properties - Eigenschaftendatei, die zum Konfigurieren der Liste der Optionen verwendet wird, die zum Herstellen der Verbindung zu Internet of Things Foundation Connect aerforderlich sind, und die Einheitenmanagementoperationen ausführt.
es: DMDeviceSample.properties - Archivo de propiedades utilizado para configurar la lista de opciones necesaria para conectarse con Internet of Things Foundation Connect y llevar a cabo operaciones de gestión de dispositivos.
fr: DMDeviceSample.properties - Fichier de propriétés permettant de configurer la liste d'options requises pour se connecter à Internet of Things Foundation Connect et effectuer des opérations de gestion des terminaux.
it: DMDeviceSample.properties - File di proprietà utilizzato per configurare l'elenco di opzioni richieste per stabilire una connessione a Internet of Things Foundation Connect ed eseguire operazioni di gestione dispositivo.
ja: DMDeviceSample.properties - Internet of Things Foundation Connect への接続とデバイス管理操作の実行に必要なオプションのリストの構成に使用されるプロパティー・ファイル。
ko: DMDeviceSample.properties - Internet of Things Foundation 연결에 연결하여 디바이스 관리 오퍼레이션을 수행하는 데 필요한 옵션 목록을 구성하는 데 사용되는 특성 파일입니다.
pt_br: DMDeviceSample.properties - Arquivo de propriedades usado para configurar a lista de opções necessárias para a conexão com o Internet of Things Foundation Connect e executar operações de gerenciamento de dispositivos.
zh_cn: DMDeviceSample.properties - 用于配置连接到“Internet of Things Foundation 连接”时所需的选项列表和执行设备管理操作的属性文件。
zh_tw: DMDeviceSample.properties - 內容檔，用來配置連接至 Internet of Things Foundation Connect 並執行裝置管理作業所需的選項清單。

source: device.prop - Properties file to specify connectivity information when DeviceClient is used
de: device.prop - Eigenschaftendatei zur angabe der Konnektivitätsinformationen, wenn DeviceClient verwendet wird.
es: device.prop - Archivo de propiedades para especificar la información sobre conectividad cuando se utiliza DeviceClient.
fr: device.prop - Fichier de propriétés permettant d'indiquer des informations de connectivité lors de l'utilisation de DeviceClient
it: device.prop - File di proprietà per specificare le informazioni di connettività quando viene utilizzato DeviceClient
ja: device.prop - DeviceClient が使用される際に接続情報を指定するためのプロパティー・ファイル
ko: device.prop - DeviceClient가 사용되는 경우 연결 정보를 지정하기 위한 특성 파일입니다.
pt_br: device.prop - Arquivo de propriedades usado para especificar informações de conectividade quando DeviceClient é utilizado
zh_cn: device.prop - 使用 DeviceClient 时用于指定连接信息的属性文件
zh_tw: device.prop - 內容檔，用來指定使用 DeviceClient 時的連線功能資訊

source: lib - Contains all dependent libraries
de: lib - Enthält alle abhängigen Bibliotheken.
es: lib - Contiene todas las bibliotecas dependientes.
fr: lib - Contient toutes les bibliothèquese dépendantes
it: lib - Contiene tutte le librerie dipendenti
ja: lib - すべての従属関係ライブラリーが含まれています
ko: lib - 모든 종속 라이브러리가 있습니다.
pt_br: lib - Contém todas as bibliotecas dependentes
zh_cn: lib - 包含所有依赖关系库
zh_tw: lib - 包含所有相依程式庫

source: javadoc - Contains the client library documentation
de: javadoc - Enthält die Clientbibliothekdokumentation.
es: javadoc - Contiene la documentación de la biblioteca de cliente.
fr: javadoc - Contient la documentation de la bibliothèque client
it: javadoc - Contiene la documentazione della libreria client
ja: javadoc - クライアント・ライブラリーの資料が含まれています
ko: javadoc - 클라이언트 라이브러리 문서가 있습니다.
pt_br: javadoc - Contém a documentação da biblioteca do cliente
zh_cn: javadoc - 包含客户机库文档
zh_tw: javadoc - 包含用戶端程式庫文件

source: Dependencies
de: Abhängigkeiten
es: Dependencias
fr: Dépendances
it: Dipendenze
ja: 従属関係
ko: 종속 항목
pt_br: Dependências
zh_cn: 依赖关系
zh_tw: 相依關係

source: `Paho MQTT Java Client <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.java.git/>`__ - provides a client class which enable applications to connect to an MQTT broker
de: `Paho MQTT Java Client <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.java.git/>`__ - Bietet eine Clientklasse, mit der das Verbinden von Anwendungen mit einem MQTT-Broker ermöglicht wird.
es: `Cliente Java Paho MQTT <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.java.git/>`__ - proporciona una clase de cliente que permite a las aplicaciones conectarse a un intermediario MQTT
fr: `Client Java MQTT Paho <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.java.git/>`__ - Fournit une classe client qui permet aux applications de se connecter à un courtier MQTT.
it: `Il client Java Paho MQTT <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.java.git/>`__ - fornisce una classe client che consente alle applicazioni di connettersi a un broker MQTT
ja: `Paho MQTT Java Client <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.java.git/>`__ - アプリケーションの MQTT ブローカーへの接続を可能にするクライアント・クラスを提供します
ko: `Paho MQTT Java 클라이언트 <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.java.git/>`__ - 애플리케이션이 MQTT 브로커에 연결할 수 있게 하는 클라이언트 클래스를 제공함
pt_br: `Cliente Java Paho MQTT <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.java.git/>`__ - fornece uma classe de cliente que permite que os aplicativos se conectem a um broker MQTT
zh_cn: `Paho MQTT Java 客户机 <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.java.git/>`__ - 提供使应用程序可连接到 MQTT 代理程序的客户机类
zh_tw: `Paho MQTT Java 用戶端 <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.java.git/>`__ - 提供可讓應用程式連接到 MQTT 分配管理系統的用戶端類別

source: `google-gson <https://code.google.com/p/google-gson/>`__ - library for interacting with JSON objects
de: `google-gson <https://code.google.com/p/google-gson/>`__ - Bibliothek zut Interaktion mit JSON-Objekten.
es: `google-gson <https://code.google.com/p/google-gson/>`__ - biblioteca para interactuar con objetos JSON
fr: `google-gson <https://code.google.com/p/google-gson/>`__ - Bibliothèque permettant d'interagir avec des objets JSON.
it: `google-gson <https://code.google.com/p/google-gson/>`__ - libreria per l'interazione con gli oggetti JSON
ja: `google-gson <https://code.google.com/p/google-gson/>`__ - JSON オブジェクトと対話するためのライブラリー
ko: `google-gson <https://code.google.com/p/google-gson/>`__ - JSON 오브젝트와 상호작용하기 위한 라이브러리
pt_br: `google-gson <https://code.google.com/p/google-gson/>`__ - biblioteca para interagir com objetos JSON
zh_cn: `google-gson <https://code.google.com/p/google-gson/>`__ - 用于与 JSON 对象交互的库
zh_tw: `google-gson <https://code.google.com/p/google-gson/>`__ - 用於與 JSON 物件互動的程式庫

source: `Apache Commons Logging <http://commons.apache.org/proper/commons-logging/download_logging.cgi>`__ - library for logging various informations
de: `Apache Commons Logging <http://commons.apache.org/proper/commons-logging/download_logging.cgi>`__ - Bibliothek zum Protokollieren verschiedener Informationen.
es: `Apache Commons Logging <http://commons.apache.org/proper/commons-logging/download_logging.cgi>`__ - biblioteca para registrar información diversa
fr: `Apache Commons Logging <http://commons.apache.org/proper/commons-logging/download_logging.cgi>`__ - Bibliothèque permettant de consigner différentes informations.
it: `Apache Commons Logging <http://commons.apache.org/proper/commons-logging/download_logging.cgi>`__ - libreria per registrare diverse informazioni
ja: `Apache Commons Logging <http://commons.apache.org/proper/commons-logging/download_logging.cgi>`__ - さまざまな情報をログに記録するためのライブラリー
ko: `Apache 공통 로깅 <http://commons.apache.org/proper/commons-logging/download_logging.cgi>`__ - 다양한 정보를 로그하기 위한 라이브러리
pt_br: `Criação de Log do Apache Commons <http://commons.apache.org/proper/commons-logging/download_logging.cgi>`__ - biblioteca para criação de log de várias informações
zh_cn: `Apache Commons Logging <http://commons.apache.org/proper/commons-logging/download_logging.cgi>`__ - 用于记录各种信息的库
zh_tw: `Apache Commons Logging <http://commons.apache.org/proper/commons-logging/download_logging.cgi>`__ - 用於記載各種資訊的程式庫

source: `Apache Commons Codec <https://commons.apache.org/proper/commons-codec/download_codec.cgi>`__ - provides common encoder and decoder functionalities such as Base64
de: `Apache Commons Codec <https://commons.apache.org/proper/commons-codec/download_codec.cgi>`__ - Bietet allgemeine Funktionalität zur Codierung und Decodierung, wie Base64
es: `Apache Commons Codec <https://commons.apache.org/proper/commons-codec/download_codec.cgi>`__ - proporciona funcionalidades comunes de codificador y decodificador como Base64
fr: `Codec Apache Commons <https://commons.apache.org/proper/commons-codec/download_codec.cgi>`__ - Fournit des fonctionnalités d'encodeur et de décodeur courantes, comme Base64
it: `Apache Commons Codec <https://commons.apache.org/proper/commons-codec/download_codec.cgi>`__ - fornisce funzionalità di codificatore e decodificatore comuni come ad esempio Base64
ja: <https://commons.apache.org/proper/commons-codec/download_codec.cgi>`__ - Base64 などの一般的なエンコーダー機能およびデコーダー機能を提供します
ko: `Apache 공통 코덱 <https://commons.apache.org/proper/commons-codec/download_codec.cgi>`__ - Base64와 같은 공통 인코더 및 디코더 기능을 제공합니다.
pt_br: `Apache Commons Codec <https://commons.apache.org/proper/commons-codec/download_codec.cgi>`__ - fornece funcionalidades comuns de codificador e decodificador, como Base64
zh_cn: `Apache Commons Codec <https://commons.apache.org/proper/commons-codec/download_codec.cgi>`__ - 提供常见编码器和解码器功能，例如，Base64
zh_tw: `Apache Commons Codec <https://commons.apache.org/proper/commons-codec/download_codec.cgi>`__ - 提供一般編碼器及解碼器功能（例如 Base64）

source: `Apache Commons Lang <https://commons.apache.org/proper/commons-lang/download_lang.cgi>`__ - provides methods for manipulating core Java classes
de: `Apache Commons Lang <https://commons.apache.org/proper/commons-lang/download_lang.cgi>`__ - Bietet Methoden zum Bearbeiten von Java-Kernklassen
es: `Apache Commons Lang <https://commons.apache.org/proper/commons-lang/download_lang.cgi>`__ - proporciona métodos para manipular clases Java fundamentales
fr: `Apache Commons Lang <https://commons.apache.org/proper/commons-lang/download_lang.cgi>`__ - Fournit des méthodes pour manipuler des classes Java de base
it: `Apache Commons Lang <https://commons.apache.org/proper/commons-lang/download_lang.cgi>`__ - fornisce metodi per modificare le classi Java principali
ja: `Apache Commons Lang <https://commons.apache.org/proper/commons-lang/download_lang.cgi>`__ - コア Java クラスを操作するためのメソッドを提供します
ko: `Apache 공통 Lang <https://commons.apache.org/proper/commons-lang/download_lang.cgi>`__ - 코어 Java 클래스를 조작하기 위한 메소드를 제공합니다.
pt_br: `Apache Commons Lang <https://commons.apache.org/proper/commons-lang/download_lang.cgi>`__ - fornece métodos para a manipulação das principais classes Java
zh_cn: `Apache Commons Lang <https://commons.apache.org/proper/commons-lang/download_lang.cgi>`__ - 提供操纵核心 Java 类的方法
zh_tw: `Apache Commons Lang <https://commons.apache.org/proper/commons-lang/download_lang.cgi>`__ - 提供操作核心 Java 類別的方法

source: `Apache Ant <http://ant.apache.org/>`__ - build tool for automated builds
de: `Apache Ant <http://ant.apache.org/>`__ - Build-Tool für automatisierte BBuilds.
es: `Apache Ant <http://ant.apache.org/>`__ - herramienta de compilación para compilaciones automatizadas
fr: `Apache Ant <http://ant.apache.org/>`__ - Outil permettant des générations automatisées.
it: `Apache Ant <http://ant.apache.org/>`__ - strumento di creazione per build automatiche
ja: `Apache Ant <http://ant.apache.org/>`__ - 自動ビルド用のビルド・ツール
ko: `Apache Ant <http://ant.apache.org/>`__ - 자동화된 빌드를 위한 빌드 도구
pt_br: `Apache Ant <http://ant.apache.org/>`__ - ferramenta de construção para construções automatizadas
zh_cn: `Apache Ant <http://ant.apache.org/>`__ - 自动化构建的构建工具
zh_tw: `Apache Ant <http://ant.apache.org/>`__ - 自動化建置的建置工具
