Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/java/java_deviceManagement.po
Languages: de, fr, ko

source: Location Update
de: Positionsaktualisierung
fr: Mise à jour de l'emplacement
ko: 위치 업데이트

source: Devices that can determine their location can choose to notify the Internet of Things Foundation Connect about location changes. In order to update the location, the device needs to create DeviceData instance with the DeviceLocation object first.
de: Bei Einheiten, die Ihre Position bestimmen können, kann festgelegt werden, dass Internet of Things Foundation Connect über Positionsänderungen informiert wird. Zum Aktualisieren der Position muss die Einheit eine DeviceData-Instanz mit dem DeviceLocation-Objekt zuerst erstellen.
fr: Les terminaux qui peuvent identifier leur emplacement peuvent signaler à Internet of Things Foundation Connect que l'emplacement a été modifié. Pour mettre à jour l'emplacement, le terminal doit d'abord créer l'instance DeviceLocation avec l'objet DeviceData.
ko: 위치를 판별할 수 있는 디바이스는 Internet of Things Foundation 연결에 위치 변경을 알리도록 선택할 수 있습니다. 위치를 업데이트하려면 디바이스는 먼저 DeviceLocation 오브젝트를 사용하여 DeviceData 인스턴스를 작성해야 합니다.

source: Once the device is connected to Internet of Things Foundation Connect, the location can be updated by invoking the following method:
de: Wenn die Einheit mit Internet of Things Foundation Connect verbunden ist, kann die Position durch Aufruf der folgenden Methode aktualisiert werden:
fr: Une fois que le terminal est connecté à Internet of Things Foundation Connect, vous pouvez mettre à jour l'emplacement en appelant la méthode suivante :
ko: 디바이스가 Internet of Things Foundation 연결에 연결된 후 다음 메소드를 호출하여 위치를 업데이트할 수 있습니다.

source: Later, any new location can be updated by changing the properties of the DeviceLocation object:
de: Später können alle neuen Positionen durch Ändern der Eigenschaften des DeviceLocation-Objekts aktualisiert werden:
fr: Vous pouvez modifier ultérieurement un nouvel emplacement en modifiant les propriétés de l'objet DeviceLocation :
ko: 이후에 DeviceLocation 오브젝트의 특성을 변경하여 새 위치를 업데이트할 수 있습니다.

source: The update() method informs the Internet of Things Foundation Connect about the new location.
de: Die Methode update() informiert Internet of Things Foundation Connect über die neue Position.
fr: La méthode update() signale le nouvel emplacement à Internet of Things Foundation Connect.
ko: update() 메소드는 Internet of Things Foundation 연결에 새 위치에 대해 알립니다.

source: Refer to the `documentation <../device_mgmt/operations/update.html>`__ for more information about the Location update.
de: Weitere Informationen zur Aktualisierung der Position finden Sie in der `Dokumentation <../device_mgmt/operations/update.html>`__.
fr: Pour plus d'informations sur la mise à jour d'un emplacement, reportez-vous à la `documentation <../device_mgmt/operations/update.html>`__ .
ko: 위치 업데이트에 대한 자세한 정보는 `문서 <../device_mgmt/operations/update.html>`__의 내용을 참조하십시오.

source: Append/Clear ErrorCodes
de: Fehlercodes zu Anhängen/Löschen
fr: Ajout/Effacement des codes d'erreur
ko: ErrorCode 추가/지우기

source: Devices can choose to notify the Internet of Things Foundation Connect about changes in their error status. In order to send the ErrorCodes the device needs to construct a DiagnosticErrorCode object as follows:
de: Bei Einheiten kann festgelegt auswählen, dass Internet of Things Foundation Connect über Änderungen des Fehlerstatus informiert wird. Damit die Fehlercodes gesendet werden, muss die Einheit ein DiagnosticErrorCode-Objekt wie folgt erstellen:
fr: Les terminaux peuvent signaler les modifications de leur statut d'erreur à Internet of Things Foundation Connect. Pour envoyer les codes d'erreur, le terminal doit construire un objet DiagnosticErrorCode de la manière suivante :
ko: 디바이스는 Internet of Things Foundation 연결에 오류 상태의 변경에 대해 알리도록 선택할 수 있습니다. ErrorCode를 보내려면 디바이스는 다음과 같이 DiagnosticErrorCode 오브젝트를 생성해야 합니다.

source: Once the device is connected to Internet of Things Foundation Connect, the ErrorCode can be sent by calling the send() method as follows:
de: Wenn die Einheit mit Internet of Things Foundation Connect verbunden ist, kann der Fehlercode durch Aufruf der Methode send() wie folgt gesendet werden:
fr: Une fois que le terminal est connecté à Internet of Things Foundation Connect, vous pouvez envoyer le code d'erreur en appelant la méthode send() de la manière suivante :
ko: 디바이스가 Internet of Things Foundation 연결에 연결된 후 다음과 같이 send() 메소드를 호출하여 ErrorCode를 보낼 수 있습니다.

source: Later, any new ErrorCodes can be easily added to the Internet of Things Foundation Connect by calling the append method as follows:
de: Später können alle neuen Fehlercodes leicht zu Internet of Things Foundation Connect durch Aufruf der Anhängemethode wie folgt hinzugefügt werden:
fr: Vous pouvez ajouter facilement de nouveaux codes d'erreur à Internet of Things Foundation Connect en utilisant la méthode append() de la manière suivante :
ko: 이후에 다음과 같이 append 메소드를 호출하여 Internet of Things Foundation 연결에 새 ErrorCode를 쉽게 추가할 수 있습니다.

source: Also, the ErrorCodes can be cleared from Internet of Things Foundation Connect by calling the clear() method as follows:
de: Die Fehlercodes können auch leicht aus Internet of Things Foundation Connect durch Aufruf der Methode clear() wie folgt gelöscht werden:
fr: Il est également possible d'effacer de nouveaux codes d'erreur d'Internet of Things Foundation Connect en utilisant la méthode clear() de la manière suivante :
ko: 또한 다음과 같이 clear() 메소드를 호출하여 Internet of Things Foundation 연결에서 ErrorCode를 지울 수 있습니다.

source: Append/Clear Log messages
de: Protokollnachricht Anhängen/Löschen
fr: Ajout/Effacement des messages de journal
ko: 로그 메시지 추가/지우기

source: Devices can choose to notify the Internet of Things Foundation Connect about changes by adding a new log entry. Log entry includes a log messages, its timestamp and severity, as well as an optional base64-encoded binary diagnostic data. In order to send log messages, the device needs to construct a DiagnosticLog object as follows:
de: Bei Einheiten kann festgelegt auswählen, dass Internet of Things Foundation Connect über Änderungen informiert wird, indem ein neuer Protokolleintrag hinzugefügt wird. Ein Protokolleintrag umfasst eine Protokollnachricht, ihre Zeitmarke und optional base64-codierte binäre Diagnosedaten. Damit Protokollnachrichten gesendet werden, muss die Einheit ein DiagnosticLog-Objekt wie folgt erstellen:
fr: Les terminaux peut signaler des modifications à Internet of Things Foundation Connect en ajoutant une nouvelle entrée de journal. L'entrée de journal inclut des messages de journal, l'horodatage et le niveau de gravité associés, ainsi que des données de diagnostic binaires facultatives codées en base64. Pour envoyer des messages de journal, le terminal doit construire un objet DiagnosticLog de la manière suivante :
ko: 디바이스는 새 로그 항목을 추가하여 Internet of Things Foundation 연결에 변경에 대해 알리도록 선택할 수 있습니다. 로그 항목에는 선택적 base64 인코딩된 2진 진단 데이터와 로그 메시지, 해당 시간소인 및 심각도가 포함됩니다. 로그 메시지를 보내려면 디바이스는 다음과 같이 DiagnosticLog 오브젝트를 생성해야 합니다.

source: Once the device is connected to Internet of Things Foundation Connect, the log message can be sent by calling the send() method as follows:
de: Wenn die Einheit mit Internet of Things Foundation Connect verbunden ist, kann die Protokollnachricht durch Aufruf der Methode send() wie folgt gesendet werden:
fr: Une fois que le terminal est connecté à Internet of Things Foundation Connect, vous pouvez envoyer le message de journal en appelant la méthode send() de la manière suivante :
ko: 디바이스가 Internet of Things Foundation 연결에 연결된 후 다음과 같이 send() 메소드를 호출하여 로그 메시지를 보낼 수 있습니다.

source: Later, any new log messages can be easily added to the Internet of Things Foundation Connect by calling the append method as follows:
de: Später können alle neuen Protokollnachrichten leicht zu Internet of Things Foundation Connect durch Aufruf der Anhängemethode wie folgt hinzugefügt werden:
fr: Vous pouvez ensuite ajouter facilement des messages de journal à Internet of Things Foundation Connect en utilisant la méthode append() de la manière suivante :
ko: 이후에 다음과 같이 append 메소드를 호출하여 Internet of Things Foundation 연결에 새 로그 메시지를 쉽게 추가할 수 있습니다.

source: Also, the log messages can be cleared from Internet of Things Foundation Connect by calling the clear method as follows:
de: Die Protokollnachrichten können auch leicht aus Internet of Things Foundation Connect durch Aufruf der Methode clear() wie folgt gelöscht werden:
fr: Il est également possible d'effacer des messages de journal d'Internet of Things Foundation Connect en appelant la méthode clear() de la manière suivante :
ko: 또한 다음과 같이 clear 메소드를 호출하여 Internet of Things Foundation 연결에서 로그 메시지를 지울 수 있습니다.

source: The device diagnostics operations are intended to provide information on device errors, and does not provide diagnostic information relating to the devices connection to the Internet of Things Foundation Connect.
de: Die Operationen zur Einheitendiagnose sollen Informationen zu Einheitenfehlern bereitstellen und nicht Diagnoseinformationen zur Einheitenverbindung zu Internet of Things Foundation Connect.
fr: Les opérations de diagnostic des terminaux sont conçues pour fournir des informations sur les erreurs des terminaux mais elles ne transmettent pas d'informations de diagnostic sur la connexion des terminaux à Internet of Things Foundation Connect.
ko: 디바이스 진단 오퍼레이션은 디바이스 오류에 대한 정보를 제공하기 위한 것이며 Internet of Things Foundation 연결에 대한 디바이스 연결과 관련된 진단 정보를 제공하지 않습니다.

source: Refer to the `documentation <../device_mgmt/operations/diagnostics.html>`__ for more information about the Diagnostics operation.
de: Weitere Informationen zur Diagnoseoperation finden Sie in der `Dokumentation <../device_mgmt/operations/diagnostics.html>`__.
fr: Pour plus d'informations sur l'opération de diagnostic, reportez-vous à la `documentation <../device_mgmt/operations/diagnostics.html>`__ .
ko: 진단 오퍼레이션에 대한 자세한 정보는 `문서 <../device_mgmt/operations/diagnostics.html>`__의 내용을 참조하십시오.

source: Firmware Actions
de: Firmware-Aktionen
fr: Actions sur le microprogramme
ko: 펌웨어 조치

source: The firmware update process is separated into two distinct actions:
de: Der Firmware-Update-Prozess untergliedert sich in zwei wesentliche Aktionen:
fr: La procédure de mise à jour du microprogramme se compose de deux actions distinctes :
ko: 펌웨어 업데이트 프로세스는 두 개의 개별 조치로 구분됩니다.

source: Downloading Firmware
de: Herunterladen der Firmware
fr: Téléchargement du microprogramme
ko: 펌웨어 다운로드

source: Updating Firmware.
de: Aktualisieren der Firmware
fr: Mise à jour du microprogramme
ko: 펌웨어 업데이트

source: The device needs to do the following activities to support Firmware Actions:
de: Die Einheit muss folgende Aktivitäten ausführen, damit Firmware-Aktionen unterstützt werden:
fr: Le terminal doit effectuer les opérations suivantes pour prendre en charge les actions sur le microprogramme :
ko: 디바이스는 펌웨어 조치를 지원하기 위해 다음 활동을 수행해야 합니다.

source: **1. Construct DeviceFirmware Object**
de: **1. Erstellen eines DeviceFirmware-Objekts**
fr: **1. Construire l'objet DeviceFirmware**
ko: **1. DeviceFirmware 오브젝트 생성**

source: In order to perform Firmware actions the device needs to construct the DeviceFirmware object and add it to DeviceData as follows:
de: Zum Ausführen von Firmware-Aktionen muss die Einheit das DeviceFirmware-Objekt erstellen und dieses zu DeviceData wie folgt hinzufügen:
fr: Pour effectuer des actions sur le microprogramme, le terminal doit construire l'objet DeviceFirmware et l'ajouter à DeviceData de la manière suivante :
ko: 펌웨어 조치를 수행하기 위해 디바이스는 DeviceFirmware 오브젝트를 생성하고 다음과 같이 DeviceData에 추가해야 합니다.

source: The DeviceFirmware object represents the current firmware of the device and will be used to report the status of the Firmware Download and Firmware Update actions to Internet of Things Foundation Connect.
de: Das DeviceFirmware-Objekt stellt die aktuelle Firmware der Einheit dar und wird zum Melden des Status des Firmware-Download- und Firmware-Update-Aktionen für Internet of Things Foundation Connect verwendet.
fr: L'objet DeviceFirmware représente le microprogramme en cours du terminal et est utilisé pour signaler le statut des actions de téléchargement et de mise à jour du microprogramme à Internet of Things Foundation Connect.
ko: DeviceFirmware 오브젝트는 디바이스의 현재 펌웨어를 표시하며 펌웨어 다운로드 및 펌웨어 업데이트 조치의 상태를 Internet of Things Foundation 연결에 보고하는 데 사용됩니다.

source: **2. Inform the server about the Firmware action support**
de: **2. Informieren des Servers über die Firmware-Aktionsunterstützung**
fr: **2. Signaler au serveur la prise en charge de l'action sur le microprogramme**
ko: **2. 펌웨어 조치 지원에 대해 서버에 알림**

source: The device needs to set the firmware action flag to true in order for the server to initiate the firmware request. This can be achieved by invoking a following method with a boolean value:
de: Die Einheit muss die das Firmware-Aktionsflag auf true setzen, damit der Server die Firmware-Anforderung initiieren kann. Dies kann durch Aufrufen der folgende Methode mit einem booleschen Wert erreicht werden:
fr: Le terminal doit associer l'action sur le microprogramme à la valeur true pour permettre au serveur de lancer la demande de microprogramme. Cette opération peut être effectuée en appelant la méthode suivante avec une valeur booléenne :
ko: 서버가 펌웨어 요청을 시작하도록 디바이스는 펌웨어 조치 플래그를 true로 설정해야 합니다. 부울 값으로 다음 메소드를 호출하면 가능합니다.

source: As the manage request informs the Internet of Things Foundation Connect about the firmware action support, manage() method needs to be called right after setting the firmware action support.
de: Während die Verwaltungsanforderung Internet of Things Foundation Connect über die Firmware-Aktionsunterstützung informiert, muss die Methode manage() direkt nach dem Festlegen der Firmware-Aktionsunterstützung aufgerufen werden.
fr: Comme la demande de gestion signale à Internet of Things Foundation Connect la prise en charge de l'action sur le microprogramme, la méthode manage() doit être appelée juste après la définition de la prise en charge de l'action sur le microprogramme.
ko: 관리 요청이 Internet of Things Foundation 연결에 펌웨어 조치 지원에 대해 알리므로 펌웨어 조치 지원을 설정한 후 즉시 manage() 메소드를 호출해야 합니다.

source: **3. Create the Firmware Action Handler**
de: **3. Erstellen des Firmware-Aktionshandlers
fr: **3. Créer le gestionnaire d'actions sur le microprogramme**
ko: **3. 펌웨어 조치 핸들러 작성**

source: In order to support the Firmware action, the device needs to create a handler and add it to ManagedDevice. The handler must extend a DeviceFirmwareHandler class and implement the following methods:
de: Zur Unterstützung der Firmware-Aktion muss die Einheit einen Handler erstellen und diesen zu ManagedDevice hinzufügen. Der Handler muss eine DeviceFirmwareHandler-Klasse erweitern und die folgenden Methoden implementieren:
fr: Pour prendre en charge l'action sur le microprogramme, le terminal doit créer un gestionnaire et l'ajouter à ManagedDevice. Le gestionnaire doit étendre une classe DeviceFirmwareHandler et implémenter les méthodes suivantes :
ko: 펌웨어 조치를 지원하기 위해 디바이스는 핸들러를 작성하고 ManagedDevice에 추가해야 합니다. 핸들러는 DeviceFirmwareHandler 클래스를 확장하고 다음 메소드를 구현해야 합니다.

source: **3.1 Sample implementation of downloadFirmware**
de: **3.1 Beispielimplementierung von downloadFirmware**
fr: **3.1 Exemple d'implémentation de downloadFirmware**
ko: **3.1 downloadFirmware의 샘플 구현**

source: The implementation must add logic to download the firmware and report the status of the download via DeviceFirmware object. If the Firmware Download operation is successful, then the state of the firmware to be set to DOWNLOADED and UpdateStatus should be set to SUCCESS.
de: Die Implementierung muss Logik hinzufügen, um die Firmware herunterzuladen und den Status des Downloads über das Objekt DeviceFirmware zu melden. Wenn die Firmware-Downloadoperation erfolgreich ist, muss der Status der Firmware auf DOWNLOADED gesetzt werden, und UpdateStatus muss auf SUCCESS gesetzt werden.
fr: L'implémentation doit ajouter une logique permettant de télécharger le microprogramme et signaler le statut du téléchargement via l'objet DeviceFirmware. Si l'opération de téléchargement du microprogramme aboutit, l'état du microprogramme doit correspondre à DOWNLOADED et UpdateStatus doit correspondre à SUCCESS.
ko: 구현에서는 DeviceFirmware 오브젝트를 통해 펌웨어를 다운로드하고 다운로드 상태를 보고하는 로직을 추가해야 합니다. 펌웨어 다운로드 오퍼레이션이 완료되면 펌웨어 상태를 DOWNLOADED로 설정하고 UpdateStatus를 SUCCESS로 설정해야 합니다.

source: If an error occurs during Firmware Download the state should be set to IDLE and updateStatus should be set to one of the error status values:
de: Wenn während des Firmware-Downloads ein Fehler auftritt, muss der Status auf IDLE gesetzt werden und für updateStatus muss einer der Fehlerstatuswerte festgelegt werden:
fr: Si une erreur se produit lors du téléchargement du microprogramme, l'état doit correspondre à IDLE et updateStatus doit représenter l'une des valeurs de statut d'erreur suivants :
ko: 펌웨어 다운로드 중 오류가 발생한 경우 상태를 IDLE로 설정하고 updateStatus를 오류 상태 값 중 하나로 설정해야 합니다.

source: A sample Firmware Download implementation for a Raspberry Pi device is shown below:
de: Eine Beispiel-Firmware-Download-Implementierung für eine Raspberry Pi-Einheit wird nachfolgend dargestellt:
fr: Un exemple d'implémentation du téléchargement du microprogramme sur le terminal Raspberry Pi est présenté ci-dessous :
ko: Raspberry Pi 디바이스의 샘플 펌웨어 다운로드 구현은 다음과 같습니다.

source: Device can check the integrity of the downloaded firmware image using the verifier and report the status back to Internet of Things Foundation Connect. The verifier can be set by the device during the startup (while creating the DeviceFirmware Object) or as part of the Download Firmware request by the application. A sample code to verify the same is below:
de: Die Einheit kann die Integrität des heruntergeladenen Firmware-Images prüfen, indem die Prüffunktion verwendet wird und der Status zurück an Internet of Things Foundation Connect gemeldet wird. Die Prüffunktion kann von der Einheit beim Start (beim Erstellen des DeviceFirmware-Objekts) oder als Teil der Download-Firmware-Anforderung von der Anwendung festgelegt werden. Nachfolgend ein Beispielcode zur Überprüfung:
fr: Le terminal peut vérifier l'intégrité de l'image du microprogramme téléchargé à l'aide du vérificateur et renvoyer le statut à Internet of Things Foundation Connect. Le vérificateur peut être défini par le terminal au démarrage (lors de la création de l'objet DeviceFirmware) ou dans le cadre de la demande de téléchargement du microprogramme de l'application. Un exemple de code de vérification est présenté ci-dessous :
ko: 디바이스는 검사기를 사용하여 다운로드된 펌웨어 이미지의 무결성을 검사하고 Internet of Things Foundation 연결에 상태를 다시 보고할 수 있습니다. 시작 중(DeviceFirmware 오브젝트를 작성하는 중) 또는 애플리케이션의 펌웨어 다운로드 요청의 일부분으로 디바이스가 검사기를 설정할 수 있습니다. 동일하게 검사하기 위한 샘플 코드는 다음과 같습니다.

source: The complete code can be found in the device management sample `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__.
de: Den vollständigen Code finden Sie im Einheitenmanagementbeispiel `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__.
fr: Le code complet est disponible dans l'exemple de gestion des terminaux `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__.
ko: 전체 코드는 디바이스 관리 샘플 `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__에서 찾을 수 있습니다.

source: **3.2 Sample implementation of updateFirmware**
de: **3.2 Beispielimplementierung von updateFirmware**
fr: **3.2 Exemple d'implémentation d'updateFirmware**
ko: **3.2 updateFirmware의 샘플 구현**

source: The implementation must add logic to install the downloaded firmware and report the status of the update via DeviceFirmware object. If the Firmware Update operation is successful, then the state of the firmware should to be set to IDLE and UpdateStatus should be set to SUCCESS.
de: Die Implementierung muss Logik hinzufügen, um die heruntergeladene Firmware zu installieren und den Status des Reboots über das Objekt DeviceFirmware zu melden. Wenn die Firmware-Update-Operation erfolgreich ist, muss der Status der Firmware auf IDLE gesetzt werden, und UpdateStatus muss auf SUCCESS gesetzt werden.
fr: L'implémentation doit ajouter une logique permettant d'installer le microprogramme téléchargé et de signaler le statut de mise à jour via l'objet DeviceFirmware. Si l'opération de mise à jour du microprogramme aboutit, l'état du microprogramme doit correspondre à IDLE et UpdateStatus doit correspondre à SUCCESS.
ko: 구현에서는 DeviceFirmware 오브젝트를 통해 다운로드된 펌웨어를 설치하고 업데이트 상태를 보고하는 로직을 추가해야 합니다. 펌웨어 업데이트 오퍼레이션이 완료되면 펌웨어 상태를 IDLE로 설정하고 UpdateStatus를 SUCCESS로 설정해야 합니다.

source: If an error occurs during Firmware Update, updateStatus should be set to one of the error status values:
de: Wenn während des Firmware-Updates ein Fehler auftritt, muss für updateStatus einer der Fehlerstatuswerte festgelegt werden:
fr: Si une erreur se produit lors de la mise à jour du microprogramme, updateStatus doit correspondre à l'une valeurs de statut d'erreur suivantes :
ko: 펌웨어 업데이트 중 오류가 발생한 경우 updateStatus를 오류 상태 값 중 하나로 설정해야 합니다.

source: A sample Firmware Update implementation for a Raspberry Pi device is shown below:
de: Eine Beispiel-Firmware-Update-Implementierung für eine Raspberry Pi-Einheit wird nachfolgend dargestellt:
fr: Un exemple d'implémentation de la mise à jour du microprogramme du terminal Raspberry Pi est présenté ci-dessous :
ko: Raspberry Pi 디바이스의 샘플 펌웨어 업데이트 구현은 다음과 같습니다.

source: **4. Add the handler to ManagedDevice**
de: **4. Hinzufügen des Handlers zu ManagedDevice**
fr: **4. Ajouter le gestionnaire à ManagedDevice**
ko: **4. ManagedDevice에 핸들러 추가**

source: The created handler needs to be added to the ManagedDevice instance so that the ibmiotf client library invokes the corresponding method when there is a Firmware action request from Internet of Things Foundation Connect.
de: Der erstellte Handler muss der ManagedDevice-Instanz hinzugefügt werden, sodass die ibmiotf-Clientbibliothek die entsprechende Methode aufrufen kann, wenn eine Firmware-Aktionsanforderung von Internet of Things Foundation Connect vorliegt.
fr: Le gestionnaire créé doit être ajouté à l'instance ManagedDevice pour que le bibliothèque client ibmiotf appelle la méthode correspondante lorsqu'il y a une demande d'action sur le microprogramme d'Internet of Things Foundation Connect.
ko: Internet of Things Foundation 연결로부터 펌웨어 조치 요청이 있는 경우 ibmiotf 클라이언트 라이브러리가 해당 메소드를 호출하도록, 작성된 핸들러를 ManagedDevice 인스턴스에 추가해야 합니다.

source: Refer to `this page <../device_mgmt/operations/firmware_actions.html>`__ for more information about the Firmware action.
de: Weitere Informationen zur Firmware-Aktion finden Sie auf `dieser Seite <../device_mgmt/operations/firmware_actions.html>`__.
fr: Pour plus d'informations sur l'action du microprogramme, reportez-vous à cette `page <../device_mgmt/operations/firmware_actions.html>`__.
ko: 펌웨어 조치에 대한 자세한 정보는 `이 페이지 <../device_mgmt/operations/firmware_actions.html>`__를 참조하십시오.

source: Device Actions
de: Einheitenaktionen
fr: Actions sur les terminaux
ko: 디바이스 조치

source: The Internet of Things Foundation Connect supports the following device actions:
de: Internet of Things Foundation Connect unterstützt die folgernden Einheitenaktionen:
fr: Internet of Things Foundation Connect prend en charge les actions suivantes sur les terminaux :
ko: Internet of Things Foundation 연결은 다음 디바이스 조치를 지원합니다.

source: Reboot
de: Neu starten
fr: Réamorcer
ko: 다시 부팅
