Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/java/java_deviceManagement.po
Languages: de, fr, ko

source: Java Client Library - Managed Devices
fr: Bibliothèque client Java - Terminaux gérés
ko: Java 클라이언트 라이브러리 - 관리 디바이스

source: Introduction
de: Einführung
ko: 소개

source: This client library describes how to use devices with the Java ibmiotf client library. For help with getting started with this module, see `Java Client Library - Introduction <../java/javaintro.html>`__.
de: Diese Clientbibliothek beschreibt die Verwendung von Einheiten mit der Java ibmiotf-Clientbibliothek. Hilfe bei den ersten Schritten mit diesem Modul siehe `Java-Clientbibliothek - Einführung <../java/javaintro.html>`__.
fr: Cette bibliothèque client explique comment utiliser des terminaux avec la bibliothèque client Java ibmiotf. Pour obtenir de l'aide lors de la mise en route de ce module, reportez-vous à la section `Bibliothèque client Java - Introduction <../java/javaintro.html>`__.
ko: 이 클라이언트 라이브러리는 Java ibmiotf 클라이언트 라이브러리를 가진 디바이스를 사용하는 방법을 설명합니다. 이 모듈 시작에 대한 도움말은 `Java 클라이언트 라이브러리 - 소개 <../java/javaintro.html>`__를 참조하십시오.

source: This section contains information on how devices can connect to the Internet of Things Foundation Device Management service using Java and perform device management operations like firmware update, location update, and diagnostics update.
de: Dieser Abschnitt enthält Informationen dazu, wie Einheiten die Verbindung zum Internet of Things Foundation Device Management-Service mithilfe von Java herstellen können und Einheitenmanagementoperationen (wie Firmware-Updates, Positions-Updates und Diagnose-Updates) ausführen können.
fr: Cette section contient des informations décrivant le mode de connexion des terminaux au service Internet of Things Foundation Device Management via Java, ainsi que les opérations de gestion des terminaux, comme la mise à jour du microprogramme, de l'emplacement et des programmes de diagnostic.
ko: 이 절에는 Java를 사용하여 디바이스가 Internet of Things Foundation 디바이스 관리 서비스에 연결하고 펌웨어 업데이트, 위치 업데이트 및 진단 업데이트와 같은 디바이스 관리 오퍼레이션을 수행하는 방법에 대한 정보가 있습니다.

source: The Device section contains information on how devices can publish events and handle commands using the Java ibmiotf Client Library.
de: Der Abschnitt 'Einheiten' enthält Informationen dazu, wie Einheiten Ereignisse publizieren und Befehle mit der Java ibmiotf-Clientbibliothek verarbeiten können.
fr: La section Terminal contient des informations expliquant comment les terminaux peuvent publier des événements et traiter des commandes à l'aide de la bibliothèque client Java ibmiotf.
ko: 디바이스 절에는 디바이스가 Java ibmiotf 클라이언트 라이브러리를 사용하여 이벤트를 공개하고 명령을 처리하는 방법에 대한 정보가 있습니다.

source: The Applications section contains information on how applications can use the Java ibmiotf Client Library to interact with devices.
de: Der Abschnitt mit den Anwendungen enthält Informationen, wie Anwendungen die Java ibmiotf-Clientbibliothek zur Interaktion mit Einheiten verwenden können.
fr: La section Applications contient des informations expliquant comment les applications peuvent utiliser la bibliothèque client Java ibmiotf pour interagir avec des terminaux.
ko: 애플리케이션 절은 애플리케이션이 Java ibmiotf 클라이언트 라이브러리를 사용하여 디바이스와 상호작용할 수 있는 방법에 대한 정보를 포함합니다.

source: Device Management
de: Einheitenmanagement
fr: Gestion des terminaux
ko: 디바이스 관리

source: The `device management <../reference/device_mgmt.html>`__ feature enhances the Internet of Things Foundation Connect service with new capabilities for managing devices. Device management makes a distinction between managed and unmanaged devices:
de: Von der Funktion `Einheitenmanagement <../reference/device_mgmt.html>`__ wird der Internet of Things Foundation Connect-Service um neue Funktionen zur Verwaltung von Einheiten erweitert. Vom Einheitenmanagement wird zwischen verwalteten und nicht verwalteten Einheiten unterschieden:
fr: La fonction de `gestion des terminaux <../reference/device_mgmt.html>`__ améliore le service Internet of Things Foundation Connect en offrant de nouvelles fonctionnalités pour la gestion des terminaux. Elle établit une distinction entre les terminaux gérés et les terminaux non gérés :
ko: `디바이스 관리 <../reference/device_mgmt.html>`__ 기능은 디바이스를 관리하기 위한 새 기능으로 Internet of Things Foundation 연결 서비스를 향상시킵니다. 디바이스 관리에서는 관리 디바이스와 비관리 디바이스를 명확하게 구분합니다.

source: **Managed Devices** are defined as devices which have a management agent installed. The management agent sends and receives device metadata and responds to device management commands from the Internet of Things Foundation Connect.
de: **Verwaltete Einheiten** sind Einheiten, auf denen ein Managementagent installiert ist. Vom Managementagenten werden Einheitenmetadaten gesendet und empfangen sowie auf Einheitenmanagementbefehle von Internet of Things Foundation Connect geantwortet.
fr: Les **terminaux gérés** sont des terminaux où un agent de gestion a été installé. L'agent de gestion envoie et reçoit les métadonnées des terminaux et répond aux commandes de gestion des terminaux provenant d'Internet of Things Foundation Connect.
ko: 관리 에이전트가 설치되어 있는 디바이스로 **Managed Devices**가 정의됩니다. 관리 에이전트는 디바이스 메타데이터를 전송하고 수신하며 Internet of Things Foundation 연결의 디바이스 관리 명령에 응답합니다.

source: **Unmanaged Devices** are any devices which do not have a device management agent. All devices begin their lifecycle as unmanaged devices, and can transition to managed devices by sending a message from a device management agent to the Internet of Things Foundation Connect.
de: **Nicht verwaltete Einheiten** sind Einheiten, die nicht über einen Einheitenmanagementagenten verfügen. Der Lebenszyklus jeder Einheit beginnt als nicht verwaltete Einheit; wenn vom Einheitenmanagementagenten die entsprechende Nachricht an Internet of Things Foundation Connect gesendet wird, kann sie zu einer verwalteten Einheit werden.
fr: Les **terminaux non gérés** sont des terminaux qui ne comportent pas d'agent de gestion des terminaux. Tous les terminaux commencent leur cycle de vie en tant que terminaux non gérés et peuvent devenir des terminaux gérés en envoyant un message à Internet of Things Foundation Connect via un agent de gestion des terminaux.
ko: **Unmanaged Devices**는 디바이스 관리 에이전트가 없는 디바이스입니다. 모든 디바이스는 비관리 디바이스로 라이프사이클을 시작하고 디바이스 관리 에이전트에서 Internet of Things Foundation 연결로 메시지를 전송하여 관리 디바이스로 전이할 수 있습니다.

source: Connecting to the Internet of Things Foundation Device Management Service
de: Herstellen der Verbindung zum Internet of Things Foundation Device Management-Service
fr: Connexion au service Internet of Things Foundation Device Management
ko: Internet of Things Foundation 디바이스 관리 서비스에 연결

source: Create DeviceData
de: DeviceData erstellen
fr: Créer DeviceData
ko: DeviceData 작성

source: The `device model <../reference/device_model.html>`__ describes the metadata and management characteristics of a device. The device database in the Internet of Things Foundation Connect is the master source of device information. Applications and managed devices are able to send updates to the database such as a location or the progress of a firmware update. Once these updates are received by the Internet of Things Foundation Connect, the device database is updated, making the information available to applications.
de: Vom `Einheitenmodell <../reference/device_model.html>`__ werden die Einheitenmetadaten und Managementeigenschaften einer Einheit beschrieben. Die Einheitendatenbank in Internet of Things Foundation Connect ist die Hauptquelle der Einheiteninformationen. Von Anwendungen und verwalteten Einheiten können Aktualisierungen an die Datenbank gesendet werden, zum Beispiel zur Position oder zum Fortschritt eines Firmware-Updates. Sobald diese Aktualisierungen von Internet of Things Foundation Connect empfangen werden, wird die Einheitendatenbank aktualisiert und die Informationen werden den Anwendungen zur Verfügung gestellt.
fr: Le `modèle de terminal <../reference/device_model.html>`__ décrit les métadonnées et les caractéristiques de gestion d'un terminal. La base de données de terminaux d'Internet of Things Foundation Connect représente la principale source d'informations sur les terminaux. Les applications et les terminaux gérés peuvent envoyer des mises à jour à la base de données, comme un emplacement ou la progression de la mise à jour d'un microprogramme. Une fois que ces mises à jour sont reçues par Internet of Things Foundation Connect, la base de données de terminaux est modifiée et les informations sont mises à la disposition des applications.
ko: `디바이스 모델 <../reference/device_model.html>`__에서는 디바이스의 메타데이터 및 관리 특성에 대해 설명합니다. Internet of Things Foundation 연결의 디바이스 데이터베이스는 디바이스 정보의 마스터 소스입니다. 애플리케이션 및 관리 디바이스가 펌웨어 업데이트의 진행상태 또는 위치 등 데이터베이스에 대한 업데이트를 보낼 수 있습니다. Internet of Things Foundation 연결에서 이러한 업데이트를 수신하면 디바이스 데이터베이스가 업데이트되므로 애플리케이션에서 정보를 사용할 수 있습니다.

source: The device model in the ibmiotf client library is represented as DeviceData and to create a DeviceData one needs to create the following objects,
de: Das Einheitenmodell in der ibmiotf-Clientbibliothek wird als DeviceData und zum Erstellen von DeviceData dargestellt, das zur Erstellung der folgenden Objekte erforderlich ist
fr: Le modèle de terminal inclus dans la bibliothèque client ibmiotf est représenté en tant que DeviceData. Pour créer un DeviceData, vous devez créer les objets suivants :
ko: ibmiotf 클라이언트 라이브러리의 디바이스 모델은 DeviceData로 표시되며 DeviceData를 작성하려면 다음 오브젝트를 작성해야 합니다.

source: DeviceInfo (mandatory)
de: DeviceInfo (obligatorisch)
fr: DeviceInfo (obligatoire)
ko: DeviceInfo(필수사항)

source: DeviceLocation (required if the device supports location update)
de: DeviceLocation (erforderlich, wenn die Einheit eine Positionsaktualisierung unterstützt)
fr: DeviceLocation (obligatoire si le terminal prend en charge la mise à jour de l'emplacement)
ko: DeviceLocation(디바이스가 위치 업데이트를 지원하는 경우 필수사항)

source: DiagnosticErrorCode (required if the device wants to update the ErrorCode)
de: DiagnosticErrorCode (erforderlich, wenn die Einheit den ErrorCode aktualisieren will)
fr: DiagnosticErrorCode (obligatoire si le terminal doit mettre à jour le code d'erreur)
ko: DiagnosticErrorCode(디바이스가 ErrorCode를 업데이트할 경우 필수사항)

source: DiagnosticLog (required if the device wants to update Log information)
de: DiagnosticLog (erforderlich, wenn die Einheit Protokollinformationen aktualisieren will)
fr: DiagnosticLog (obligatoire si le terminal doit mettre à jour les informations de journal)
ko: DiagnosticLog(디바이스가 로그 정보를 업데이트할 경우 필수사항)

source: DeviceFirmware (required if the device supports Firmware Actions)
de: DeviceFirmware (erforderlich, wenn die Einheit Firmware-Aktionen unterstützt)
fr: DeviceFirmware (obligatoire si le terminal prend en charge les actions sur le microprogramme)
ko: DeviceFirmware(디바이스가 펌웨어 조치를 지원하는 경우 필수사항)

source: DeviceMetadata (optional)
fr: DeviceMetadata (facultatif)
ko: DeviceMetadata(선택사항)

source: The following code snippet shows how to create the mandatory object DeviceInfo along with an optional object DeviceMetadata with sample data:
de: Das folgende Code-Snippet zeigt die Erstellung der obligatorischen DeviceInfo zusammen mit dem optionalen Objekt DeviceMetadata mit Beispieldaten:
fr: Le fragment de code suivant indique comment créer l'objet obligatoire DeviceInfo, ainsi que l'objet facultatif DeviceMetadata avec des exemples de données :
ko: 다음의 코드 스니펫은 선택적 오브젝트 DeviceMetadata를 샘플 데이터로 사용하여 필수 오브젝트 DeviceInfo를 작성하는 방법을 표시합니다.

source: The following code snippet shows how to create the DeviceData object with the above created DeviceInfo and DeviceMetadata objects:
de: Das folgende Code-Snippet zeigt die Erstellung der DeviceData zusammen mit den oben erstellten DeviceInfo- und DeviceMetadata-Objekten:
fr: Le fragment de code suivant indique comment créer l'objet DeviceData avec les objets DeviceInfo et DeviceMetadata créés ci-dessus :
ko: 다음의 코드 스니펫은 위에서 작성된 DeviceInfo 및 DeviceMetadata 오브젝트를 사용하여 DeviceData 오브젝트를 작성하는 방법을 표시합니다.

source: Construct ManagedDevice
de: ManagedDevice erstellen
fr: Construire ManagedDevice
ko: ManagedDevice 생성

source: ManagedDevice - A device class that connects the device as managed device to Internet of Things Foundation Connect and enables the device to perform one or more Device Management operations. Also the ManagedDevice instance can be used to do normal device operations like publishing device events and listening for commands from application.
de: ManagedDevice - Eine Einheitenklasse, die die Einheit als eine verwaltete Einheit mit Internet of Things Foundation Connect verbindet, und es der Einheit ermöglicht, eine oder mehrere Einheitenmanagementoperationen durchzuführen. Die ManagedDevice-Instanz kann auch verwendet werden, um normale Einheitenoperationen (wie die Publizierung von Einheitenereignissen und die Empfangsbereitschaft für Befehle von Anwendungen) auszuführen.
fr: ManagedDevice - Classe de terminaux qui connecte le terminal à Internet of Things Foundation Connect sous la forme d'un terminal géré et permet au terminal d'effectuer une ou plusieurs opérations de gestion des terminaux. L'instance ManagedDevice permet également d'effectuer des opérations standard sur les terminaux, comme la publication des événements du terminal et l'écoute des commandes de l'application.
ko: ManagedDevice - Internet of Things Foundation 연결에 관리 디바이스로 디바이스를 연결하고 디바이스가 하나 이상의 디바이스 관리 오퍼레이션을 수행할 수 있도록 지원하는 디바이스 클래스입니다. 또한 ManagedDevice 인스턴스를 사용하면 디바이스 이벤트 공개 및 애플리케이션의 명령 청취와 같은 일반 디바이스 오퍼레이션을 수행할 수 있습니다.

source: ManagedDevice exposes 2 different constructors to support different user patterns,
de: ManagedDevice stellt 2 verschiedene Konstruktoren zur Unterstützung unterschiedlicher Benutzermuster bereit
fr: ManagedDevice expose deux constructeurs différents pour prendre en charge différents modèles d'utilisateur.
ko: ManagedDevice는 여러 가지 다른 사용자 패턴을 지원하기 위해 두 개의 다른 생성자를 표시합니다.

source: **Constructor One**
de: **Konstruktor 1**
fr: **Constructeur 1**
ko: **생성자 1**

source: Constructs a ManagedDevice instance by accepting the DeviceData and the following properties,
de: Erstellung einer ManagedDevice-Instanz durch Akzeptieren der DeviceData und der folgenden Eigenschaften
fr: Construit une instance ManagedDevice en acceptant DeviceData et les propriétés suivantes :
ko: DeviceData 및 다음 특성을 허용하여 ManagedDevice 인스턴스를 생성합니다.

source: Organization-ID - Your organization ID.
de: Organization-ID - Ihre Organisations-ID.
fr: Organization-ID - ID de votre organisation.
ko: Organization-ID - 사용자의 조직 ID입니다.

source: Device-Type - The type of your device.
de: Device-Type - Der Typ Ihrer Einheit.
fr: Device-Type - Type de votre terminal.
ko: Device-Type - 사용자의 디바이스 유형입니다.

source: Device-ID - The ID of your device.
de: Device-ID - Die ID Ihrer Einheit.
fr: Device-ID - ID de votre terminal.
ko: Device-ID - 사용자 디바이스의 ID입니다.

source: Authentication-Method - Method of authentication (The only value currently supported is "token").
de: Authentication-Method - Die Methode der Authentifizierung (der einzige derzeit unterstützte Wert ist "token").
fr: Authentication-Method - Méthode d'authentification (La seule valeur actuellement prise en charge est "token").
ko: Authentication-Method - 인증 방법입니다(현재 "token" 값만 지원됨).

source: Authentication-Token - API key token
de: Authentifizierungstoken - API-Schlüsseltoken
fr: Authentication-Token - Jeton de clé d'API
ko: Authentication-Token - API 키 토큰입니다.

source: All these properties are required to interact with the Internet of Things Foundation Connect.
de: All diese Eigenschaften sind zur Interaktion mit Internet of Things Foundation Connect erforderlich.
fr: Toutes ces propriétés sont nécessaires pour interagir avec Internet of Things Foundation Connect.
ko: 이러한 모든 특성은 Internet of Things Foundation 연결과 상호작용해야 합니다.

source: The following code shows how to create a ManagedDevice instance:
de: Der folgende Code zeigt Ihnen die Erstellung einer ManagedDevice-Instanz:
fr: Le code suivant indique comment créer une instance ManagedDevice :
ko: 다음의 코드는 ManagedDevice 인스턴스를 작성하는 방법을 표시합니다.

source: The existing users of DeviceClient might observe that the names of these properties have changed slightly. These names have been changed to mirror the names in the Internet of Things Foundation Connect Dashboard, but the existing users who want to migrate from the DeviceClient to the ManagedDevice can still use the old format and construct the ManagedDevice instance as follows:
de: Die vorhandenen Benutzer von DeviceClient werden möglicherweise feststellen, dass sich die Namen dieser Eigenschaften leicht geändert haben. Die Änderung erfolgte, um die Namen im Internet of Things Foundation Connect-Dashboard, zu reflektieren; vorhandene Benutzer, die von DeviceClient zu ManagedDevice migrieren wollen, können jedoch weiterhin das alte Format verwenden und die ManagedDevice-Instanz wie folgt erstellen:
fr: Les utilisateurs existants de DeviceClient peuvent observer une légère modification des noms de ces propriétés. Ces noms ont été modifiés pour refléter les noms figurant dans le tableau de bord Internet of Things Foundation Connect mais les utilisateurs existants qui souhaitent migrer de DeviceClient vers ManagedDevice peuvent continuer à utiliser l'ancien format et construire l'instance ManagedDevice de la manière suivante :
ko: DeviceClient의 기존 사용자는 이러한 특성의 이름이 약간 변경되었음을 확인할 수 있습니다. 이러한 이름은 Internet of Things Foundation 연결 대시보드의 이름을 반영하여 변경되었지만 DeviceClient에서 ManagedDevice로 마이그레이션할 기존 사용자는 이전 형식을 계속 사용하고 다음과 같이 ManagedDevice 인스턴스를 생성할 수 있습니다.

source: **Constructor Two**
de: **Konstruktor Zwei**
fr: **Constructeur 2**
ko: **생성자 2**

source: Construct a ManagedDevice instance by accepting the DeviceData and the MqttClient instance. This constructor requires the DeviceData to be created with additional device attributes like Device Type and Device Id as follows:
de: Erstellung einer ManagedDevice-Instanz durch Akzeptieren der DeviceData- und der MqttClient-Instanz. Für diesen Konstruktor ist erforderlich, dass DeviceData mit zusätzlichen Einheitenattributen (wie Einheitentyp und Einheiten-ID) wie folgt erstellt wird:
fr: Cette classe permet de construire une instance ManagedDevice en acceptant DeviceData et l'instance MqttClient. Ce constructeur requiert la création de DeviceData avec des attributs de terminal complémentaires (comme Device Type et Device Id) de la manière suivante :
ko: DeviceData 및 MqttClient 인스턴스를 허용하여 ManagedDevice 인스턴스를 생성합니다. 이 생성자는 다음과 같이 디바이스 유형 및 디바이스 ID와 같은 추가 디바이스 속성을 사용하여 DeviceData를 작성해야 합니다.

source: Note this constructor helps the custom device users to create a ManagedDevice instance with the already created and connected MqttClient instance to take advantage of device management operations. But we recommend the users to use the library for all the device functionalities.
de: Hinweis: diese Konstruktor hilft Benutzern von Hilfetexten Einheiten, eine ManagedDevice-Instanz mit der bereits erstellten und verbundenen MqttClient-Instanz zu erstellen, um so die Operationen zum Einheitenmanagement ausnutzen zu können. Wir empfehlen jedoch, dass Benutzer die Bibliothek für sämtliche Einheitenfunktionalität verwenden.
fr: Ce constructeur permet aux utilisateurs de terminaux personnalisés de créer une instance ManagedDevice avec l'instance MqttClient déjà créée et connectée pour bénéficier des opérations de gestion des terminaux. Il est recommandé d'utiliser la bibliothèque pour toutes les fonctionnalités du terminal.
ko: 이 생성자는 디바이스 관리 오퍼레이션을 활용하기 위해 사용자 정의 디바이스 사용자가 이미 작성되고 연결된 MqttClient 인스턴스를 사용하여 ManagedDevice 인스턴스를 작성하는 데 도움이 된다는 점을 참고하십시오. 그러나 사용자는 모든 디바이스 기능의 라이브러리를 사용하도록 권장됩니다.

source: Manage
de: Verwalten
fr: Méthode Manage
ko: 관리

source: The device can invoke manage() method to participate in device management activities. The manage request will initiate a connect request internally if the device is not connected to the Internet of Things Foundation Connect already:
de: Die Einheit kann die Methode manage() zur Teilnahme in den Einheitenmanagementaktivitäten aufrufen. Die Verwaltungsanforderung initiiert intern eine Verbindungsanforderung, wenn die Einheit nicht bereits mit Things Foundation Connect verbunden ist:
fr: Le terminal peut appeler la méthode manage() pour participer aux opérations de gestion des terminaux. La demande de gestion lance une demande de connexion en interne si le terminal n'est pas encore connecté à Internet of Things Foundation Connect :
ko: 디바이스는 manage() 메소드를 호출하여 디바이스 관리 활동에 참여할 수 있습니다. 디바이스가 Internet of Things Foundation 연결에 아직 연결되지 않은 경우 관리 요청은 연결 요청을 내부적으로 시작합니다.

source: The device can use overloaded manage (lifetime) method to register the device for a given timeframe. The timeframe specifies the length of time within which the device must send another **Manage device** request in order to avoid being reverted to an unmanaged device and marked as dormant.
de: Die Einheit kann die überladene Methode zur Verwaltung (Lebensdauer) zum Registrieren der Einheit für einen angegebenen timeframe verwenden. Die timeframe gibt die Zeitdauer an, in der von der Einheit eine weitere Anforderung des Typs **Einheit verwalten** gesendet werden muss, um zu vermeiden, dass sie in den Status einer nicht verwalteten Einheit versetzt und als 'ruhend' angesehen wird.
fr: Le terminal peut utiliser la méthode de gestion (durée de vie) pour enregistrer le terminal pendant une période donnée. La période indique le laps de temps pendant lequel le terminal doit envoyer une nouvelle demande **Gérer le terminal** pour éviter de revenir à l'état de terminal non géré marqué En veille.
ko: 디바이스는 오버로드 관리(영구) 방법을 사용하여 지정된 시간 범위 동안 디바이스를 등록할 수 있습니다. 시간 범위는 비관리 디바이스로 되돌아가고 휴지 상태로 표시되는 것을 방지하기 위해 디바이스가 다른 **디바이스 관리** 요청을 전송해야 하는 시간 길이를 지정합니다.

source: Refer to the `documentation <../device_mgmt/operations/manage.html>`__ for more information about the manage operation.
de: Weitere Informationen zur Verwaltungsoperation finden Sie in der `Dokumentation <../device_mgmt/operations/manage.html>`__.
fr: Pour plus d'informations sur l'opération de gestion, reportez-vous à la `documentation <../device_mgmt/operations/manage.html>`__.
ko: 관리 오퍼레이션에 대한 자세한 정보는 `문서 <../device_mgmt/operations/manage.html>`__의 내용을 참조하십시오.

source: Unmanage
de: Nicht verwalten
fr: Méthode Unmanage
ko: 비관리

source: A device can invoke unmanage() method when it no longer needs to be managed. The Internet of Things Foundation Connect will no longer send new device management requests to this device and all device management requests from this device will be rejected other than a **Manage device** request.
de: Eine Einheit kann die Methode unmanage() aufrufen, wenn für sie keine Verwaltung mehr erforderlich ist. Von Internet of Things Foundation Connect werden dann keine neuen Einheitenmanagementanforderungen mehr an diese Einheit gesendet und alle Einheitenmanagementanforderungen von dieser Einheit bis auf die Anforderung **Einheit verwalten** werden abgelehnt.
fr: Un terminal peut appeler la méthode unmanage() lorsqu'il n'a plus besoin d'être géré. Internet of Things Foundation n'envoie plus de nouvelles demandes de gestion de terminaux à ce terminal et toutes les demandes de gestion émises par ce terminal sont rejetées, à l'exception d'une demande **Gérer le terminal**.
ko: 디바이스는 더 이상 관리 상태일 필요가 없는 경우 unmanage() 메소드를 호출할 수 있습니다. Internet of Things Foundation 연결은 더 이상 이 디바이스에 새 디바이스 관리 요청을 보내지 않으며 **디바이스 관리** 요청을 제외한 이 디바이스의 모든 디바이스 관리 요청이 거부됩니다.

source: Refer to the `documentation <../device_mgmt/operations/manage.html>`__ for more information about the Unmanage operation.
de: Weitere Informationen zur Operation zum Aufheben der Verwaltung finden Sie in der `Dokumentation <../device_mgmt/operations/manage.html>`__.
fr: Pour plus d'informations sur l'opération d'annulation de la gestion, reportez-vous à la `documentation <../device_mgmt/operations/manage.html>`__.
ko: 비관리 오퍼레이션에 대한 자세한 정보는 `문서 <../device_mgmt/operations/manage.html>`__의 내용을 참조하십시오.
