Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/java/javaintro.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: `Apache HttpClient <https://hc.apache.org/downloads.cgi>`__ - A HTTP Client library
de: `Apache HttpClient <https://hc.apache.org/downloads.cgi>`__ - Eine HTTP-Clientbibliothek.
es: `Apache HttpClient <https://hc.apache.org/downloads.cgi>`__ - Biblioteca de cliente HTTP
fr: `Apache HttpClient <https://hc.apache.org/downloads.cgi>`__ - Bibliothèque client HTTP.
it: `Apache HttpClient <https://hc.apache.org/downloads.cgi>`__ - Una libreria client HTTP
ja: `Apache HttpClient <https://hc.apache.org/downloads.cgi>`__ - HTTP クライアント・ライブラリー
ko: `Apache HttpClient <https://hc.apache.org/downloads.cgi>`__ - HTTP 클라이언트 라이브러리
pt_br: `Apache HttpClient <https://hc.apache.org/downloads.cgi>`__ - Uma biblioteca de Cliente HTTP
zh_cn: `Apache HttpClient <https://hc.apache.org/downloads.cgi>`__ - HTTP 客户机库
zh_tw: `Apache HttpClient <https://hc.apache.org/downloads.cgi>`__ - HTTP 用戶端程式庫

source: `Apache HttpCore <https://hc.apache.org/downloads.cgi>`__ - A HTTP Core library
de: `Apache HttpCore <https://hc.apache.org/downloads.cgi>`__ - Eine HTTP Core-Bibliothek.
es: `Apache HttpCore <https://hc.apache.org/downloads.cgi>`__ - Biblioteca HTTP Core
fr: `Apache HttpCore <https://hc.apache.org/downloads.cgi>`__ - Bibliothèque de base HTTP.
it: `Apache HttpCore <https://hc.apache.org/downloads.cgi>`__ - Una libreria HTTP Core
ja: `Apache HttpCore <https://hc.apache.org/downloads.cgi>`__ - HTTP コア・ライブラリー
ko: `Apache HttpCore <https://hc.apache.org/downloads.cgi>`__ - HTTP 코어 라이브러리
pt_br: `Apache HttpCore <https://hc.apache.org/downloads.cgi>`__ - Uma biblioteca de Núcleo HTTP
zh_cn: `Apache HttpCore <https://hc.apache.org/downloads.cgi>`__ - HTTP 核心库
zh_tw: `Apache HttpCore <https://hc.apache.org/downloads.cgi>`__ - HTTP 核心程式庫

source: `Joda-Time <http://www.joda.org/joda-time/download.html>`__ - The date and time library for Java
de: `Joda-Time <http://www.joda.org/joda-time/download.html>`__ - Die Bibliothek für Datum und Uhrzeit für Java.
es: `Joda-Time <http://www.joda.org/joda-time/download.html>`__ - Biblioteca de fecha y hora para Java
fr: `Joda-Time <http://www.joda.org/joda-time/download.html>`__ - Bibliothèque gérant la date et l'heure pour Java.
it: `Joda-Time <http://www.joda.org/joda-time/download.html>`__ - La libreria per la gestione della data e dell'ora per Java
ja: `Joda-Time <http://www.joda.org/joda-time/download.html>`__ - Java の日時ライブラリー
ko: `Joda-Time <http://www.joda.org/joda-time/download.html>`__ - Java의 날짜 및 시간 라이브러리
pt_br: `Joda-Time <http://www.joda.org/joda-time/download.html>`__ - A biblioteca de data e hora para Java
zh_cn: `Joda-Time <http://www.joda.org/joda-time/download.html>`__ - Java 的日期和时间库
zh_tw: `Joda-Time <http://www.joda.org/joda-time/download.html>`__ - Java 的日期和時間程式庫

source: Documentation
de: Dokumentation
es: Documentación
it: Documentazione
ja: 資料
ko: 문서
pt_br: Documentação
zh_tw: 文件

source: `Device Client <../java/java_cli_devices.html>`__
de: `Einheitenclient Client <../java/java_cli_devices.html>`__
es: `Cliente de dispositivo <../java/java_cli_devices.html>`__
fr: `Client de terminal <../java/java_cli_devices.html>`__
it: `Client dispositivo <../java/java_cli_devices.html>`__
ja: `デバイス・クライアント <../java/java_cli_devices.html>`__
ko: `디바이스 클라이언트 <../java/java_cli_devices.html>`__
pt_br: `Cliente do Dispositivo <../java/java_cli_devices.html>`__
zh_tw: `裝置用戶端 <../java/java_cli_devices.html>`__

source: `Managed Device <../java/java_deviceManagement.html>`__
de: `Verwaltete Einheit <../java/java_deviceManagement.html>`__
es: `Dispositivo gestionado <../java/java_deviceManagement.html>`__
fr: `Terminal géré <../java/java_deviceManagement.html>`__
it: `Dispositivo gestito <../java/java_deviceManagement.html>`__
ja: `管理デバイス <../java/java_deviceManagement.html>`__
ko: `관리 디바이스 <../java/java_deviceManagement.html>`__
pt_br: `Dispositivo Gerenciado <../java/java_deviceManagement.html>`__
zh_tw: `受管理裝置 <../java/java_deviceManagement.html>`__

source: This `Java Client Library <https://github.com/ibm-messaging/iot-java/releases/latest>`__ can be used to simplify interactions with the `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__. The documentation is divided into three sections:
zh_cn: `Java 客户机库 <https://github.com/ibm-messaging/iot-java/releases/latest>`__ 可用于简化与 `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ 的交互。此文档分为三个部分：

source: The `Devices section <../java/java_cli_devices.html>`__ contains information on how devices publish events and handle commands using the Java ibmiotf Client Library.
zh_cn: `设备部分 <../java/java_cli_devices.html>`__ 中包含有关设备如何使用 Java ibmiotf 客户机库发布事件和处理命令的信息。

source: The `Managed Device section <../java/java_deviceManagement.html>`__ contains information on how devices can connect to the Internet of Things Foundation Device Management service using Java ibmiotf Client Library and perform device management operations like firmware update, location update, and diagnostics update.
zh_cn: `受管设备部分 <../java/java_deviceManagement.html>`__ 包含的信息涉及设备如何使用 Java ibmiotf 客户机库连接到“Internet of Things Foundation 设备管理”服务，以及设备如何执行设备管理操作，如固件更新、位置更新和诊断更新。

source: The `Applications section <../java/java_cli_app.html>`__ details how applications can use the Java ibmiotf Client Library to interact with devices.
zh_cn: `应用程序部分 <../java/java_cli_app.html>`__ 详述了应用程序如何使用 Java ibmiotf 客户机库与设备交互。

source: This Java Client Library requires Oracle Java 7 or later,
zh_cn: 此 Java 客户机库需要 Oracle Java 7 或更高版本，
