Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/java/java_deviceManagement.po
Languages: de, fr, ko

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__ that shows how to connect the Raspberry Pi device as managed device to Internet of Things Foundation Connect to perform various device management operations in step by step using this client library.
de: Gehen Sie zu `der Anleitung <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__ Diese zeigt Ihnen das Verbinden der Raspberry Pi-Einheit als verwaltete Einheit mit Internet of Things Foundation Connect zum Ausführen verschiedener Einheitenmanagementoperationen, und zwar schrittweise unter Verwendung dieser Clientbibliothek.
fr: Reportez-vous à la `recette <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__ qui explique comment connecter le terminal Raspberry Pi en tant que terminal géré à Internet of Things Foundation Connect pour effectuer différentes opérations de gestion des terminaux à l'aide de cette bibliothèque client.
ko: 이 클라이언트 라이브러리를 사용하여 다양한 디바이스 관리 오퍼레이션을 단계별로 수행하기 위해 Internet of Things Foundation 연결에 관리 디바이스로 Raspberry Pi 디바이스를 연결하는 방법을 표시하는 `지침서 <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__의 내용을 참조하십시오.

source: Java Client Library - Managed Device
de: Java-Clientbibliothek - Verwaltete Einheit
