Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/getting_started/quickstart/index.po
Languages: es, fr, ko

source: `Quickstart <https://quickstart.internetofthings.ibmcloud.com>`_ is an open sandbox allowing developers to quickly and easily get devices connected to the Watson IoT platform with registration required. Any device that can run an MQTT client can be connected to Quickstart within mimimum fuss, `DeveloperWorks Recipes <https://developer.ibm.com/recipes>`_ features dozens of community produced tutorials for connecting different devices to the service, including but not limited to:
es: `Quickstart <https://quickstart.internetofthings.ibmcloud.com>`_ es un recinto de pruebas abierto que permite a los desarrolladores conectar de forma rápida y sencilla a Watson IoT Platform con el registro necesario. Cualquier dispositivo que pueda ejecutar un cliente MQTT puede conectarse a Quickstart con un mucha facilidad; `las recetas de DeveloperWorks <https://developer.ibm.com/recipes>`_ incorporan docenas tutoriales producidos por la comunidad para la conexión de distintos dispositivos al servicio, que incluyen, sin limitarse a ellos, los siguientes:
fr: `L'application Quickstart <https://quickstart.internetofthings.ibmcloud.com>`_ est un bac à sable ouvert qui permet aux développeurs de connecter rapidement et facilement des terminaux à Watson IoT Platform, pour lesquels l'enregistrement est requis. Tout terminal pouvant exécuter un client MQTT peut être connecté à Quickstart avec un minimum d'efforts. La page `DeveloperWorks Recipes <https://developer.ibm.com/recipes>`_ propose des douzaines de tutoriels rédigés par la communauté pour la connexion de différents terminaux au service, notamment :
ko: `Quickstart <https://quickstart.internetofthings.ibmcloud.com>`_는 개발자가 디바이스를 Watson IoT Platform에 빠르고 쉽게 연결할 수 있도록 허용하는 개방형 샌드박스입니다. 단, 등록이 필요합니다. MQTT 클라이언트를 실행할 수 있는 디바이스라면 간편하게 Quickstart에 연결할 수 있습니다. DeveloperWorks Recipes <https://developer.ibm.com/recipes>`_ 는 여러 디바이스를 서비스에 연결하는 것과 관련된 많은 커뮤니티 생성 학습서를 제공합니다. 그러나 그것으로 한정되지는 않습니다.

source: Simulated Device
es: Dispositivo simulado
fr: Terminal simulé
ko: 시뮬레이션된 디바이스

source: In addition to these, we have developed a simple browser-based simulated device, designed for mobile devices, that can be used to connect any device with a web browser to the service. Open the following URL on a mobile phone or tablet in your favourite browser: http://quickstart.internetofthings.ibmcloud.com/iotsensor.
es: Además de estos, hemos desarrollado un sencillo dispositivo simulado basado en navegador, diseñado para dispositivos móviles, que se puede emplear para conectar al servicio cualquier dispositivo que cuente con un navegador web. Abra el siguiente URL en un teléfono móvil o una tableta en su navegador favorito: http://quickstart.internetofthings.ibmcloud.com/iotsensor.
fr: De plus, nous avons développé un terminal simulé simple reposant sur un navigateur et conçu pour les terminaux mobiles, qui peut être utilisé pour connecter tout terminal possédant un navigateur Web au service. Ouvrez l'adresse URL suivante sur un téléphone portable ou une tablette dans le navigateur de votre choix : http://quickstart.internetofthings.ibmcloud.com/iotsensor.
ko: 이외에도, 모바일 디바이스용으로 설계된 단순한 브라우저 기반의 시뮬레이션된 디바이스를 개발했습니다. 이 디바이스를 사용하면 웹 브라우저가 있는 모든 디바이스를 서비스에 연결할 수 있습니다. 휴대전화 또는 태블릿에서 다음 URL을 선호하는 브라우저에서 여십시오. http://quickstart.internetofthings.ibmcloud.com/iotsensor

source: This will launch a browser-based simulated device connecting to the Watson IoT platform. There are three sensors which you can manipulate using the on-screen controls:
es: Esto iniciará un dispositivo simulado basado en navegador que se conectará a Watson IoT Platform. Existen tres sensores que se pueden manipular mediante los controles en pantalla:
fr: Un terminal simulé reposant sur un navigateur et qui se connecte à Watson IoT Platform est lancé. Vous pouvez manipuler trois capteurs à l'aide des commandes à l'écran :
ko: 그러면 브라우저 기반의 시뮬레이션된 디바이스가 실행되어 Watson IoT Platform에 연결됩니다. 화면 컨트롤을 사용하여 조작할 수 있는 세 개의 센서가 있습니다.

source: Temperature
es: Temperatura
fr: Température
ko: 온도

source: Humidity
es: Humedad
fr: Humidité
ko: 습도

source: Object temperature
es: Temperatura del objeto
fr: Température de l'objet
ko: 오브젝트 온도

source: Data Visualization
es: Visualización de datos
fr: Visualisation de données
ko: 데이터 시각화

source: Leaving the simulated device running on your phone/tablet launch the `Quickstart application <http://quickstart.internetofthings.ibmcloud.com>`_ and enter the 12 character generated ID displayed on your phone/tablet in the upper right-hand corner.
es: Deje el dispositivo simulado en ejecución en su teléfono o tableta, inicie la `aplicación Quickstart <http://quickstart.internetofthings.ibmcloud.com>`_ y especifique el ID generado de 12 caracteres que se muestra en dicho teléfono o tableta, en la esquina superior derecha.
fr: Laissez le terminal simulé s'exécuter sur votre téléphone/tablette et lancez `l'application Quickstart <http://quickstart.internetofthings.ibmcloud.com>`_, puis entrez l'ID de 12 caractères généré sur votre téléphone/tablette dans le coin supérieur droit.
ko: 시뮬레이션된 디바이스가 전화/태블릿에서 실행 중인 상태에서 `Quickstart 애플리케이션 <http://quickstart.internetofthings.ibmcloud.com>`_을 실행하고 전화/태블릿의 오른쪽 위에 표시되는 12자로 생성된 ID를 입력하십시오.

source: Now, as you adjust the sensor values in your simulated device you will be able to see the data from your device visualized in real time in the Quickstart application.
es: A continuación, cuando ajuste los valores de los sensores en su dispositivo simulado, podrá ver los datos de su dispositivo visualizado en tiempo real en la aplicación Quickstart.
fr: A présent, alors que vous ajustez les valeurs de détection dans votre terminal simulé, vous pouvez afficher en temps réel les données de votre terminal visualisées dans l'application Quickstart.
ko: 이제 시뮬레이션된 디바이스에서 센서 값을 조정하는 것처럼, 시각화된 디바이스의 데이터를 Quickstart 애플리케이션에서 실시간으로 볼 수 있습니다.

source: Mosquitto Demonstration
es: Demostración de Mosquitto
fr: Démonstration Mosquitto
ko: Mosquitto 데모

source: `Mosquitto <http://mosquitto.org/>`_ is a cross platform open source MQTT client that is perfect for experimenting with the Watson IoT platform service. Once you have installed mosquitto pick an ``<applicationId>``, a ``<deviceId>`` that have a good chance to be unique (otherwise your experiment will clash with someone else running through this same demonstration).
es: `Mosquitto <http://mosquitto.org/>`_ es un cliente de MQTT multiplataforma de código abierto que resulta perfecto para experimentar con el servicio de Watson IoT Platform. Cuando haya instalado Mosquitto, seleccione un ``<applicationId>`` y un ``<deviceId>`` que tengan muchas posibilidades de ser exclusivos (en caso contrario, su experimento entrará en conflicto con otra persona que esté ejecutando esta misma demostración).
fr: `Mosquitto <http://mosquitto.org/>`_ est un client MQTT open source multiplateforme idéal pour tester le service Watson IoT Platform. Après avoir installé Mosquitto, choisissez un ID d'application (``<applicationId>``) et un ID terminal (``<deviceId>``) uniques (si ces éléments ne sont pas uniques, il y aura conflit avec un autre utilisateur exécutant cette démonstration).
ko: `Mosquitto <http://mosquitto.org/>`_는 크로스 플랫폼 오픈 소스 MQTT 클라이언트로서, Watson IoT Platform 서비스를 사용하여 테스트하는 데 안성맞춤입니다. mosquitto를 설치했으면 고유성을 보장하도록 ``<applicationId>``, ``<deviceId>``를 선택하십시오. (그렇지 않으면 사용자의 테스트가 동일한 데모를 통해 실행 중인 다른 사람과 충돌합니다.)

source: There are a couple of restrictions you must consider when deciding on these IDs:
es: A la hora de decidir dichos ID, debe tener en cuenta un par de restricciones:
fr: Vous devez prendre en compte deux restrictions lorsque vous choisissez ces ID :
ko: 해당 ID를 결정할 때 고려해야 할 두 가지 제한사항이 있습니다.

source: Maximum length of 36 characters
es: Longitud máxima de 36 caracteres
fr: La valeur ne peut pas comporter plus de 36 caractères.
ko: 최대 길이 36자

source: Must comprise only alpha-numeric characters (``a-z``, ``A-Z``, ``0-9``) and the following special characters:
es: Deben constar solo de caracteres alfanuméricos (``a-z``, ``A-Z``, ``0-9``) y de los siguientes caracteres especiales:
fr: La valeur ne peut comporter que des caractères alphanumériques (``a-z``, ``A-Z``, ``0-9``) et les caractères spéciaux suivants :
ko: 영숫자 문자(``a-z``, ``A-Z``, ``0-9``) 및 다음 특수 문자만 포함해야 함:

source: dash (``-``)
es: guion (``-``)
fr: tiret (``-``)
ko: 대시(``-``)

source: underscore (``_``)
es: subrayado (``_``)
fr: trait de soulignement (``_``)
ko: 밑줄(``_``)

source: dot (``.``)
es: punto (``.``)
fr: point (``.``)
ko: 점(``.``)

source: With your ``<applicationId>`` and ``<deviceId>`` in hand the first thing you want to do is create a connection representing your application using ``mosquitto_sub``. Using examples of ``<applicationId>`` = myApplicationId and ``<deviceId>`` = myDeviceId:
es: Con el ``<applicationId>`` y el ``<deviceId>`` a mano, lo primero que debe hacer es crear una conexión que represente a su aplicación mediante ``mosquitto_sub``. Emplee ejemplos de ``<applicationId>`` = myApplicationId y ``<deviceId>`` = myDeviceId:
fr: Une fois les éléments ``<applicationId>`` et ``<deviceId>`` définis, commencez par créer une connexion représentant votre application avec ``mosquitto_sub``, avec ``<applicationId>`` = myApplicationId et ``<deviceId>`` = myDeviceId :
ko: ``<applicationId>`` 및 ``<deviceId>``가 준비되면 먼저 ``mosquitto_sub``를 사용하는 애플리케이션을 나타내는 연결을 작성하십시오. ``<applicationId>``의 사용 예는 myApplicationId이며 ``<deviceId>``의 경우 myDeviceId입니다.

source: Leave that process running, it is now time to turn your attention towards creating your device. We will connect a device of type ``mosquitto`` and send two events to the service using ``mosquitto_pub``:
es: Deje ese proceso en funcionamiento; ahora es el momento de prestar atención a la creación de su dispositivo. Conectaremos un dispositivo del tipo ``mosquitto`` y enviaremos dos sucesos al servicio mediante ``mosquitto_pub``:
fr: Laissez ce processus s'exécuter. Il est temps à présent de créer votre terminal. Vous allez connecter un terminal de type ``mosquitto`` et envoyer deux événements au service à l'aide de ``mosquitto_pub`` :
ko: 해당 프로세스가 실행 중인 상태에서 이제 디바이스를 작성하십시오. ``mosquitto`` 유형의 디바이스를 연결한 다음 ``mosquitto_pub``를 사용하여 서비스에 두 개의 이벤트를 전송할 것입니다.

source: Returning to your application terminal you should see the two events that you published almost instantly:
es: Vuelva al terminal de la aplicación y debería ver los dos sucesos que ha publicado casi al instante:
fr: Si vous revenez sur le terminal de votre application, vous devriez voir les deux événements que vous avez publiés presque instantanément :
ko: 애플리케이션 터미널로 돌아오면 공개한 두 개의 이벤트가 즉시 표시되어야 합니다.

source: That's all there is to it. You have successfully connected a device and an application to the Watson IoT platform over MQTT, sent an event from the device to the service and recieved that event in your application.
es: Eso es todo lo que tiene que hacer. Ha conectado correctamente un dispositivo y una aplicación a Watson IoT Platform a través MQTT, ha enviado un suceso del dispositivo al servicio y ha recibido dicho suceso en su aplicación.
fr: Voilà ! Vous avez connecté un terminal et une application à Watson IoT Platform via MQTT, envoyé un événement du terminal au service, et reçu cet événement dans votre application.
ko: 이것으로 끝입니다. MQTT를 통해 디바이스와 애플리케이션을 Watson IoT Platform에 성공적으로 연결하고, 이벤트를 디바이스에서 서비스로 전송하여 애플리케이션에서 수신했습니다.
