Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/embedded_c.po
Languages: es, fr

source: Embedded C for Device Developers
es: Embedded C para desarrolladores de dispositivos
fr: Embedded C pour les développeurs de terminaux

source: See `iotf-embeddedc <https://github.com/ibm-messaging/iotf-embeddedc>`_ on GitHub
es: Consulte `iotf-embeddedc <https://github.com/ibm-messaging/iotf-embeddedc>`_ en GitHub
fr: Voir `iotf-embeddedc <https://github.com/ibm-messaging/iotf-embeddedc>`_ dans GitHub

source: Dependencies
es: Dependencias
fr: Dépendances

source: `Eclipse Paho Embedded C library <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.embedded-c.git/>`__ - provides an MQTT C client library, check `here <http://www.eclipse.org/paho/clients/c/embedded/>`__ for more information.
es: `La biblioteca Embedded C de Eclipse Paho <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.embedded-c.git/>`__ - proporciona una biblioteca de cliente C MQTT; consulte `aquí <http://www.eclipse.org/paho/clients/c/embedded/>`__ para obtener más información.
fr: `Bibliothèque Embedded C Eclipse Paho <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.embedded-c.git/>`__ - Fournit une bibliothèque client C MQTT. Pour plus d'informations, cliquez `ici <http://www.eclipse.org/paho/clients/c/embedded/>`__.

source: Installation
es: Instalación

source: To install the IoT Platform client library for Embedded C follow the instructions below.
es: Para instalar la biblioteca de cliente de IoT Platform para Embedded C, siga las instrucciones siguientes.
fr: Pour installer la bibliothèque client Embedded C d'IoT Platform, procédez comme suit :

source: To install the latest version of the library, enter the following code in your command line.
es: Para instalar la versión más reciente de la biblioteca, entre el código siguiente en la línea de mandatos.
fr: Pour installer la dernière version de la bibliothèque, entrez le code suivant sur la ligne de commande.

source: Copy the Paho library .tar file that was downloaded in the previous step to the *lib* directory.
es: Copie el archivo .tar de biblioteca Paho que se ha descargado en el paso anterior en el directorio *lib*.
fr: Copiez le fichier .tar de la bibliothèque Paho téléchargé à l'étape précédente pour le placer dans le répertoire *lib*.

source: Extract the library file
es: Extraer el archivo de biblioteca
fr: Extrayez le fichier bibliothèque.

source: When downloaded, the client has the following file structure:
es: Cuando se ha descargado, la cliente tiene la siguiente estructura de archivos:
fr: Une fois téléchargé, le client possède la structure de fichiers suivante :

source: Initializing the Client Library
es: Inicialización de la biblioteca de cliente
fr: Initialisation de la bibliothèque client

source: After downloading the client library, it must be initialized and connected to the IoT Platform. There are 2 ways to initialize the IoT Platform Client Library for Embedded C:
es: Después de descargar la biblioteca de cliente, esta se debe inicializar y conectar a IoT Platform. Existen 2 maneras de inicializar la biblioteca de cliente de IoT Platform para Embedded C:
fr: Une fois téléchargée, la bibliothèque client doit être initialisée et connectée à IoT Platform. Vous disposez de deux méthodes pour initialiser la bibliothèque client Embedded C d'IoT Platform :

source: Passing as Parameters
es: Transferencia como parámetros
fr: Transmission sous la forme de paramètres

source: The 'initialize' function takes the following details to connect to the IoT Platform service:
es: La función 'initialize' toma los detalles siguientes para conectarse al servicio de IoT Platform:
fr: La fonction 'initialize' utilise les informations suivantes pour se connecter au service IoT Platform :

source: client - Pointer to the *iotfclient*
es: client - Puntero a *iotfclient*
fr: client - Pointeur vers *iotfclient*

source: org - Your organization ID
es: org - ID de la organización
fr: org - ID de votre organisation

source: type - The type of your device
es: type - Tipo de dispositivo
fr: type - Type de terminal

source: id - The device ID
es: id - ID de dispositivo
fr: id - ID du terminal

source: authmethod - Method of authentication (the only value currently supported is "token")
es: authmethod - Método de autenticación (el único valor soportado actualmente es "token").
fr: authmethod - Méthode d'authentification. (La seule valeur actuellement prise en charge est "token".)

source: authtoken - API key token (required if auth-method is "token")
es: authtoken - Señal de clave de API (necesario si auth-method es "token").
fr: authtoken - Jeton de la clé d'API (obligatoire si auth-method a pour valeur "token").

source: Using a Configuration File
es: Uso de un archivo de configuración
fr: Utilisation d'un fichier de configuration

source: You can also use a configuration file to initialize the Embedded C client library. The function 'initialize\_configfile' takes the configuration file path as a parameter.
es: También puede utilizar un archivo de configuración para inicializar la biblioteca de cliente de Embedded C. La función 'initialize\_configfile' toma la vía de acceso de archivo de configuración como parámetro.
fr: Vous pouvez également utiliser un fichier de configuration pour initialiser la bibliothèque client Embedded C. La fonction 'initialize\_configfile' utilise le chemin du fichier de configuration comme paramètre.

source: The configuration file must use the following format.
es: El archivo de configuración debe utilizar el formato siguiente.
fr: Le fichier de configuration doit utiliser le format suivant :

source: Connecting to the Service
es: Conexión con el servicio
fr: Connexion au service

source: After initializing the IoT Platform Embedded C client library, you can connect to the IoT Platform by calling the 'connectiotf' function.
es: Después de inicializar la biblioteca de cliente de Embedded C de IoT Platform, no puede conectarse a IoT Platform mediante una llamada a la función 'connectiotf'.
fr: Après avoir initialisé la bibliothèque client Embedded C d'IoT Platform, vous pouvez vous connecter à IoT Platform en appelant la fonction 'connectiotf'.

source: Handling commands
es: Manejo de mandatos
fr: Traitement des commandes

source: When the device client connects, it automatically subscribes to any command for this device. To process specific commands you need to register a command callback function by calling the function 'setCommandHandler'. The commands are returned as:
es: Cuando el cliente de dispositivo se conecta, se suscribe automáticamente a cualquier mandato para ese dispositivo. Para procesar mandatos específicos necesita registrar una función de devolución de llamada de mandato llamando a la función 'setCommandHandler'. Los mandatos se devuelven como:
fr: Lorsque le client du terminal se connecte, il s'abonne automatiquement aux commandes de ce terminal. Pour traiter des commandes spécifiques, vous devez enregistrer une fonction de rappel de commande en appelant la fonction 'setCommandHandler'. Les commandes sont renvoyées sous la forme suivante :

source: commandName - name of the command invoked
es: commandName - nombre del mandato invocado
fr: commandName - Nom de la commande appelée

source: format - e.g json, xml
es: format - por ejemplo json, xml
fr: format - Par exemple json, xml

source: The 'yield' function must be called periodically to receive commands.
es: Es necesario llamar de forma periódica a la función 'yield' para recibir mandatos.
fr: Vous devez appeler la fonction 'yield' régulièrement pour recevoir des commandes.

source: Publishing events
es: Publicación de sucesos
fr: Publication d'événements

source: Events can be published by using:
es: Se pueden publicar sucesos utilizando:
fr: Vous pouvez publier des événements en utilisant :

source: eventType - Type of event to be published e.g status, gps
es: eventType - Tipo de suceso a publicar, por ejemplo estado, gps
fr: eventType - Type d'événement à publier, par exemple le statut ou la géolocalisation

source: eventFormat - Format of the event e.g json
es: eventFormat - Formato del suceso, por ejemplo json
fr: eventFormat - Format de l'événement, par exemple json

source: data - Payload of the event
es: data - Carga útil del suceso
fr: data - Contenu de l'événement

source: QoS - qos for the publish event. Supported values : QOS0, QOS1, QOS2
es: QoS - calidad de servicio para el suceso de publicación. Valores soportados : QOS0, QOS1, QOS2
fr: QoS - Qualité de service utilisée pour la publication de l'événement. Valeurs admises : QOS0, QOS1 et QOS2

source: Disconnect Client
es: Desconectar cliente
fr: Déconnexion du client

source: To disconnect the client and release the connections, run the following code snippet.
es: Para desconectar el cliente y liberar las conexiones, ejecute el siguiente fragmento de código.
fr: Pour déconnecter le client et libérer les connexions, exécutez le fragment de code ci-dessous.

source: Samples
es: Ejemplos
fr: Exemples

source: Sample device and application code is provided in `GitHub <https://github.com/ibm-messaging/iotf-embeddedc/tree/master/samples>`_.
es: Se suministran códigos de dispositivo y aplicaciones en 'GitHub <https://github.com/ibm-messaging/iotf-embeddedc/tree/master/samples>'_.
fr: Des exemples de code de terminal et d'application sont disponibles dans `GitHub <https://github.com/ibm-messaging/iotf-embeddedc/tree/master/samples>`_.
