Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/java.po
Languages: fr, ko

source: Java for Device Developers
fr: Java pour les développeurs de terminaux
ko: 디바이스 개발자용 Java

source: See `iot-java <https://github.com/ibm-messaging/iot-java>`_ in GitHub
fr: Voir `iot-java <https://github.com/ibm-messaging/iot-java>`_ dans GitHub
ko: GitHub에서 `iot-java <https://github.com/ibm-messaging/iot-java>`_ 참조

source: Constructor
fr: Constructeur
ko: 생성자

source: The constructor builds the client instance, and accepts a Properties object containing the following definitions:
fr: Le constructeur génère l'instance client et accepte un objet Properties contenant les définitions suivantes :
ko: 생성자는 클라이언트 인스턴스를 빌드하고 다음 정의가 포함된 특성 오브젝트를 승인합니다.

source: org - Your organization ID. (This is a required field. In case of quickstart flow, provide org as quickstart.)
fr: org - ID de votre organisation. (Cette zone est obligatoire. Dans le cas d'un flux Quickstart, indiquez quickstart comme organisation.)
ko: org - 조직 ID. (필수 필드입니다.) quickstart 플로우의 경우 org를 quickstart로 제공하십시오.

source: type - The type of your device. (This is a required field.)
fr: Type - Type de terminal. (Cette zone est obligatoire.)
ko: type - 디바이스의 유형. (필수 필드입니다.)

source: id - The ID of your device. (This is a required field.
fr: id - ID de votre terminal. (Cette zone est obligatoire.)
ko: id - 디바이스의 ID. (필수 필드입니다.)

source: auth-method - Method of authentication (This is an optional field, needed only for registered flow and the only value currently supported is "token").
fr: auth-method - Méthode d'authentification. (Cette zone est facultative. Elle est nécessaire uniquement pour le flux enregistré. La seule valeur actuellement prise en charge est "token".)
ko: auth-method - 인증 방법(이는 선택적 필드이며 등록된 플로우 및 현재 지원되는 유일한 값이 "토큰"인 경우에만 필요함).

source: auth-token - API key token (This is an optional field, needed only for registered flow).
fr: auth-token - Jeton de clé d'API. (Cette zone est facultative. Elle est nécessaire uniquement pour le flux enregistré.)
ko: auth-token - API 키 토큰(이는 선택적 필드이며 등록된 플로우에만 필요함).

source: clean-session - true or false (required only if you want to connect the application in durable subscription. By default the clean-session is set to true).
fr: clean-session - true ou false (requis uniquement si vous voulez connecter l'application dans un abonnement durable. Par défaut, clean-session a pour valeur true.)
ko: clean-session - true 또는 false입니다. 애플리케이션을 지속적 구독에 연결하려는 경우에만 필수입니다. 기본적으로 clean-session은 true로 설정해야 합니다.

source: One must set ``clean-session`` to false to connect the device in durable subscription. Refer to `Subscription Buffers and Clean Session <https://docs.internetofthings.ibmcloud.com/reference/mqtt/index.html#/subscription-buffers-and-clean-session#subscription-buffers-and-clean-session>`__ for more information about the clean session.
fr: Vous devez associer ``clean-session`` à la valeur false pour connecter le terminal dans un abonnement durable. Pour plus d'informations sur l'option 'clean session', voir `Mémoires tampons des abonnements et option 'clean session' <https://docs.internetofthings.ibmcloud.com/reference/mqtt/index.html#/subscription-buffers-and-clean-session#subscription-buffers-and-clean-session>`__.
ko: 디바이스를 지속적 구독에 연결하려면 ``clean-session``을 false로 설정해야 합니다. 정리 세션에 대한 자세한 정보는 `구독 버퍼 및 정리 세션 <https://docs.internetofthings.ibmcloud.com/reference/mqtt/index.html#/subscription-buffers-and-clean-session#subscription-buffers-and-clean-session>`__ 을 참조하십시오.

source: The Properties object creates definitions which are used to interact with the IoT Platform module.
fr: L'objet Properties crée des définitions qui permettent d'interagir avec le module IoT Platform.
ko: 특성 오브젝트는 IoT Platform 모듈과 상호작용하는 데 사용되는 정의를 작성합니다.

source: The following code shows a device publishing events in a Quickstart mode.
fr: Le code suivant présente un terminal qui publie des événements en mode Quickstart.
ko: 다음 코드는 Quickstart 모드에서 이벤트를 공개하는 디바이스를 표시합니다.

source: The following program shows a device publishing events in a registered flow
fr: Le programme suivant présente un terminal qui publie des événements dans un flux enregistré.
ko: 다음 프로그램은 등록된 플로우에서 이벤트를 공개하는 디바이스를 표시합니다.

source: Using a configuration file
fr: Utilisation d'un fichier de configuration
ko: 구성 파일 사용

source: Instead of including a Properties object directly, you can use a configuration file containing the name-value pairs for Properties. If you are using a configuration file containing a Properties object, use the following code format.
fr: Au lieu d'inclure un objet Properties directement, vous pouvez utiliser un fichier de configuration contenant les paires nom-valeur de l'objet Properties. Si vous utilisez un fichier de configuration contenant un objet Properties, utilisez le format de code suivant :
ko: 특성 오브젝트를 직접 포함하는 대신 특성에 대한 이름 값 쌍이 포함된 구성 파일을 사용할 수 있습니다. 특성 오브젝트가 포함된 구성 파일을 사용 중인 경우 다음 코드 형식을 사용하십시오.

source: The content of the configuration file must be in the following format:
fr: Le fichier de configuration de l'application doit posséder le format suivant :
ko: 구성 파일 컨텐츠의 형식은 다음 형식이어야 합니다.

source: Connecting to the Watson IoT Platform
fr: Connexion à Watson IoT Platform

source: Connect to the Watson IoT Platform by calling the connect function. The connect function takes an optional boolean parameter autoRetry (by default autoRetry is true) that controls allows the library to retry the connection when there is an MqttException. Note that the library won't retry when there is a MqttSecurityException due to incorrect device registration details passed even if the autoRetry is set to true.
fr: Connectez-vous à Watson IoT Platform en appelant la fonction de connexion. Celle-ci admet le paramètre booléen facultatif autoRetry (dont la valeur est true par défaut), qui autorise la bibliothèque à retenter la connexion en cas d'exception de type MqttException. La bibliothèque ne retente pas de se connecter en cas d'exception de type MqttSecurityException due à la transmission de détails d'enregistrement de terminal incorrects, même si le paramètre autoRetry est associé à la valeur true.

source: After the successful connection to the IoTF service, the device client can perform the following operations, like publishing events and subscribe to device commands from application.
fr: Une fois la connexion au service IoTF établie, le client du terminal peut effectuer des opérations telles que la publication d'événements et l'abonnement à des commandes de terminal depuis l'application.

source: Publishing events
fr: Publication d'événements
ko: 이벤트 공개

source: Events are the mechanism by which devices publish data to the IoT Platform. The device controls the content of the event and assigns a name for each event it sends.
fr: Les événements constituent le mécanisme par lequel les terminaux publient des données dans IoT Platform. Le terminal contrôle le contenu de l'événement et affecte un nom à chaque événement qu'il envoie.
ko: 이벤트는 디바이스가 데이터를 IoT Platform에 공개할 때 사용하는 메커니즘입니다. 디바이스는 이벤트의 컨텐츠를 제어하고 전송하는 각 이벤트에 대해 이름을 지정합니다.

source: When an event is received by the IBM IoT Platform the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
fr: Lorsqu'un événement est reçu par IBM IoT Platform, les données d'identification de la connexion sur laquelle l'événement a été reçu sont utilisées pour identifier le terminal à partir duquel l'événement a été envoyé. Avec cette architecture, un terminal ne peut en aucun cas simuler les droits d'accès d'un autre terminal.
ko: IBM IoT Platform에서 이벤트를 수신하면 이벤트가 수신된 연결의 신임 정보를 사용하여 이벤트를 전송한 디바이스를 판별합니다. 이 아키텍처를 사용하면 한 디바이스가 다른 디바이스를 위장할 수 없습니다.

source: Events can be published at any of the three `quality of service levels <../messaging/mqtt.html#/>` defined by the MQTT protocol. By default events will be published as qos level 0.
fr: Les événements peuvent être publiés avec l'un des trois `niveaux de qualité de service <../messaging/mqtt.html#/>` défini par le protocole MQTT. Par défaut, les événements sont publiés au niveau de qualité de service 0.
ko: 이벤트는 MQTT 프로토콜에서 정의한 세 가지 `서비스 품질(QoS) 레벨(<../messaging/mqtt.html#/>)`로 공개될 수 있습니다. 기본적으로 이벤트는 qos 레벨 0으로 공개됩니다.

source: Publish event using default quality of service
fr: Publication d'un événement à l'aide de la qualité de service par défaut
ko: 기본 서비스 품질(QoS)을 사용하여 이벤트 공개

source: Publish event using user-defined quality of service
fr: Publication d'un événement à l'aide d'une qualité de service définie par l'utilisateur
ko: 사용자 정의 서비스 품질(QoS)을 사용하여 이벤트 공개

source: Events can be published at higher MQTT quality of servive levels, but these events may take slower than QoS level 0, because of the extra confirmation of receipt. Also Quickstart flow allows only Qos of 0
fr: Les événements peuvent être publiés à des niveaux de qualité de service MQTT plus élevés mais la publication de ces événements risque de prendre plus temps qu'avec la qualité de service 0 en raison du délai nécessaire pour obtenir la confirmation de la réception. Le flux Quickstart autorise uniquement la qualité de service 0.
ko: 이벤트는 더 높은 MQTT 서비스 품질(QoS) 레벨로 공개될 수 있지만 추가적인 수신 확인으로 인해 이 이벤트는 QoS 레벨 0보다 느릴 수 있습니다. 또한 Quickstart 플로우는 QoS 0만 허용합니다.

source: Publish event using HTTP(s)
fr: Publication d'un événement à l'aide du protocole HTTP(s)
ko: HTTP(s)를 통한 이벤트 공개

source: Apart from MQTT, the devices can publish events to the IoT Platform using HTTP(s) by following 3 simple steps,
fr: Les terminaux peuvent publier des événements dans IoT Platform via HTTP(s), en plus de MQTT, en suivant trois étapes simples :
ko: MQTT 외에는 디바이스가 다음 3개의 간단한 단계에 따라 HTTP(s)를 통해 IoT Platform에 이벤트를 공개할 수 있습니다.

source: Construct a DeviceClient instance using the properties file
fr: Construire une instance DeviceClient à l'aide du fichier de propriétés
ko: 특성 파일을 통한 DeviceClient 인스턴스 생성

source: Construct an event that needs to be published
fr: Construire un événement qui doit être publié
ko: 공개되어야 하는 이벤트 생성

source: Specify the event name and publish the event using publishEventOverHTTP() method as follows,
fr: Indiquer le nom de l'événement et publier l'événement à l'aide de la méthode publishEventOverHTTP() de la manière suivante :
ko: 이벤트 이름을 지정하고 다음과 같이 publishEventOverHTTP() 메소드를 통해 이벤트를 공개하십시오.

source: The complete code can be found in the device example `HttpDeviceEventPublish <https://github.com/ibm-messaging/iot-device-samples/blob/master/java/device-samples/src/main/java/com/ibm/iotf/sample/client/device/HttpDeviceEventPublish.java>`__
fr: Le code complet est disponible dans l'exemple de terminal `HttpDeviceEventPublish <https://github.com/ibm-messaging/iot-device-samples/blob/master/java/device-samples/src/main/java/com/ibm/iotf/sample/client/device/HttpDeviceEventPublish.java>`__

source: Based on the settings in the properties file, the publishEventOverHTTP() method either publishes the event in Quickstart or in Registered flow. When the Organization ID mentioned in the properties file is quickstart, publishEventOverHTTP() method publishes the event to the IoT Platform quickstart service and publishes the event in plain HTTP format. But when valid registered organization is mentioned in the properties file, this method always publishes the event in HTTPS (HTTP over SSL), so all the communication is secured.
fr: En fonction des paramètres du fichier de propriétés, la méthode publishEventOverHTTP() publie l'événement dans le flux Quickstart ou le flux des organisations enregistrées. Lorsque l'ID organisation indiqué dans le fichier de propriétés est quickstart, la méthode publishEventOverHTTP() publie l'événement dans le service Quickstart d'IoT Platform au format HTTP standard. En revanche, lorsqu'une organisation enregistrée valide est indiquée dans le fichier de propriétés, cette méthode publie toujours l'événement dans HTTPS (HTTP sur SSL) afin que toutes les communications soient sécurisées.
ko: 특성 파일의 설정에 기반하여 publishEventOverHTTP() 메소드가 Quickstart 또는 등록된 플로우에서 이벤트를 공개합니다. 특성 파일에 언급된 조직 ID가 quickstart이면 publishEventOverHTTP() 메소드가 IoT Platform quickstart 서비스에 이벤트를 공개하고 일반 HTTP 형식으로 이벤트를 공개합니다. 그러나 유효한 등록된 조직이 특성 파일에 언급된 경우 이 메소드는 항상 HTTPS(HTTP over SSL)로 이벤트를 공개하여 모든 통신이 안전합니다.

source: The event in HTTP(s) is published at most once QoS, so the device needs to implement the retry logic when there is an error.
fr: Dans HTTP(s), l'événement est publié au niveau de qualité de service 'une fois tout au plus', ce qui signifie que le terminal doit mettre en place une logique de relance en cas d'erreur.
ko: HTTP(s)의 이벤트는 최대 한 번 서비스 품질(QoS)이 공개되므로 오류 발생 시 디바이스가 재시도 논리를 구현해야 합니다.

source: Handling commands
fr: Traitement des commandes
ko: 명령 처리

source: When the device client connects it automatically subscribes to any commands for this device. To process specific commands you need to register a command callback method. The messages are returned as an instance of the Command class which has the following properties:
fr: Lorsque le client du terminal se connecte, il s'abonne automatiquement aux commandes de ce terminal. Pour traiter des commandes, vous devez enregistrer une méthode de rappel de commande. Les messages sont renvoyés sous la forme d'une instance de la classe Command dotée des propriétés suivantes :
ko: 디바이스 클라이언트가 연결되면 이 디바이스에 대한 명령을 자동으로 구독합니다. 특정 명령을 처리하려면 명령 콜백 메소드를 등록해야 합니다. 메시지는 다음과 같은 특성을 가진 명령 클래스의 인스턴스로 리턴됩니다.

source: Samples
fr: Exemples

source: Refer to the `github repository <https://github.com/ibm-messaging/iot-device-samples/tree/master/java>`__ for a list of device and device management samples developed using this Watson IoT Java client library.
fr: Voir le `référentiel github <https://github.com/ibm-messaging/iot-device-samples/tree/master/java>`__ pour la liste des exemples de terminal et des exemples de gestion des terminaux développés avec cette bibliothèque client Java Watson IoT.

source: The complete code can be found in the device example `HttpDeviceEventPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/device/HttpDeviceEventPublish.java>`__
ko: 전체 코드는 디바이스 예제 `HttpDeviceEventPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/device/HttpDeviceEventPublish.java>`__에서 찾을 수 있습니다.

source: payload - java.lang.String
ko: 페이로드 - java.lang.String

source: format - java.lang.String
ko: 형식 - java.lang.String

source: command - java.lang.String
ko: 명령 - java.lang.String

source: timestamp - org.joda.time.DateTime
ko: 시간소인 - org.joda.time.DateTime
