Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/mbedcpp.po
Languages: es, fr

source: mBed C++ for Device Developers
es: mBed C++ para desarrolladores de dispositivos
fr: mBed C++ pour les développeurs de terminaux

source: See `ibmiotf <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ on `developer.mbed.org <https://developer.mbed.org/>`_
es: Consulte `ibmiotf <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ en `developer.mbed.org <https://developer.mbed.org/>`_
fr: Voir `ibmiotf <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ dans `developer.mbed.org <https://developer.mbed.org/>`_

source: The `mBed C++ client library <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ can be used to connect `mBed devices <https://www.mbed.com/en/>`__ like `LPC1768 <https://developer.mbed.org/platforms/mbed-LPC1768/>`__, `FRDM-K64F <https://developer.mbed.org/platforms/FRDM-K64F/>`__ and etc.. to the IoT Platform Cloud service with ease. Although the library uses C++, it still avoids dynamic memory allocations and use of STL functions as the mBed devices sometimes have idiosyncratic memory models which make porting difficult. In any case, the library allows one to make memory use as predictable as possible.
es: La `Biblioteca de cliente mBed C++ <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ puede utilizarse para conectar `dispositivos mBed <https://www.mbed.com/en/>`__, como `LPC1768 <https://developer.mbed.org/platforms/mbed-LPC1768/>`__, `FRDM-K64F <https://developer.mbed.org/platforms/FRDM-K64F/>`__, etc., al servicio en la nube de IoT Platform con facilidad. Aunque la biblioteca utiliza C++, continúa evitando las asignaciones de memoria dinámica y el uso de funciones STL, ya que los dispositivos mBed a veces tienen modelos de memoria idiosincrásica que dificultan el establecimiento de puertos. En cualquier caso, la biblioteca permite uno para que el uso de memoria sea lo más predecible posible.
fr: La `bibliothèque client mBed C++ <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ peut être utilisée pour connecter facilement des `terminaux mBed <https://www.mbed.com/en/>`__ comme `LPC1768 <https://developer.mbed.org/platforms/mbed-LPC1768/>`__, `FRDM-K64F <https://developer.mbed.org/platforms/FRDM-K64F/>`__ et autres au service cloud d'IoT Platform. Bien que la bibliothèque utilise C++, elle évite les allocations de mémoire dynamiques et l'utilisation de fonctions STL car les terminaux mBed incluent parfois des modèles de mémoire idiosyncratiques qui rendent le portage difficile. Dans tous les cas, la bibliothèque permet de rendre l'utilisation de la mémoire aussi prévisible que possible.

source: Dependencies
es: Dependencias
fr: Dépendances

source: `Eclipse Paho MQTT library <https://developer.mbed.org/teams/mqtt/code/MQTT/>`__ - Provides a MQTT client library for mBed devices, check `here <http://www.eclipse.org/paho/clients/c/embedded/>`__ for more information.
es: `Biblioteca MQTT de Eclipse Paho <https://developer.mbed.org/teams/mqtt/code/MQTT/>`__ - Proporciona una biblioteca de cliente MQTT para los dispositivos mBed; pulse `aquí <http://www.eclipse.org/paho/clients/c/embedded/>`__ para obtener más información.
fr: `Bibliothèque MQTT Eclipse Paho <https://developer.mbed.org/teams/mqtt/code/MQTT/>`__ - Fournit une bibliothèque client MQTT pour les terminaux mBed. Pour plus d'informations, reportez-vous à `cette rubrique <http://www.eclipse.org/paho/clients/c/embedded/>`__.

source: `EthernetInterface library <https://developer.mbed.org/users/mbed_official/code/EthernetInterface/>`__ - A mBed IP library over Ethernet.
es: `Biblioteca EthernetInterface <https://developer.mbed.org/users/mbed_official/code/EthernetInterface/>`__ - Una biblioteca mBed IP a través de Ethernet.
fr: `Bibliothèque EthernetInterface <https://developer.mbed.org/users/mbed_official/code/EthernetInterface/>`__ - Bibliothèque IP mBed sur Ethernet.

source: How to use the library
es: Cómo utilizar la biblioteca
fr: Comment utiliser la bibliothèque

source: Use the `mBed Compiler <https://developer.mbed.org/compiler/>`__ to create your applications using this mBed C++ IBMIoTF Client Library. The mBed Compiler provides a lightweight online C/C++ IDE that is pre-configured to let you quickly write programs, compile and download them to run on your mbed Microcontroller. In fact, you don't have to install or set up anything to get running with mbed.
es: Utilice el `Compilador mBed <https://developer.mbed.org/compiler/>`__ para crear sus aplicaciones utilizando esta biblioteca de cliente mBed C++ IBMIoTF. El Compilador mBed proporciona un IDE C/C++ ligero en línea que está preconfigurado para que pueda escribir programas rápidamente, compilarlos y descargarlos para que se ejecuten en el Microcontrolador mbed. De hecho, no es necesario instalar o configurar nada para que funcione la ejecución con mbed.
fr: Utilisez le `compilateur mBed <https://developer.mbed.org/compiler/>`__ pour créer les applications à l'aide de cette bibliothèque client mBed C++ IBMIoT. Le compilateur mBed fournit un environnement de développement intégré C/C++ en ligne, qui est préconfiguré pour vous permettre d'écrire, de compiler et de télécharger rapidement des programmes à exécuter sur le microcontrôleur mbed. Vous n'avez rien à installer ni à configurer pour commencer à utiliser mbed.

source: Refer to the step by step `mBed C++ Client Library for IBM IoT Platform Recipe <https://developer.ibm.com/recipes/tutorials/mbed-c-client-library-for-ibm-iot-foundation/>`__ that shows how one can use this library to connect an ARM mBed NXP LPC 1768 microcontroller to the IoT Platform.
es: Consulte la `Receta de biblioteca de cliente mBed C++ para IBM IoT Platform <https://developer.ibm.com/recipes/tutorials/mbed-c-client-library-for-ibm-iot-foundation/>`__ paso a paso que muestra cómo se puede utilizar esta biblioteca para conectar un microcontrolador ARM mBed NXP LPC 1768 a IoT Platform.
fr: Reportez-vous à la `recette étape par étape de la bibliothèque client mBed C++ pour IBM IoT Platform <https://developer.ibm.com/recipes/tutorials/mbed-c-client-library-for-ibm-iot-foundation/>`__ qui explique comment utiliser cette bibliothèque pour connecter un microcontrôleur ARM mBed NXP LPC 1768 à IoT Platform.

source: Constructor
fr: Constructeur

source: The constructor builds the client instance, and accepts the following parameters:
es: El constructor crea la instancia de cliente y acepta los siguientes parámetros:
fr: Le constructeur génère l'instance client et accepte les paramètres suivants :

source: org - Your organization ID. (This is a required field. In case of quickstart flow, provide org as quickstart.)
es: org - ID de organización. (Es un campo necesario. En el caso de flujo de inicio rápido, proporcione org como inicio rápido.)
fr: org - ID de votre organisation. (Cette zone est obligatoire. Dans le cas d'un flux Quickstart, indiquez quickstart comme organisation.)

source: type - The type of your device. (This is a required field.)
es: type - Tipo del dispositivo. (Es un campo necesario.)
fr: Type - Type de terminal. (Cette zone est obligatoire.)

source: id - The ID of your device. (This is a required field.
es: id - ID del dispositivo. (Es un campo necesario.
fr: id - ID de votre terminal. (Cette zone est obligatoire.)

source: auth-method - Method of authentication (This is an optional field, needed only for registered flow and the only value currently supported is "token").
es: auth-method - Método de autenticación (Este campo es opcional, solo necesario para el flujo registrado y el único valor soportado actualmente es "token").
fr: auth-method - Méthode d'authentification. (Cette zone est facultative. Elle est nécessaire uniquement pour le flux enregistré. La seule valeur actuellement prise en charge est "token".)

source: auth-token - API key token (This is an optional field, needed only for registered flow).
es: auth-token - Señal de clave de API (Este campo es opcional, solo necesario para el flujo registrado).
fr: auth-token - Jeton de clé d'API. (Cette zone est facultative. Elle est nécessaire uniquement pour le flux enregistré.)

source: These arguments create definitions which are used to interact with the IoT Platform service.
es: Estos argumentos crean definiciones que se utilizan para interactuar con el servicio de IoT Platform.
fr: Ces arguments créent des définitions qui permettent d'interagir avec le service IoT Platform.

source: The following code block shows how to create a DeviceClient instance to interact with the IoT Platform quickstart service.
es: El siguiente bloque de código muestra cómo crear una instancia de DeviceClient para interactuar con el servicio Quickstart de IoT Platform.
fr: Le bloc de code ci-dessous indique comment créer une instance DeviceClient pour interagir avec le service QuickStart d'IoT Platform.

source: As shown above, if the device id is not specified, the DeviceClient uses the MAC address of the device as device id and connects to the IoT Platform. The device code can use getDeviceId() method to retrieve the device id from the DeviceClient instance.
es: Como se muestra anteriormente, si no se especifica el ID del dispositivo, DeviceClient utiliza la dirección MAC del dispositivo como ID del dispositivo y se conecta a IoT Platform. El código de dispositivo puede utilizar el método getDeviceId() para recuperar el ID de dispositivo de la instancia de DeviceClient.
fr: Comme expliqué ci-dessus, si l'ID terminal n'est pas indiqué, l'instance DeviceClient utilise l'adresse MAC du terminal comme ID terminal et se connecte à IoT Platform. Le code du terminal peut utiliser la méthode getDeviceId() pour extraire l'ID terminal de l'instance DeviceClient.

source: The following code block shows how to create a DeviceClient instance to interact with the IoT Platform Registered organization.
es: El siguiente bloque de código muestra cómo crear una instancia de DeviceClient para interactuar con la organización registrada de IoT Platform.
fr: Le bloc de code ci-dessous indique comment créer une instance DeviceClient pour interagir avec l'organisation enregistrée IoT Platform.

source: Connecting to the IoT Platform
es: Conexión a IoT Platform
fr: Connexion à IoT Platform

source: The device can connect to the IoT Platform by calling the connect function on the DeviceClient instance.
es: El dispositivo puede conectarse a IoT Platform mediante una llamada a la función connect en la instancia de DeviceClient.
fr: Le terminal peut se connecter à IoT Platform en appelant la fonction de connexion sur l'instance DeviceClient.

source: After the successful connection, the device can publish events to the IoT Platform and listen for commands.
es: Si la conexión se realiza correctamente, el dispositivo puede publicar sucesos en IoT Platform y escuchar mandatos.
fr: Une fois la connexion établie, le terminal peut publier des événements dans IoT Platform et être à l'écoute des commandes.

source: Also, the device can query the status of the connection using the isConnected() method as follows,
es: Además, el dispositivo puede consultar el estado de la conexión mediante el método isConnected(), de la siguiente forma:
fr: De plus, le terminal peut demander le statut de la connexion avec la méthode isConnected() comme suit.

source: Publishing events
es: Publicación de sucesos
fr: Publication d'événements

source: Events are the mechanism by which devices publish data to the IoT Platform. The device controls the content of the event and assigns a name for each event it sends.
es: Los sucesos son el mecanismo mediante el cual los dispositivos publican datos en IoT Platform. El dispositivo controla el contenido del suceso y asigna un nombre a cada suceso que envía.
fr: Les événements constituent le mécanisme par lequel les terminaux publient des données dans IoT Platform. Le terminal contrôle le contenu de l'événement et affecte un nom à chaque événement qu'il envoie.

source: When an event is received by the IBM IoT Platform the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
es: Cuando IBM IoT Platform recibe un suceso, se utilizan las credenciales de la conexión en la que se ha recibido dicho suceso para determinar desde qué dispositivo se ha enviado el suceso. Con esta arquitectura, es imposible que un dispositivo pueda suplantar a otro.
fr: Lorsqu'un événement est reçu par IBM IoT Platform, les données d'identification de la connexion sur laquelle l'événement a été reçu sont utilisées pour identifier le terminal à partir duquel l'événement a été envoyé. Avec cette architecture, il est impossible pour un terminal de simuler les droits d'accès d'un autre terminal.

source: Events can be published at any of the three `quality of service levels <../messaging/mqtt.html#/>`__ defined by the MQTT protocol. By default events will be published as qos level 0.
es: Los sucesos se pueden publicar en cualquiera de los sucesos de los 'niveles de calidad de servicio <../messaging/mqtt.html#/>`__ definidos por el protocolo MQTT. De forma predeterminada los sucesos se publicarán como qos nivel 0.
fr: Les événements peuvent être publiés à l'aide de l'un des trois `niveaux de qualité de service <../messaging/mqtt.html#/>`__ définis par le protocole MQTT. Par défaut, les événements sont publiés au niveau de qualité de service 0.

source: Publish event using default quality of service
es: Publicar suceso utilizando calidad de servicio predeterminada
fr: Publication d'un événement à l'aide de la qualité de service par défaut

source: The below sample shows how to publish various data points of LPC1768 like x,y & z axis, joystick position, current temperature reading and etc.. to IoT Platform in JSON format.
es: El siguiente ejemplo muestra cómo publicar varios puntos de datos de LPC1768, como los ejes x-y-z, la posición del joystick, la lectura de la temperatura actual, etc., en IoT Platform con formato JSON.
fr: L'exemple ci-dessous explique comment publier différents points de données de LPC1768, comme l'axe x,y et z, la position de la manette ou le relevé de températures en cours, au format JSON dans IoT Platform.

source: The complete sample can be found `here <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/file/e58533b6bc6b/src/Main.cpp>`__.
es: Puede encontrar el ejemplo completo `aquí <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/file/e58533b6bc6b/src/Main.cpp>`__.
fr: L'exemple complet est disponible `ici <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/file/e58533b6bc6b/src/Main.cpp>`__.

source: Publish event using user-defined quality of service
es: Publicar suceso utilizando calidad de servicio definida por el usuario
fr: Publication d'un événement à l'aide d'une qualité de service définie par l'utilisateur

source: Events can be published at higher MQTT quality of service levels, but these events may take slower than QoS level 0, because of the extra confirmation of receipt. Also quickstart flow allows only Qos of 0.
es: Los sucesos se pueden publicar a niveles de calidad de servicio MQTT más altos, pero es posible que estos sucesos vayan más lentos que el nivel de QoS 0, debido a la confirmación adicional de recepción. Asimismo, el flujo de inicio rápido solo permite una Qos de 0.
fr: Les événements peuvent être publiés à des niveaux de qualité de service MQTT plus élevés mais la publication de ces événements risque de prendre plus temps qu'avec la qualité de service 0 en raison du délai nécessaire pour obtenir la confirmation de la réception. Le flux Quickstart permet d'utiliser uniquement la qualité de service 0.

source: Handling the connection lost error during the event publish
es: Gestión del error de pérdida de la conexión durante la publicación de un suceso
fr: Traitement de l'erreur signalant la perte de la connexion au cours de la publication d'événement

source: When the publishEvent() method returns false, one can check the status of the connection and call reConnect() if the connection is lost,
es: Si el método publishEvent() devuelve la respuesta false, es posible comprobar el estado de la conexión y llamar a reConnect() si dicha conexión se ha perdido:
fr: Lorsque la méthode publishEvent() renvoie la valeur false, vous pouvez vérifier le statut de la connexion et appeler reConnect() si la connexion a été perdue.

source: The library does not store the events published during the unconnected state, and hence, the device needs to call the publishEvent() method again to send those events once the connection is reestablished.
es: La biblioteca no almacena los sucesos publicados durante el estado no conectado y, por tanto, el dispositivo tiene que volver a llamar al método publishEvent() para enviar dichos sucesos una vez que se reestablece la conexión.
fr: La bibliothèque ne stocke pas les événements publiés alors que l'état est non connecté. Par conséquent, le terminal doit appeler à nouveau la méthode publishEvent() afin d'envoyer ces événements une fois la connexion rétablie.

source: Handling commands
es: Manejo de mandatos
fr: Traitement des commandes

source: When the device client connects, it automatically subscribes to any commands for this device. To process specific commands you need to register a command callback method. The messages are returned as an instance of the Command class which has the following properties:
es: Cuando el cliente de dispositivo se conecta, se suscribe automáticamente a todos los mandatos para este dispositivo. Para procesar mandatos específicos, necesita registrar un método de devolución de llamada de mandato. Los mensajes se devuelven como una instancia de la clase de mandato que tiene las propiedades siguientes:
fr: Lorsque le client du terminal se connecte, il s'abonne automatiquement aux commandes de ce terminal. Pour traiter des commandes, vous devez enregistrer une méthode de rappel de commande. Les messages sont renvoyés sous la forme d'une instance de la classe Command dotée des propriétés suivantes :

source: command - name of the command invoked
es: command - nombre del mandato invocado
fr: command - Nom de la commande appelée

source: format - e.g json, xml
es: format - por ejemplo json, xml
fr: format - Par exemple json, xml

source: Following code defines a sample command callback function that processes the LED blink interval command from the application and adds the same to the DeviceClient instance.
es: El código siguiente define una función de devolución de llamada de mandatos de ejemplo que procesa el mandato de intervalo de parpadeo de LED de la aplicación y añade el mismo valor a la instancia de DeviceClient.
fr: Le code suivant définit un exemple de fonction de rappel de commande qui traite la commande de gestion de l'intervalle de clignotement d'un voyant provenant de l'application et ajoute les mêmes données à l'instance DeviceClient.

source: The 'client.yield()' function must be called periodically to receive commands.
es: Es necesario llamar de forma periódica a la función 'client.yield()' para recibir mandatos.
fr: La fonction 'client.yield()' doit être appelée régulièrement pour recevoir des commandes.

source: Disconnect Client
es: Desconectar cliente
fr: Déconnexion du client

source: To disconnect the client and release the connections, run the following code snippet.
es: Para desconectar el cliente y liberar las conexiones, ejecute el siguiente fragmento de código.
fr: Pour déconnecter le client et libérer les connexions, exécutez le fragment de code ci-dessous.

source: Samples
es: Ejemplos
fr: Exemples

source: `IBMIoTClientLibrarySample <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/>`__ - A Sample code that showcases how to use IBMIoTF client library to connect the mbed LPC1768 or FRDM-K64F devices to the IBM Internet of Things Cloud service.
es: `IBMIoTClientLibrarySample <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/>`__ - Un código de ejemplo que muestra cómo utilizar la biblioteca de cliente IBMIoTF para conectar los dispositivos mbed LPC1768 o FRDM-K64F al servicio en la nube de IBM Internet of Things.
fr: `IBMIoTClientLibrarySample <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/>`__ - Exemple de code expliquant comment utiliser la bibliothèque client IBMIoTF pour connecter les terminaux mbed LPC1768 ou FRDM-K64F au service IBM Internet of Things Cloud.
