Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/nodejs.po
Languages: es, fr

source: Node.js for Device Developers
es: Node.js para desarrolladores de dispositivos
fr: Node.js pour les développeurs de terminaux

source: See `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_ in GitHub
es: Consulte `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_ en GitHub
fr: Voir `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_ dans GitHub

source: See the `samples for device <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_ in Github
es: Consulte los `ejemplos de dispositivos <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_ en Github.
fr: Voir les `exemples pour le terminal <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_ dans Github

source: See `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_ on NPM
es: Consulte `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_ en NPM
fr: Voir `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_ dans NPM

source: Constructor
fr: Constructeur

source: The constructor builds the device client instance. It accepts a configuration json containing the following definitions:
es: El constructor crea la instancia del cliente de dispositivo. Acepta un json de configuración que contenga las siguientes definiciones:
fr: Le constructeur crée l'instance du client de terminal. Il accepte un objet de configuration JSON contenant les définitions suivantes :

source: ``org`` - Your organization ID
es: ``org`` - El ID de la organización.
fr: ``org`` - ID de votre organisation

source: ``type`` - The type of your device
es: ``type`` - El tipo del dispositivo.
fr: ``type`` - Type de votre terminal

source: ``id`` - The ID of your device
es: ``id`` - El ID del dispositivo.
fr: ``id`` - ID de votre terminal

source: ``auth-method`` - Method of authentication (the only value currently supported is ``token``)
es: ``auth-method`` - El método de autenticación (el único valor soportado actualmente es ``token``).
fr: ``auth-method`` - Méthode d'authentification (la seule valeur actuellement admise est ``token``)

source: ``auth-token`` - API key token (required if auth-method is ``token``)
es: ``auth-token`` - La señal de la clave de API (necesaria si auth-method es ``token``).
fr: ``auth-token`` - Jeton de clé d'API (requis si auth-method est ``token``)

source: If you want to use Quickstart, then send only the first three properties.
es: Si desea utilizar Quickstart, envíe solo las tres primeras propiedades.
fr: Si vous souhaitez utiliser Quickstart, envoyez uniquement les trois premières propriétés.

source: Using a configuration file
es: Utilización de un archivo de configuración
fr: Utilisation d'un fichier de configuration

source: Instead of passing the configuration json directly, you can also use a configuration json file. Use the following code snippet:
es: En lugar de pasar el json de configuración directamente, también puede utilizar un archivo json de configuración. Utilice el fragmento de código siguiente:
fr: Au lieu de transmettre directement l'objet de configuration JSON, vous pouvez utiliser un fichier de configuration JSON. Utilisez le fragment de code suivant :

source: The configuration file `device.json` must be in the format of
es: El archivo de configuración `device.json` debe tener el formato siguiente:
fr: Le format du fichier de configuration `device.json` doit être le suivant :

source: Connecting to the IoT Platform
es: Conexión a IoT Platform
fr: Connexion à IoT Platform

source: Connect to the IoT Platform by calling the *connect* function.
es: Conéctese a IoT Platform llamando a la función *connect*.
fr: Connectez-vous à IoT Platform en appelant la fonction *connect*.

source: After the successful connection to the IoT Platform service, the device client sends a *connect* event. So all the device logic can be implemented inside this callback function.
es: Tras una conexión correcta al servicio de IoT Platform, el cliente del dispositivo envía un suceso *connect*. De esta forma, toda la lógica de dispositivo puede implementarse dentro de esta función de devolución de llamada.
fr: Une fois la connexion au service IoT Platform établie, le client de terminal envoie un événement *connect*. L'ensemble de la logique peut donc être implémentée au sein de la fonction de rappel.

source: The Device Client automatically tries to reconnect when it loses connection. When the reconnection is successful, the client emits *reconnect* event.
es: El cliente del dispositivo intenta volver a conectar de forma automática cuando pierde la conexión. Cuando la reconexión se realiza correctamente, el cliente emite el suceso *reconnect*.
fr: Le client de terminal tente de se reconnecter automatiquement lorsqu'il perd la connexion. Une fois que la reconnexion a abouti, le client émet un événement *reconnect*.

source: Logging
es: Registro
fr: Journalisation

source: By default, all the logs of ``warn`` are logged. If you want to enable more logs, use the *log.setLevel* function. Supported log levels - *trace, debug, info, warn, error*.
es: De forma predeterminada, se registran todos los registros de ``warn``. Si desea habilitar más registros, utilice la función *log.setLevel*. Los niveles de registro soportados son *trace, debug, info, warn, error*.
fr: Par défaut, tous les journaux de niveau ``warn`` (avertissement) sont consignés. Pour activer d'autres journaux, utilisez la fonction *log.setLevel*. Niveaux de journalisation pris en charge : *trace, debug, info, warn, error*.

source: Publishing events
es: Publicación de sucesos
fr: Publication d'événements

source: Events are the mechanism by which devices publish data to the IoT Platform. The device controls the content of the event and assigns a name for each event it sends.
es: Los sucesos son el mecanismo mediante el cual los dispositivos publican datos en IoT Platform. El dispositivo controla el contenido del suceso y asigna un nombre a cada suceso que envía.
fr: Les événements constituent le mécanisme par lequel les terminaux publient des données dans IoT Platform. Le terminal contrôle le contenu de l'événement et affecte un nom à chaque événement qu'il envoie.

source: When an event is received by the IoT Platform the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
es: Cuando IoT Platform recibe un suceso, se utilizan las credenciales de la conexión en la que se ha recibido dicho suceso para determinar desde qué dispositivo se ha enviado el suceso. Con esta arquitectura, es imposible que un dispositivo pueda suplantar a otro.
fr: Lorsqu'un événement est reçu par IoT Platform, les données d'identification de la connexion sur laquelle l'événement a été reçu sont utilisées pour identifier le terminal à partir duquel l'événement a été envoyé. Avec cette architecture, il est impossible pour un terminal de simuler les droits d'accès d'un autre terminal.

source: Events can be published at any of the three quality of service levels defined by the MQTT protocol. By default events will be published as QoS level 0. Please not that if you are using the Internet of Things Quickstart service, events can only be published at QoS level 0.
es: Los sucesos se pueden publicar en cualquiera de los tres niveles de calidad de servicio definidos por el protocolo MQTT. De forma predeterminada, los sucesos se publicarán con el nivel de QoS 0. Tenga en cuenta que si va a utilizar el servicio Quickstart de Internet of Things, solo se podrán publicar sucesos con un nivel QoS de 0.
fr: Les événements peuvent être publiés avec l'un des trois niveaux de qualité de service définis par le protocole MQTT. Par défaut, les événements sont publiés avec le niveau de qualité de service 0. Si vous utilisez le service Quickstart de l'Internet des objets, les événements ne peuvent être publiés qu'avec le niveau de qualité de service 0.

source: Events can be published by using:
es: Se pueden publicar sucesos utilizando:
fr: Vous pouvez publier des événements en utilisant :

source: eventType - Type of event to be published e.g status, gps.
es: eventType: Tipo de suceso que publicar; por ejemplo, status, gps.
fr: eventType - type d'événement à publier, par exemple status, gps.

source: eventFormat - Format of the event e.g json.
es: eventFormat: El formato del suceso; por ejemplo, json.
fr: eventFormat - format de l'événement, par exemple json.

source: data - Payload of the event.(Must be buffer/String)
es: data: La carga útil del suceso. (Debe ser buffer/String).
fr: data - contenu de l'événement (doit être un tampon/une chaîne)

source: QoS - MQTT quality of service for the publish event. Supported values : 0,1,2.
es: QoS: La calidad de servicio de MQTT del suceso que se publica. Los valores admitidos: 0,1,2.
fr: QoS - qualité de service MQTT de l'événement de publication. Valeurs admises : 0,1,2.

source: Handling commands
es: Manejo de mandatos
fr: Traitement des commandes

source: When the device client connects, it automatically subscribes to any command for this device. To process specific commands you need to register a command callback function. The device client sends *command* when a command is received. The callback function has the following properties.
es: Cuando el cliente de dispositivo se conecta, se suscribe automáticamente a cualquier mandato para este dispositivo. Para procesar mandatos específicos, necesita registrar una función de devolución de llamada de mandato. El cliente de dispositivo envía *command* cuando se recibe un mandato. La función de devolución de llamada tiene las siguientes propiedades.
fr: Lorsque le client du terminal se connecte, il s'abonne automatiquement aux commandes de ce terminal. Pour traiter des commandes spécifiques, vous devez enregistrer une méthode de rappel de commande. Le client de terminal envoie *command* lors de la réception d'une commande. La fonction de rappel possède les propriétés suivantes :

source: commandName - name of the command invoked
es: commandName - nombre del mandato invocado
fr: commandName - Nom de la commande appelée

source: format - e.g json, xml
es: format - por ejemplo json, xml
fr: format - Par exemple json, xml

source: payload - payload for the command
es: payload - carga útil del mandato
fr: payload - Contenu de la commande

source: topic - actual topic where the command was received
es: topic - tema donde se recibe el mandato
fr: topic - Sujet réel qui a reçu la commande

source: Handling errors
es: Manejo de errores
fr: Traitement des erreurs

source: When the device clients encounters an error, it emits an *error* event.
es: Cuando el cliente de dispositivo encuentra un error, emite un suceso *error*.
fr: Lorsque les clients de terminal rencontrent une erreur, ils émettent un événement *error*.

source: Disconnect Client
es: Desconectar cliente
fr: Déconnexion du client

source: Disconnects the client and releases the connections
es: Desconecta el cliente y libera las conexiones
fr: Déconnecte le client et libère les connexions
