Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/device_model.po
Languages: de, es, fr, ko

source: Diagnostic log information is an array of entries which can have entries appended using an API, however, this can cause earlier entries to be lost, to keep the size of diagnostic logs manageable. Each entry consists of a message, an indication of severity, a timestamp and an optional byte-array of data.
de: Diagnoseprotokollinformationen bestehen aus einer Reihe von Einträgen, an die mithilfe einer API Einträge angehängt sein können; dabei können jedoch ältere Einträge verloren gehen, weil die Diagnoseprotokolle eine noch praktikable Größe aufweisen sollen. Jeder Eintrag besteht aus einer Nachricht, einer Angabe zum Schweregrad, einer Zeitmarke und optional Bytefeldgruppendaten.
es: La información de registro de diagnóstico es una matriz de entradas que puede tener entradas anexadas mediante una API; sin embargo, esto puede hacer que se pierdan las entradas anteriores para que el tamaño de los registros de diagnóstico siga siendo manejable. Cada entrada consta de un mensaje, una indicación de la gravedad, una amperio y una matriz de bytes de datos opcional.
fr: Les informations des journaux de diagnostic correspondent à un tableau dont les entrées peuvent être ajoutées à l'aide d'une API. Toutefois, il est possible que les entrées précédentes soient supprimées pour maintenir la taille des journaux de diagnostic à un niveau acceptable. Chaque entrée se compose d'un message, d'un niveau de gravité, d'un horodatage et d'un tableau d'octets facultatif pour les données.
ko: 진단 로그 정보가 API를 통해 항목이 추가되어 있을 수 있는 항목의 배열이지만, 이로 인해 이전의 항목이 유실되고 진단 로그의 크기가 관리 가능하도록 유지할 수 있습니다. 각 항목은 메시지, 심각도의 표시, 시간소인 및 데이터의 선택적 바이트-배열로 구성됩니다.

source: array of integer(s)
de: Feldgruppe aus ganzen Zahlen
es: matriz de entero(s)
fr: tableau d'entier(s)
ko: 정수의 배열

source: Array of error codes
de: Feldgruppe aus Fehlercodes
es: Matriz de códigos de error
fr: Tableau de codes d'erreur
ko: 오류 코드의 배열

source: array
es: matriz
fr: tableau
ko: 배열

source: Array of diagnostic data
de: Feldgruppe aus Diagnosedaten
es: Matriz de datos de diagnóstico
fr: Tableau de données de diagnostic
ko: 진단 데이터의 배열

source: Diagnostic message
de: Diagnosenachricht
es: Mensaje de diagnóstico
fr: Message de diagnostic
ko: 진단 메시지

source: ISO8601 date-time: Date and time of log entry
de: ISO8601 date-time: Datum und Zeit des Protokolleintrags
es: ISO8601 date-time: fecha y hora de la entrada de registro
fr: ISO8601 date-time : Date et heure de l'entrée de journal
ko: ISO8601 date-time: 로그 항목의 날짜 및 시간

source: byte: Diagnostic data, base-64 encoded
de: byte: Diagnosedaten, base-64-codiert
es: byte: Datos de diagnóstico, codificados en base64
fr: byte : Données de diagnostic codées en base 64
ko: 바이트: 진단 데이터, base-64 인코딩됨

source: number
de: Zahl
es: número
fr: nombre
ko: 수

source: Severity of message, 0: informational, 1: warning, 2: error
de: Schweregrad der Nachricht, 0: Informationsnachricht, 1: Warnung, 2: Fehler
es: Gravedad del mensaje 0: informativo, 1: aviso, 2: error
fr: Niveau de gravité du message, à savoir 0 : informations, 1 : avertissement, 2 : erreur
ko: 메시지의 심각도, 0: 정보용, 1: 경고, 2: 오류

source: Location Extension
de: Positionserweiterung
es: Extensión de ubicación
fr: Extension d'emplacement
ko: 위치 확장기능

source: These attributes are optional and only present for devices with location information. The location information is stored separately in order to allow the use of storage mechanisms better suited to dynamic information in the event of frequently updated information, for example, in the case of a mobile device.
de: Diese Attribute sind optional und nur für Einheiten mit Positionsinformationen verfügbar. Die Positionsinformationen werden separat gespeichert, damit Speicherverfahren verwendet werden können, die für dynamische Informationen besser geeignet sind, die häufig aktualisiert werden, zum Beispiel auf einem Mobilgerät.
es: Estos atributos son opcionales y solo están presentes para los dispositivos con información de ubicación. La información de ubicación se almacena de forma independiente para permitir el uso de mecanismos de almacenamiento más adaptados a la información dinámica en el caso de la información que se actualiza con frecuencia, por ejemplo, en el caso de un dispositivo móvil.
fr: Ces attributs sont facultatifs et sont disponibles uniquement pour les terminaux qui incluent des informations d'emplacement. Les informations d'emplacement sont stockées séparément pour permettre une utilisation des dispositifs de stockage mieux adaptée aux informations dynamiques dans le cas d'informations fréquemment mises à jour, par exemple sur un terminal mobile.
ko: 이러한 속성은 선택적이고 위치 정보가 포함된 디바이스에 대해서만 표시됩니다. 위치 정보는 모바일 디바이스의 경우와 같이 자주 업데이트되는 정보의 이벤트에서 동적 정보에 더 잘 맞는 스토리지 메커니즘의 사용을 허용하기 위해 별도로 저장됩니다.

source: For solutions which place significant importance on frequent location updates, it is expected that the location would be treated as part of the device's event payload, enabling higher update rates, simple historical storage, and analytics.
de: Bei Lösungen, für die häufige Positionsaktualisierungen im Vordergrund stehen, wird erwartet, dass die Position als Teil der Ereignisnutzdaten der Einheit behandelt werden, was höhere Aktualisierungsraten sowie ein einfaches Speichern von historischen Daten und Analysedaten ermöglicht.
es: Para las soluciones que otorgan bastante importancia a las actualizaciones frecuentes de la ubicación, se espera que la ubicación se considere como parte de la carga útil de sucesos del dispositivo, lo que posibilita tasas de actualización más rápidas, almacenamiento simple de historiales y análisis.
fr: Dans les solutions où les mises à jour d'emplacement sont particulièrement fréquentes, l'emplacement doit être traité avec le contenu des événements du terminal pour permettre des fréquences de mise à jour plus élevées, des mécanismes de stockage d'historiques simples, ainsi que des données d'analyse.
ko: 위치를 자주 업데이트해야 하는 솔루션의 경우, 위치가 디바이스의 이벤트 페이로드의 파트로 처리되어 더 높은 업데이트 비율, 단순한 히스토리 스토리지 및 분석을 가능하게 할 것으로 예상됩니다.

source: Longitude in decimal degrees using WGS84
de: Längengrad in Dezimalgrad unter Verwendung von WGS84
es: Longitud en grados decimales con WGS84
fr: Longitude en degrés décimaux à l'aide de WGS84
ko: WGS84를 통한 10진수 도의 경도

source: Latitude in decimal degrees using WGS84
de: Breitengrad in Dezimalgrad unter Verwendung von WGS84
es: Latitud en grados decimales con WGS84
fr: Latitude en degrés décimaux à l'aide de WGS84
ko: WGS84를 통한 10진수 도의 위도

source: Elevation in metres using WGS84
de: Erhebung in Meter unter Verwendung von WGS84
es: Elevación en metros con WGS84
fr: Elévation en mètres à l'aide de WGS84
ko: WGS84를 통한 미터로 된 엘리베이션

source: ISO8601 date-time: Date and time of location measurement
de: ISO8601 date-time: Datum und Zeit der Positionsmessung
es: ISO8601 date-time: Fecha y hora de la medición de ubicación
fr: ISO8601 date-time : Date et heure de la mesure d'emplacement
ko: ISO8601 date-time: 위치 측정의 날짜 및 시간

source: ISO8601 date-time: Date and time
de: ISO8601 date-time: Datum und Zeit
es: ISO8601 date-time: Fecha y hora
fr: ISO8601 date-time : Date et heure
ko: ISO8601 date-time: 날짜 및 시간

source: Accuracy of the position in metres
de: Genauigkeit der Position in Meter
es: Exactitud de la posición en metros
fr: Précision de la position en mètres
ko: 미터로 된 위치의 정확도

source: Device Management Extension
de: Einheitenmanagementerweiterung
es: Extensión de gestión de dispositivo
fr: Extension de gestion des terminaux
ko: 디바이스 관리 확장기능

source: The ``mgmt.`` attributes are only present for managed devices. When a managed device becomes dormant, it becomes unmanaged and the ``mgmt.`` attributes are deleted. The ``mgmt.`` attributes are set by the Watson IoT platform as a result of processing device management requests. These attributes cannot be directly written using the API.
es: Los atributos 'mgmt.' solo están presentes en los dispositivos gestionados. Cuando un dispositivo gestionado pasa a estar inactivo, se convierte en no gestionado y los atributos 'mgmt.' se eliminan. Los atributos 'mgmt.`` los establece Watson IoT Platform como resultado del procesamiento de solicitudes de gestión de dispositivos. Estos atributos no se pueden grabar directamente mediante la API.
fr: Les attributs ``mgmt.`` sont disponibles uniquement pour les terminaux gérés. Lorsqu'un terminal géré passe en mode veille, il devient un terminal non géré et les attributs ``mgmt.`` sont supprimés. Les attributs ``mgmt.`` sont définis par Watson IoT Platform à l'issue du traitement des demandes de gestion des terminaux. Ces attributs ne peuvent pas être écrits directement à l'aide de l'API.
ko: ``mgmt.`` 속성은 관리 디바이스에 대해서만 나타납니다. 관리 디바이스가 휴지 상태가 되면 비관리가 되고 ``mgmt.`` 속성이 삭제됩니다. ``mgmt.`` 속성은 디바이스 관리 요청을 처리하는 결과로 Watson IoT Platform에서 설정됩니다. 이러한 속성은 API를 통해 직접 작성할 수 없습니다.

source: Devices have a management lifecycle, defined by their status as managed devices. The device management agent on the device is responsible for sending a Manage Device request using the device management protocol. To deal with defunct devices in large device populations, a managed device can be set to send a Manage Device request regularly, allowing the Watson IoT platform to notice when a device has become dormant. To facilitate this functionality, the Manage Device request has an optional lifetime parameter, When the Watson IoT platform receives a Manage Device request with a lifetime, it calculates the time before which another Manage Device request is required and stores it in the "mgmt.dormantDateTime" attribute.
es: Los dispositivos tienen un ciclo de vida de gestión, definido por su estado como dispositivos gestionados. El agente de gestión de dispositivos en el dispositivo se encarga de enviar una solicitud de gestión de dispositivo utilizando el protocolo de gestión de dispositivos. Para gestionar dispositivos inactivos en poblaciones grandes de dispositivos, se puede configurar un dispositivo gestionado para que envíe de forma periódica una solicitud de gestión de dispositivos, lo que permite a Watson IoT Platform advertir cuándo un dispositivo ha pasado a estar inactivo. Para facilitar esta funcionalidad, la solicitud de gestión de dispositivos tiene un parámetro de tiempo de vida opcional. Cuando Watson IoT Platform recibe una solicitud de gestión de dispositivos con un tiempo de vida, calcula el tiempo necesario antes de que se precise otra solicitud de gestión de dispositivo y lo almacena en el atributo "mgmt.dormantDateTime".
fr: Les terminaux possèdent un cycle de vie de gestion défini par leur statut de terminaux gérés. Sur le terminal, l'agent de gestion des terminaux est chargé d'envoyer une demande Gérer le terminal à l'aide du protocole de gestion des terminaux. Pour traiter les terminaux obsolètes dans des parcs de terminaux importants, vous pouvez contraindre un terminal géré à envoyer régulièrement une demande Gérer le terminal et permettre ainsi à Watson IoT Platform de détecter sa mise en veille éventuelle. Pour faciliter l'utilisation de cette fonction, la demande Gérer le terminal inclut le paramètre facultatif 'lifetime'. Lorsque Watson IoT Platform reçoit une demande Gérer le terminal avec le paramètre 'lifetime', il calcule la date et l'heure avant lesquelles une autre demande Gérer le terminal doit être émise et les stocke dans l'attribut "mgmt.dormantDateTime".
ko: 디바이스에 관리 디바이스로 상태에서 정의되는 관리 라이프사이클이 있습니다. 디바이스의 디바이스 관리 에이전트는 디바이스 관리 프로토콜을 통해 디바이스 관리 요청 전송을 담당합니다. 다수의 디바이스에서 존재하지 않는 디바이스를 처리하려고 관리 디바이스가 디바이스 관리 요청을 정기적으로 보내도록 설정되어 Watson IoT Platform에서 디바이스 휴지 상태를 알릴 수 있습니다. 이 기능을 쉽게 사용할 수 있도록 디바이스 관리 요청에 선택적 lifetime 매개변수가 있습니다. Watson IoT Platform에서 lifetime이 포함된 디바이스 관리 요청을 수신하면 다른 디바이스 관리 요청이 필요할 때까지의 시간을 계산하여 "mgmt.dormantDateTime" 속성에 저장합니다.

source: Whether the device has become dormant
de: Gibt an, ob die Einheit zu einer ruhenden Einheit wurde
es: Si el dispositivo se ha vuelto inactivo
fr: Indique si le terminal est passé en mode veille
ko: 디바이스가 휴지 상태가 되었는지 여부

source: ISO8601 date-time: Date and time at which the managed device will become dormant
de: ISO8601 date-time: Datum und Zeit des Zeitpunkts, an dem die Einheit zu einer ruhenden Einheit wird
es: ISO8601 date-time: Fecha y hora a las que el dispositivo gestionado pasará a estar inactivo
fr: ISO8601 date-time : Date et heure auxquelles le terminal géré passe en mode veille
ko: ISO8601 date-time: 관리 디바이스가 휴지 상태가 되는 날짜 및 시간

source: ISO8601 date-time: Date and time of last activity, updated periodically
de: ISO8601 date-time: Datum und Zeit der letzten Aktivität, wird regelmäßig aktualisiert
es: ISO8601 date-time: Fecha y hora de la actividad más reciente, actualizado de forma periódica
fr: ISO8601 date-time : Date et heure de la dernière activité, mises à jour régulièrement
ko: ISO8601 date-time: 마지막 활동의 날짜 및 시간으로 정기적으로 업데이트됨

source: Whether the device supports Reboot and Factory Reset actions
de: Gibt an, ob von der Einheit die Aktionen für Neustart und Factory-Reset unterstützt werden
es: Si el dispositivo admite las acciones de reinicio y restauración a configuración de fábrica
fr: Indique si le terminal prend en charge les actions Réamorcer et Réinitialiser avec les paramètres d'usine
ko: 디바이스가 다시 부팅 및 팩토리 재설정 조치를 지원하는지 여부

source: Whether the device supports Firmware Download and Firmware Update actions
de: Gibt an, ob von der Einheit die Aktionen für Firmware-Download und Firmware-Update unterstützt werden
es: Si el dispositivo admite las acciones de descarga de firmware y actualización de firmware
fr: Indique si le terminal prend en charge les actions de téléchargement et de mise à jour du microprogramme
ko: 디바이스가 펌웨어 다운로드 및 펌웨어 업데이트 조치를 지원하는지 여부

source: The version of the firmware on the device
de: Die Version der Firmware der Einheit
es: Versión del firmware en el dispositivo
fr: Version du microprogramme installé sur le terminal
ko: 디바이스의 펌웨어 버전

source: The name of the firmware to be used on the device
de: Der Name der Firmware, die auf der Einheit verwendet werden soll
es: Nombre del firmware que se va a utilizar en el dispositivo
fr: Nom du microprogramme qui doit être utilisé sur le terminal
ko: 디바이스에서 사용될 펌웨어의 이름

source: The URI from which the firmware image can be downloaded
de: Die URI, von der das Firmware-Image heruntergeladen werden kann
es: URI desde el que se puede descargar la imagen de firmware
fr: URI à partir duquel l'image du microprogramme peut être téléchargée
ko: 펌웨어 이미지를 다운로드할 수 있는 URI

source: The verifier such as a checksum for the firmware image to validate its integrity
de: Der Verifizierungszeichenfolge (zum Beispiel eine Kontrollsumme) für das Firmware-Image zum Überprüfen der Integrität
es: Verificador, como una suma de comprobación, de la imagen de firmware para validar su integridad.
fr: Vérificateur, par exemple un total de contrôle, permettant de valider l'intégrité de l'image du microprogramme
ko: 무결성을 유효성 검증할 펌웨어 이미지에 대한 체크섬 등의 검사기

source: Indicates the state of firmware download
de: Gibt den Status des Firmware-Downloads an
es: Indica el estado de la descarga de firmware
fr: Indique l'état du téléchargement du microprogramme
ko: 펌웨어 다운로드의 상태를 표시함

source: Indicates the status of the update
de: Gibt den Status der Aktualisierung an
es: Indica el estado de la actualización
fr: Indique le statut de la mise à jour
ko: 업데이트의 상태를 표시함

source: ISO8601 date-time: Date of last update
de: ISO8601 date-time: Datum und Zeit der letzten Aktualisierung
es: ISO8601 date-time: Fecha de la actualización más reciente
fr: ISO8601 date-time : Date de la dernière mise à jour
ko: ISO8601 date-time: 마지막 업데이트의 날짜

source: DMA
fr: AGT

source: R
fr: L

source: W
fr: E

source: The device model describes the metadata and management characteristics of a device. The device database in the Internet of Things Foundation is the master source of device information. Applications and managed devices are able to send updates to the database such as a location or the progress of a firmware update. Once these updates are received by the Internet of Things Foundation, the device database is updated, making the information available to applications.
de: Vom Einheitenmodell werden die Einheitenmetadaten und Managementeigenschaften einer Einheit beschrieben. Die Einheitendatenbank in Internet of Things Foundation ist die Hauptquelle der Einheiteninformationen. Von Anwendungen und verwalteten Einheiten können Aktualisierungen an die Datenbank gesendet werden, zum Beispiel zur Position oder zum Fortschritt eines Firmware-Updates. Sobald diese Aktualisierungen von Internet of Things Foundation empfangen werden, wird die Einheitendatenbank aktualisiert und die Informationen werden den Anwendungen zur Verfügung gestellt.

source: Every device has a typeId and deviceId attribute. Typically, the typeId represents the model of your device, whilst the deviceId can represent its serial number. Within your Internet of Things Foundation organization, the combination of typeId and deviceId must be unique for each device.
de: Jede Einheit verfügt über die Attribute 'typeId' und 'deviceId'. In der Regel gibt 'typeId' das Modell der Einheit an, während 'deviceId' für ihre Seriennummer stehen kann. Innerhalb einer Internet of Things Foundation-Organisation müssen die Angaben für 'typeId' und 'deviceId' für jede Einheit eindeutig sein.

source: In addition, the Internet of Things Foundation constructs a further identifier for each device based on your organizationId, the device's typeId and the device's deviceId. This identifier - the clientId - allows you to identify unequivocally an individual device.
de: Außerdem wird von Internet of Things Foundation für jede Einheit eine weitere Kennung erstellt, die aus den Angaben für 'organizationId', 'typeId' und 'deviceId' der Einheit besteht. Diese Kennung wird als 'clientId' bezeichnet und ermöglicht die zweifelsfreie Identifizierung jeder einzelnen Einheit.

source: Each device connected to the Internet of Things Foundation is associated with a device type. Device types are intended to be groups of devices which share characteristics or behaviour.
de: Jeder Einheit, die mit Internet of Things Foundation verbunden ist, ist ein Einheitentyp zugeordnet. Einheitentypen dienen dazu, Einheiten mit gemeinsamen Eigenschaften oder gemeinsamem Verhalten in Gruppen zusammenzufassen.

source: A device type has a set of attributes. When a device is added to the Internet of Things Foundation, the attributes in its device type are used as a template overridden by device-specific attributes. For example, the device type could have a value for the ``deviceInfo.fwVersion`` attribute reflecting the firmware version at the time of manufacture, and this value would be copied from the device type into the devices as they are added. However, if a device was added which already had a value for ``deviceInfo.fwVersion``, it would not be overridden by the device type.
de: Ein Einheitentyp verfügt über eine bestimmten Menge an Attributen. Wenn eine Einheit zu Internet of Things Foundation hinzugefügt wird, werden die Attribute ihres Einheitentyps als Vorlage verwendet, die durch einheitenspezifische Attribute überschrieben werden. Ein Einheitentyp kann zum Beispiel für das Attribut ``deviceInfo.fwVersion`` einen Wert aufweisen, aus dem die Firmwareversion zum Zeitpunkt der Herstellung hervorgeht; dieser Wert wird aus dem Einheitentyp in die Einheiten kopiert, wenn diese hinzugefügt werden. Wenn jedoch eine Einheit hinzugefügt wird, die bereits über einen Wert für ``deviceInfo.fwVersion`` verfügt, wird dieser nicht durch den Einheitentyp überschrieben.

source: The table below shows the list of attributes which can apply to devices in the Internet of Things Foundation. Additionally, italicized attributes can also apply to device types.
de: In der nachfolgenden Tabelle werden die Attribute aufgelistet, die auf Einheiten in Internet of Things Foundation angewendet werden können. In Kursivdruck angezeigte Attribute können außerdem auch auf Einheitentypen angewendet werden.

source: The client ID used with MQTT connections (d:org- id:device-type:device-id)
de: Die Client-ID, die mit MQTT-Verbindungen verwendet wird (d:org- id:device-type:device-id)

source: The diagnostics attributes are optional, and only present for devices with error log information. These attributes are intended for diagnosing device problems, not troubleshooting connectivity to the Internet of Things Foundation. In order to retrieve the information in these attributes, it must be queried separately, because the information stored in these attributes could potentially be very large.
de: Die Diagnoseattribute sind optional und nur für Einheiten mit Fehlerprotokollinformationen verfügbar. Diese Attribute sind für die Diagnose von Einheitenproblemen konzipiert, nicht zur Behebung von Fehlern im Zusammenhang mit der Verbindung zu Internet of Things Foundation. Die Informationen in diesen Attributen müssen separat abgerufen werden, weil die in diesen Attributen gespeicherten Informationen unter Umständen sehr umfangreich sein können.

source: The ``mgmt.`` attributes are only present for managed devices. When a managed device becomes dormant, it becomes unmanaged and the ``mgmt.`` attributes are deleted. The ``mgmt.`` attributes are set by the Internet of Things Foundation as a result of processing device management requests. These attributes cannot be directly written using the API.
de: Attribute des Typs ``mgmt.`` stehen nur für verwaltete Einheiten zur Verfügung. Wenn eine verwaltete Einheit zu einer ruhenden Einheit wird, wird sie zu einer nicht verwalteten Einheit und die Attribute des Typs ``mgmt.`` werden gelöscht. Die Attribute des Typs ``mgmt.`` werden von Internet of Things Foundation als Ergebnis der Verarbeitung von Einheitenmanagementanforderungen eingestellt. Diese Attribute können nicht direkt von der API geschrieben werden.

source: Devices have a management lifecycle, defined by their status as managed devices. The device management agent on the device is responsible for sending a Manage Device request using the device management protocol. To deal with defunct devices in large device populations, a managed device can be set to send a Manage Device request regularly, allowing the Internet of Things Foundation to notice when a device has become dormant. To facilitate this functionality, the Manage Device request has an optional lifetime parameter, When the Internet of Things Foundation receives a Manage Device request with a lifetime, it calculates the time before which another Manage Device request is required and stores it in the "mgmt.dormantDateTime" attribute.
de: Einheiten verfügen über einen Managementlebenszyklus, der von ihrem Status als verwaltete Einheit definiert wird. Der Einheitenmanagementagent einer Einheit ist dafür zuständig, die Anforderung 'Einheit verwalten' mithilfe des Einheitenmanagementprotokolls zu senden. Zur Handhabung von nicht mehr bestehenden Einheiten in einer Umgebung mit einer großen Anzahl an Einheiten, kann eine verwaltete Einheit so eingestellt werden, dass von ihr regelmäßig die Anforderung 'Einheit verwalten' gesendet wird; so kann von Internet of Things Foundation erkannt werden, ob eine Einheit zu einer ruhenden Einheit geworden ist. Zur Vereinfachung dieser Funktion verfügt die Anforderung 'Einheit verwalten' über einen optionalen Parameter für den Lebenszyklus. Wenn Internet of Things Foundation die Anforderung 'Einheit verwalten' mit dem Parameter für den Lebenszyklus empfängt, wird von ihr der Zeitpunkt berechnet, vor dem eine weitere Anforderung des Typs 'Einheit verwalten' erforderlich ist, und speichert diesen Wert im Attribut "mgmt.dormantDateTime".
