Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/device_model.po
Languages: de, es, fr, ko

source: Device Model
de: Einheitenmodell
es: Modelo de dispositivo
fr: Modèle de terminal
ko: 디바이스 모델

source: The device model describes the metadata and management characteristics of a device. The device database in the Watson IoT platform is the master source of device information. Applications and managed devices are able to send updates to the database such as a location or the progress of a firmware update. Once these updates are received by the Watson IoT platform, the device database is updated, making the information available to applications.
es: El modelo de dispositivo describe los metadatos y las características de gestión de un dispositivo. La base de datos de dispositivos de Watson IoT Platform es el origen maestro de la información sobre el dispositivo. Las aplicaciones y los dispositivos gestionados pueden enviar actualizaciones a la base de datos, como la ubicación o el progreso de una actualización del firmware. Una vez que Watson IoT Platformha recibido estas actualizaciones, la base de datos de dispositivos se actualiza y pone la información a disposición de las aplicaciones.
fr: Le modèle de terminal décrit les métadonnées et les caractéristiques de gestion d'un terminal. La base de données de terminaux d'IoT Platform représente la principale source d'informations sur les terminaux. Les applications et les terminaux gérés peuvent envoyer des mises à jour à la base de données, comme un emplacement ou la progression de la mise à jour d'un microprogramme. Une fois ces mises à jour reçues par Watson IoT Platform, la base de données de terminaux est modifiée et les informations sont mises à la disposition des applications.
ko: 디바이스 모델은 디바이스의 관리 특성 및 메타데이터에 대해 설명합니다. Watson IoT Platform에 있는 디바이스 데이터베이스는 디바이스 정보에 대한 마스터 소스입니다. 애플리케이션 및 관리 디바이스가 펌웨어 업데이트의 진행상태 또는 위치 등 데이터베이스에 대한 업데이트를 보낼 수 있습니다. Watson IoT Platform에서 해당 업데이트를 수신하면 디바이스 데이터베이스가 업데이트되므로 애플리케이션에서 정보를 사용할 수 있게 됩니다.

source: With the exception of the management extension, the entire device model is available for both managed and unmanaged devices. However, an unmanaged device can not directly update its device model in the database.
de: Abgesehen von der Managementerweiterung ist das gesamte Einheitenmodell sowohl für verwaltete als auch nicht verwaltete Einheiten verfügbar. Von einer nicht verwalteten Einheit kann das eigene Einheitenmodell jedoch nicht direkt in der Datenbank aktualisiert werden.
es: Excepto la ampliación de gestión, todo el modelo de dispositivo está disponible para dispositivos gestionados y no gestionados. Sin embargo, un dispositivo no gestionado no puede actualizar directamente su modelo de dispositivo en la base de datos.
fr: A l'exception de l'extension de gestion, l'ensemble du modèle de terminal peut être utilisé pour des terminaux gérés et des terminaux non gérés. Toutefois, un terminal non géré ne peut pas mettre à jour directement son modèle de terminal dans la base de données.
ko: 관리 확장기능을 제외하고 전체 디바이스 모델이 관리 및 비관리 디바이스 둘 다에 대해 사용 가능합니다. 그러나 비관리 디바이스는 데이터베이스에서 디바이스 모델을 직접 업데이트할 수 없습니다.

source: Device Identification
de: Einheitenidentifikation
es: Identificación del dispositivo
fr: Identification du terminal
ko: 디바이스 식별

source: Every device has a typeId and deviceId attribute. Typically, the typeId represents the model of your device, whilst the deviceId can represent its serial number. Within your Watson IoT platform organization, the combination of typeId and deviceId must be unique for each device.
es: Todos los dispositivos tienen un atributo typeId y deviceId. Por lo general, el typeId representa el modelo del dispositivo, mientras el deviceId puede representar su número de serie. Dentro de su organización de Watson IoT Platform, la combinación de typeId y deviceId debe ser exclusiva de cada dispositivo.
fr: Chaque terminal possède un attribut typeId et deviceId. En général, l'attribut typeId représente le modèle de votre terminal et l'attribut deviceId peut représenter son numéro de série. Dans votre organisation Watson IoT Platform, la combinaison des attributs typeId et deviceId doit être unique pour chaque terminal.
ko: 모든 디바이스에 typeId 및 deviceId 속성이 있습니다. 일반적으로, typeId는 디바이스의 모델을 나타내고 deviceId는 일련 번호를 나타낼 수 있습니다. Watson IoT Platform 조직 내에서 typeId 및 deviceId의 조합은 디바이스마다 고유해야 합니다.

source: In addition, the Watson IoT platform constructs a further identifier for each device based on your organizationId, the device's typeId and the device's deviceId. This identifier - the clientId - allows you to identify unequivocally an individual device.
es: Asimismo, Watson IoT Platform construye otro identificador para cada dispositivo en función de su organizationId, el typeId del dispositivo y su deviceId. Este identificador, el clientId, permite identificar de manera inequívoca un dispositivo individual.
fr: De plus, Watson IoT Platform génère un autre identificateur pour chaque terminal à partir des attributs organizationId, typeId et deviceId du terminal. Cet identificateur, clientId, permet d'identifier sans équivoque un terminal spécifique.
ko: 또한 Watson IoT Platform은 organizationId, 디바이스의 typeId 및 디바이스의 deviceId를 기반으로 디바이스마다 추가 ID를 생성합니다. 이 ID, clientId를 통해 개별 디바이스를 명백히 식별할 수 있습니다.

source: The characters which can be used in these identifiers are restricted so they can be used straightforwardly in communication protocols and REST APIs. There are a number of optional device identifiers for use with the device management protocol. These identifiers are:
de: Da die Zeichen in diesen Kennungen beschränkt sind, können sie in den Kommunikationsprotokollen und REST-APIs unkompliziert verwendet werden. Zur Verwendung mit dem Einheitenmanagementprotokoll stehen eine Reihe optionaler Einheitenkennungen zur Verfügung. Zu diesen Kennungen zählen:
es: Los caracteres que se pueden utilizar en estos identificadores están limitados por lo que se pueden utilizar directamente en los protocolos de comunicaciones y API REST. Existen varios identificaciones de dispositivo opcionales para utilizar con el protocolo de gestión de dispositivos. Estos identificadores son:
fr: Les caractères qui peuvent être utilisés dans ces identificateurs sont limités afin de permettre leur utilisation immédiate dans les protocoles de communication et les API REST. Un certain nombre d'identificateurs de terminal facultatifs peuvent être utilisés avec le protocole de gestion des terminaux. Ces identificateurs sont les suivants :
ko: 통신 프로토콜 및 REST API에서 간단하게 사용할 수 있도록 이러한 ID에 사용할 수 있는 문자가 제한됩니다. 디바이스 관리 프로토콜과 함께 사용할 다수의 선택적 디바이스 ID가 있습니다. 이러한 ID는 다음과 같습니다.

source: For more information on the identifiers and descriptions of their comparative identifiers in other device management standards, see Device Model Attributes Reference.
de: Weitere Informationen zu den Kennungen und Beschreibungen der vergleichbaren Kennungen in anderen Einheitenmanagementstandards finden Sie in der Referenz zu den Einheitenmodellattributen.
es: Para obtener más información sobre los identificadores y las descripciones de sus identificadores comparativos en otros estándares de gestión de dispositivos, consulte el apartado Referencia de atributos de modelo de dispositivo.
fr: Pour obtenir plus d'informations sur les identificateurs et une description comparée des identificateurs utilisés dans d'autres normes de gestion des terminaux, reportez-vous au document de référence consacré aux attributs du modèle de terminal.
ko: 기타 디바이스 관리 표준에서 비교되는 ID에 대한 설명 및 ID에 대한 자세한 정보는 디바이스 모델 속성 참조를 참조하십시오.

source: Identifiers and Device Type
de: Einheiten und Einheitentyp
es: Identificadores y tipo de dispositivo
fr: Identificateurs et type de terminal
ko: ID 및 디바이스 유형

source: Each device connected to the Watson IoT platform is associated with a device type. Device types are intended to be groups of devices which share characteristics or behaviour.
es: Cada dispositivo conectado a Watson IoT Platform está asociado con un tipo de dispositivo. Los tipos de dispositivo están pensados para ser grupos de dispositivos que comparten características o un comportamiento.
fr: Chaque terminal connecté à Watson IoT Platform est associé à un type de terminal. Les types de terminaux représentent des groupes des terminaux qui possèdent des caractéristiques ou un comportement similaires.
ko: Watson IoT Platform에 연결된 각 디바이스는 디바이스 유형과 연관됩니다. 디바이스 유형은 특성 또는 동작을 공유하는 디바이스의 그룹이 되도록 계획됩니다.

source: A device type has a set of attributes. When a device is added to the Watson IoT platform, the attributes in its device type are used as a template overridden by device-specific attributes. For example, the device type could have a value for the ``deviceInfo.fwVersion`` attribute reflecting the firmware version at the time of manufacture, and this value would be copied from the device type into the devices as they are added. However, if a device was added which already had a value for ``deviceInfo.fwVersion``, it would not be overridden by the device type.
es: Un tipo de dispositivo tiene un conjunto de atributos. Cuando se añade un dispositivo a Watson IoT Platform, los atributos que hay en su tipo de dispositivo se utilizan como una plantilla que es sustituida por los atributos específicos del dispositivo. Por ejemplo, el tipo de dispositivo puede tener un valor para el atributo deviceInfo.fwVersion que refleje la versión de firmware en el momento de la fabricación y este valor se copiaría desde el tipo de dispositivo en los dispositivos a medida que se añadan. Sin embargo, si se ha añadido un dispositivo que ya tenía un valor para deviceInfo.fwVersion, se sustituiría por el tipo de dispositivo.
fr: Un type de terminal possède un ensemble d'attributs. Lorsqu'un terminal est ajouté à Watson IoT Platform, les attributs de son type sont utilisés comme modèle et remplacés par des attributs propres au terminal. Par exemple, le type de terminal peut inclure une valeur pour l'attribut ``deviceInfo.fwVersion`` qui indique la version du microprogramme installé au moment de la fabrication du terminal et cette valeur est copiée à partir du type de terminal sur les terminaux ajoutés. Toutefois, si un terminal ajouté possède déjà une valeur pour ``deviceInfo.fwVersion``, cette valeur ne peut pas être remplacée par la valeur du type de terminal.
ko: 디바이스 유형에는 속성 세트가 있습니다. 디바이스가 Watson IoT Platform에 추가되면 디바이스 유형의 속성이 디바이스별 속성에서 대체된 템플리트로 사용됩니다. 예를 들어, 디바이스 유형에는 제조업체의 시간에 펌웨어 버전을 반영하는 ``deviceInfo.fwVersion`` 속성의 값일 수 있고 이 값은 추가 시 디바이스 유형에서 디바이스로 복사됩니다. 그러나 ``deviceInfo.fwVersion``에 대해 이미 값이 있는 디바이스가 추가된 경우 디바이스 유형으로 대체되지 않습니다.

source: When a device type is updated, future registered devices will reflect the modified device type template. However, existing devices of this device type are unaffected and remain unchanged.
de: Wenn ein Einheitentyp aktualisiert wird, findet die geänderte Einheitentypvorlage in zukünftigen registrierten Einheiten ihren Niederschlag. Bereits vorhandene Einheiten dieses Typs sind davon jedoch nicht betroffen und bleiben unverändert.
es: Cuando se actualiza un tipo de dispositivo, los dispositivos registrados en el futuro reflejarán la plantilla de tipos de dispositivo modificada. Sin embargo, los dispositivos existentes de este tipo de dispositivo no se verán afectados y permanecerán invariables.
fr: Lorsqu'un type de terminal est mis à jour, les terminaux enregistrés par la suite prennent en compte le modèle du type de terminal modifié. En revanche, les terminaux existants qui sont déjà associés à ce type de terminal ne sont pas affectés et restent inchangés.
ko: 디바이스 유형이 업데이트되면 등록된 추가 디바이스가 수정된 디바이스 유형 템플리트를 반영합니다. 그러나 이 디바이스 유형의 기존 디바이스는 영향을 받지 않고 계속 변경되지 않습니다.

source: Attributes
de: Attribute
es: Atributos
fr: Attributs
ko: 속성

source: The table below shows the list of attributes which can apply to devices in the Watson IoT platform. Additionally, italicized attributes can also apply to device types.
es: La tabla siguiente muestra la lista de atributos que se pueden aplicar a los dispositivos en Watson IoT Platform. Asimismo, los atributos en cursiva pueden aplicarse también a tipos de dispositivo.
fr: Le tableau ci-dessous contient la liste des attributs applicables à des terminaux dans Watson IoT Platform. Les attributs en italique peuvent également s'appliquer à des types de terminaux.
ko: 다음 표는 Watson IoT Platform에서 디바이스에 적용할 수 있는 속성 목록을 보여줍니다. 또한 이탤릭체 속성은 디바이스 유형에도 적용될 수 있습니다.

source: API/DMA: Can be updated by API/Device Management Agent
de: API/DMA: Kann von der API bzw. dem Einheitenmanagementagenten aktualisiert werden
es: API/DMA: Puede actualizarse mediante API/Agente de gestión de dispositivo
fr: API/AGT : Peut être mis à jour par l'API et l'agent de gestion des terminaux
ko: API/DMA: API/디바이스 관리 에이전트에서 업데이트될 수 있음

source: R: Read only
de: R: Schreibgeschützt
es: R: De solo lectura
fr: L : En lecture seule
ko: R: 읽기 전용

source: W: Write and read
de: W: Schreiben und Lesen
es: W: Grabación y lectura
fr: E : Accessible en écriture et en lecture
ko: W: 쓰기 및 읽기

source: A: Append
de: A: Anhängen
es: A: Anexo
fr: A : Ajout
ko: A: 추가

source: Attribute
es: Atributo
fr: Attribut
ko: 속성

source: Type
de: Typ
es: Tipo
ko: 유형

source: Description
de: Beschreibung
es: Descripción
ko: 설명

source: string
de: Zeichenfolge
es: serie
fr: Chaîne
ko: 문자열

source: The client ID used with MQTT connections
es: El ID de cliente utilizado con las conexiones MQTT.
fr: ID client utilisé avec des connexions MQTT
ko: MQTT 연결과 함께 사용되는 클라이언트 ID

source: Device type
de: Einheitentyp
es: Tipo de dispositivo
fr: Type de terminal
ko: 디바이스 유형

source: Device ID
de: Einheiten-ID
es: Id de dispositivo
fr: ID terminal
ko: 디바이스 ID

source: Class of device ("Device" or "Gateway")
es: La clase de dispositivo ("Device" o "Gateway").
fr: Classe du terminal ("Terminal" ou "Passerelle")
ko: 디바이스의 클래스("Device" 또는 "Gateway")

source: Type ID of the gateway this device is using
es: El ID de tipo de la pasarela que este dispositivo utiliza.
fr: ID type de la passerelle que ce terminal utilise
ko: 해당 디바이스가 사용하고 있는 게이트웨이의 유형 ID

source: Device ID of the gateway this device is using
es: El ID de dispositivo de la pasarela que este dispositivo utiliza.
fr: ID terminal de la passerelle que ce terminal utilise
ko: 해당 디바이스가 사용하고 있는 게이트웨이의 디바이스 ID

source: boolean
de: Boolescher Wert
es: booleano
fr: booléen
ko: 부울

source: Whether the device has an alert
de: Gibt an, ob von der Einheit ein Alert gesendet wird
es: Si el dispositivo tiene una alerta
fr: Indique si le terminal inclut une alerte
ko: 디바이스에 경보가 있는지 여부

source: The serial number of the device
de: Die Seriennummer der Einheit
es: Número de serie del dispositivo
fr: Numéro de série du terminal
ko: 디바이스의 일련 번호

source: The manufacturer of the device
de: Der Hersteller der Einheit
es: Fabricante del dispositivo
fr: Fabricant du terminal
ko: 디바이스의 제조업체

source: The model of the device
de: Das Modell der Einheit
es: Modelo del dispositivo
fr: Modèle du terminal
ko: 디바이스의 모델

source: The class of the device
de: Die Klasse der Einheit
es: Clase del dispositivo
fr: Classe du terminal
ko: 디바이스의 클래스

source: The descriptive name of the device
de: Der beschreibende Name der Einheit
es: Nombre descriptivo del dispositivo
fr: Nom descriptif du terminal
ko: 디바이스의 설명 이름

source: The firmware version currently known to be on the device
de: Die Firmwareversion, die derzeit auf der Einheit bekannt ist
es: Versión de firmware que se sabe que está actualmente en el dispositivo
fr: Version du microprogramme actuellement identifiée sur le terminal
ko: 디바이스에 있는 것으로 현재 알려진 펌웨어 버전

source: The hardware version of the device
de: Die Hardwareversion der Einheit
es: Versión de hardware del dispositivo
fr: Version du matériel du terminal
ko: 디바이스의 하드웨어 버전

source: The descriptive location, such as a room or building number, or a geopgraphical region
de: Die beschreibende Position, zum Beispiel ein Raum, eine Gebäudenummer oder eine geografische Region
es: Ubicación descriptiva, por ejemplo, un número de edificio o de sala o una región geográfica
fr: Description de l'emplacement, comme le numéro d'une salle ou d'un bâtiment, ou une zone géographique
ko: 룸 또는 빌딩 번호나 지리적 지역 등의 설명적 위치

source: complex
de: komplex
es: complejo
fr: complexe
ko: 복합

source: Free-form metadata
de: Unformatierte Metadaten
es: Metadatos de formato libre
fr: Métadonnées à format libre
ko: 자유 양식 메타데이터

source: ID that added the device
de: Kennung, die von der Einheit hinzugefügt wurde
es: ID que ha añadido el dispositivo
fr: ID qui a ajouté le terminal
ko: 디바이스를 추가한 ID

source: ISO8601 date-time: Date and time the device was added
de: ISO8601 date-time: Datum und Zeit des Zeitpunkts, an dem die Einheit hinzugefügt wurde
es: ISO8601 date-time: Fecha y hora a la que se ha añadido el dispositivo
fr: ISO8601 date-time : Date et heure auxquelles le terminal a été ajouté
ko: ISO8601 date-time: 디바이스가 추가된 날짜 및 시간

source: URI of diag extension for error codes, if present
de: URI der Diagnoseerweiterung für Fehlercode, sofern vorhanden
es: URI de extensión diag para los códigos de error, si está presente
fr: URI de l'extension de diagnostic des codes d'erreur, s'il existe
ko: 표시된 경우 오류 코드에 대한 진단 확장기능의 URI

source: URI of diag extension for logs, if present
de: URI der Diagnoseerweiterung für Protokolle, sofern vorhanden
es: URI de extensión diag para los registros, si está presente
fr: URI de l'extension de diagnostic des journaux, s'il existe
ko: 표시된 경우 로그에 대한 진단 확장기능의 URI

source: URI of location extension, if present
de: URI der Positionserweiterung, sofern vorhanden
es: URI de extensión de ubicación, si está presente
fr: URI de l'extension d'emplacement, s'il existe
ko: 표시된 경우 위치 확장기능의 URI

source: URI of mgmt extension, is present
de: URI der Managementerweiterung, sofern vorhanden
es: URI de extensión mgmt, si está presente
fr: URI de l'extension de gestion, s'il existe
ko: 표시된 경우 mgmt 확장기능의 URI

source: Extended Attributes
de: Erweiterte Attribute
es: Atributos ampliados
fr: Attributs étendus
ko: 확장된 속성

source: In addition to core attributes listed above, there are additional attributes which are treated as extensions to the core device model. Simple queries about the device return information from the core device model, but not the extensions. Information from the extensions must be specifically requested.
de: Zusätzlich zu den oben aufgelisteten Basisattributen gibt es zusätzliche Attribute, die als Erweiterungen zum Basiseinheitenmodell anzusehen sind. Einfache Abfragen zu den Einheitenrückgabeinformationen vom Basiseinheitenmodell, aber keine Erweiterungen. Informationen von Erweiterungen müssen ausdrücklich angefordert werden.
es: Además de los atributos básicos indicados más arriba, hay atributos adicionales que se tratan como extensiones en el modelo básico de dispositivo. Las consultas simples sobre el dispositivo devuelven información del modelo básico de dispositivo, pero no las ampliaciones. La información sobre las ampliaciones debe solicitarse de forma específica.
fr: Outre les attributs de base ci-dessus, d'autres attributs sont traités comme des extensions du modèle de terminal de base. Des requêtes simples relatives au terminal renvoient des informations provenant du modèle de terminal de base mais pas des extensions. Les informations des extensions doivent être spécifiquement demandées.
ko: 위에 나열된 코어 속성에 더하여, 코어 디바이스 모델에 확장기능으로 처리되는 추가 속성이 있습니다. 디바이스에 대한 단순 조회에서는 코어 디바이스 모델에서 정보를 리턴하지만, 확장기능은 아닙니다. 확장기능의 정보를 특히 요청해야 합니다.

source: Extension Name
de: Erweiterungsname
es: Nombre de ampliación
fr: Nom de l'extension
ko: 확장기능 이름

source: Prefix of attributes
de: Präfix der Attribute
es: Prefijo de atributos
fr: Préfixe des attributs
ko: 속성의 접두부

source: Purpose
de: Verwendungszweck
es: Finalidad
fr: Fonction
ko: 용도

source: Diagnostics
de: Diagnose
es: Diagnósticos
fr: Diagnostic
ko: 진단

source: Error logs and diagnostic information
de: Fehlerprotokolle und Diagnoseinformationen
es: Registros de errores e información de diagnóstico
fr: Journaux des erreurs et informations de diagnostic
ko: 오류 로그 및 진단 정보

source: Location
de: Standort
es: Ubicación
fr: Emplacement
ko: 위치

source: location
es: ubicación
ko: 위치

source: Location of the device, potentially updated regularly
de: Position der Einheit, wird möglicherweise regelmäßig aktualisiert
es: Ubicación del dispositivo, potencialmente se actualiza de forma periódica
fr: Emplacement du terminal qui peut être mis à jour régulièrement
ko: 디바이스의 위치로서, 정기적으로 업데이트될 수 있음

source: Device management
de: Einheitenmanagement
es: Gestión de dispositivos
fr: Gestion des terminaux
ko: 디바이스 관리

source: Device management actions, e.g. firmware update
de: Einheitenmanagementaktionen, zum Beispiel 'Firmware-Update'
es: Acciones de gestión de dispositivos, por ejemplo, actualización de firmware
fr: Actions de gestion des terminaux, par exemple la mise à jour du microprogramme
ko: 디바이스 관리 조치(예: 펌웨어 업데이트)

source: Diagnostics Extension
de: Diagnoseerweiterung
es: Ampliación de diagnóstico
fr: Extension de diagnostic
ko: 진단 확장기능

source: The diagnostics attributes are optional, and only present for devices with error log information. These attributes are intended for diagnosing device problems, not troubleshooting connectivity to the Watson IoT platform. In order to retrieve the information in these attributes, it must be queried separately, because the information stored in these attributes could potentially be very large.
es: Los atributos de diagnóstico son opcionales y solo están presentes en dispositivos con información de registro de errores. Estos atributos están concebidos para diagnosticar problemas de los dispositivos y no para resolver problemas de conectividad con Watson IoT Platform. Para poder recuperar la información en estos atributos, deben consultarse por separado, porque la información almacenada en estos atributos puede ser potencialmente muy grande.
fr: Les attributs de diagnostic sont facultatifs et sont disponibles uniquement pour les terminaux qui incluent des informations du journal des erreurs. Ces attributs sont conçus pour diagnostiquer les problèmes des terminaux, pas pour résoudre les problèmes de connectivité liés à Watson IoT Platform. Pour extraire les informations de ces attributs, vous devez les demander séparément car les informations qu'ils contiennent peuvent être très volumineuses.
ko: 진단 속성이 선택적이고 오류 로그 정보가 포함된 디바이스에 대해서만 표시됩니다. 이러한 속성은 디바이스 문제점을 진단하는 데 사용되므로, Watson IoT Platform에 대한 연결 문제점을 해결하지는 않습니다. 이러한 속성에서 정보를 검색하려면 이러한 속성에 저장된 정보가 잠재적으로 매우 클 수 있으므로 별도로 조회해야 합니다.
