Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/device_mgmt.po
Languages: es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: Device Management
es: Gestión de dispositivos
fr: Gestion des terminaux
it: Gestione dispositivo
ja: デバイス管理
ko: 디바이스 관리
pt_br: Gerenciamento de Dispositivo
zh_cn: 设备管理
zh_tw: 裝置管理

source: The device management feature enhances the Internet of Things Foundation service with new capabilities for managing devices. This introduction will introduce some of the concepts and features of device management.
es: La función de gestión de dispositivos amplía el servicio Internet of Things Foundation con nuevas capacidades de gestión de los dispositivos. En esta introducción, se presentan algunos de los conceptos y funciones de la gestión de dispositivos.
fr: La fonction de gestion des terminaux améliore le service Internet of Things Foundation en proposant de nouvelles fonctionnalités pour la gestion des terminaux. Cette introduction présente certains des concepts et des options de la fonction de gestion des terminaux.
it: La funzione di gestione dispositivo migliora il servizio Internet of Things Foundation con nuove funzioni per la gestione dei dispositivi. Questa introduzione presenta alcuni dei concetti e delle funzioni di gestione dispositivo.
ja: デバイス管理機能は、デバイスを管理するための新機能を追加して Internet of Things Foundation サービスを拡張します。この概要では、デバイス管理の概念および機能の一部について説明します。
ko: 디바이스 관리 기능에서는 디바이스를 관리하기 위한 새 기능으로 Internet of Things Foundation 서비스를 개선합니다. 여기에서는 디바이스 관리의 개념 및 기능의 일부를 소개합니다.
pt_br: O recurso de gerenciamento de dispositivo aprimora o serviço do Internet of Things Foundation com novos recursos para o gerenciamento de dispositivos. Esta introdução apresentará alguns dos conceitos e recursos de gerenciamento de dispositivos.
zh_cn: Internet of Things Foundation 服务中新增了一些设备管理功能。本简介中将介绍设备管理方面的一些概念和功能。
zh_tw: 裝置管理特性使用管理裝置的新功能來增強 Internet of Things Foundation 服務。這項簡介將介紹裝置管理的部分概念及特性。

source: What does Device Management add?
es: ¿Qué añade Gestión de dispositivos?
fr: Avantages de la fonction de gestion des terminaux
it: Cosa aggiunge la gestione dispositivo?
ja: デバイス管理で追加される内容
ko: 디바이스 관리가 추가하는 항목
pt_br: O que o Gerenciamento de Dispositivos inclui?
zh_cn: “设备管理”增加了哪些功能？
zh_tw: 「裝置管理」新增了哪些功能？

source: Control and management of device lifecycles for both individual and batches of devices.
es: Control y gestión de los ciclos de vida de los dispositivos tanto para dispositivos individuales como para lotes de dispositivos.
fr: Contrôle et gestion du cycle de vie de terminaux spécifiques ou de groupes de terminaux.
it: Controllo e gestione dei cicli di vita sia per dispositivi singoli che per gruppi di dispositivi.
ja: 個々のデバイスおよび多数のデバイスの両方に対するデバイス・ライフサイクルの制御および管理。
ko: 디바이스의 개별 처리 및 일괄처리 둘 다에 대해 디바이스 라이프사이클의 제어 및 관리입니다.
pt_br: Controle e gerenciamento de ciclos de vida de dispositivos para dispositivos individuais e lotes de dispositivos.
zh_cn: 可控制和管理单个和批量设备的设备生命周期。
zh_tw: 控制及管理個別和批次裝置兩者的裝置生命週期。

source: Device metadata and status information, enabling the creation of device dashboards and other tools.
es: Metadatos de dispositivo e información sobre el estado, lo que permite crear paneles de control de dispositivo y otras herramientas.
fr: Métadonnées et informations de statut des terminaux pour permettre la création de tableaux de bord de terminaux et d'autres outils.
it: Informazioni di stato e metadati dispositivo, che consentono la creazione di dashboard dispositivo e altri strumenti.
ja: デバイスのメタデータおよびステータスに関する情報。これにより、デバイス・ダッシュボードおよび他のツールの作成が可能になります。
ko: 디바이스 메타데이터 및 상태 정보인데, 디바이스 대시보드 및 기타 도구의 작성을 가능하게 합니다.
pt_br: Metadados de dispositivos e informações de status, permitindo a criação de painéis de dispositivos e outras ferramentas.
zh_cn: 设备元数据和状态信息（支持创建设备仪表板和其他工具）。
zh_tw: 裝置 meta 資料及狀態資訊，可用來建立裝置儀表板和其他工具。

source: Diagnostic information, both for connectivity to the Internet of Things Foundation service, and device diagnostics.
es: Información de diagnóstico, tanto sobre la conectividad al servicio Internet of Things Foundation como diagnósticos de dispositivos.
fr: Informations de diagnostic relatives à la connectivité avec le service Internet of Things Foundation et diagnostic des terminaux.
it: Informazioni di diagnostica, sia per la connettività al servizio Internet of Things Foundation che diagnostica dispositivo.
ja: Internet of Things Foundation サービスへの接続とデバイス診断の両方に関する診断情報。
ko: Internet of Things Foundation 서비스 및 디바이스 진단에 대한 연결 둘 다에 대한 진단 정보입니다.
pt_br: Informações de diagnóstico, para a conectividade com o serviço do Internet of Things Foundation e para diagnósticos do dispositivo.
zh_cn: 诊断信息（用于对 Internet of Things Foundation 服务连接和设备进行诊断）。
zh_tw: 診斷資訊，用於 Internet of Things Foundation 服務的連線功能以及裝置診斷。

source: Device management commands, like firmware update, and device reboot.
es: Mandatos de gestión de dispositivos, como actualización de firmware y reinicio de dispositivos.
fr: Commandes de gestion des terminaux, comme la mise à jour du microprogramme et le réamorçage des terminaux.
it: Comandi di gestione dispositivo, come l'aggiornamento firmware e il riavvio del dispositivo.
ja: ファームウェアの更新、デバイスのリブートなどの、デバイス管理コマンド。
ko: 펌웨어 업데이트와 같은 디바이스 관리 명령 및 디바이스 다시 부팅입니다.
pt_br: Comandos de gerenciamento de dispositivos, como atualização de firmware e reinicialização do dispositivo.
zh_cn: 设备管理命令（如固件更新和设备重新引导）。
zh_tw: 裝置管理指令，如韌體更新及裝置重新開機。

source: At a more technical level, device management adds:
es: A un nivel más técnico, la gestión de dispositivos añade:
fr: A un niveau plus technique, la fonction de gestion des terminaux ajoute les éléments suivants :
it: A un livello più tecnico, la gestione dispositivo aggiunge:
ja: より技術的なレベルで言うと、デバイス管理は、以下のものを追加します。
ko: 더 기술적인 레벨에서 디바이스 관리가 다음을 추가합니다.
pt_br: Em um nível mais técnico, o gerenciamento de dispositivo inclui:
zh_cn: 从较深的技术层面来讲，“设备管理”增加了以下内容：
zh_tw: 在技術層次上，裝置管理增加了：

source: a device model, that describes the metadata and management characteristics of a device,
es: un modelo de dispositivo, que describe los metadatos y las características de gestión de un dispositivo,
fr: Un modèle de terminal qui décrit les métadonnées et les caractéristiques de gestion d'un terminal.
it: un modello dispositivo, che descrive le caratteristiche di gestione e metadati di un dispositivo.
ja: デバイスのメタデータおよび管理特性について記述するデバイス・モデル、
ko: 디바이스의 메타데이터 및 관리 특성을 설명하는 디바이스 모델
pt_br: um modelo de dispositivo, que descreve os metadados e as características de gerenciamento de um dispositivo,
zh_cn: 设备模型（用于描述设备的元数据和管理特征），
zh_tw: 裝置模型，用於說明裝置的 meta 資料及管理性質；

source: a ReST API which provides a callable interface for managing devices,
es: una API REST, que ofrece una interfaz a la que se puede llamar para gestionar dispositivos
fr: Une API REST qui fournit une interface pouvant être appelée pour gérer des terminaux.
it: una API ReST che fornisce un'interfaccia richiamabile per la gestione dei dispositivi.
ja: デバイスを管理するための呼び出し可能なインターフェースを提供する ReST API
ko: 디바이스를 관리하기 위한 호출 가능한 인터페이스를 제공하는 ReST API
pt_br: uma API ReST, que fornece uma interface solicitável para o gerenciamento de dispositivos,
zh_cn: ReST API（提供了用于管理设备的可调用接口），以及
zh_tw: ReST API，提供用於管理裝置的可呼叫介面；

source: and a device management protocol, used for communication between the management agent on the devices and the Internet of Things Foundation.
es: y un protocolo de gestión de dispositivos, que se utiliza en las comunicaciones entre el agente de gestión en los dispositivos y el servicio Internet of Things Foundation.
fr: Un protocole de gestion des terminaux utilisé pour les communications entre l'agent de gestion des terminaux et Internet of Things Foundation.
it: e un protocollo di gestione dispositivo, utilizzato per la comunicazione tra l'agent di gestione sui dispositivi e Internet of Things Foundation.
ja: デバイス上の管理エージェントと Internet of Things Foundation の間の通信に使用されるデバイス管理プロトコル。
ko: Internet of Things Foundation 및 디바이스에서 관리 에이전트 간의 통신에 사용되는 디바이스 관리 프로토콜입니다.
pt_br: e um protocolo de gerenciamento de dispositivos, usado para a comunicação entre o agente de gerenciamento nos dispositivos e o Internet of Things Foundation.
zh_cn: 设备管理协议（用于设备上管理代理程序和 Internet of Things Foundation 之间的通信）。
zh_tw: 以及裝置管理通訊協定，用於裝置上的管理代理程式與 Internet of Things Foundation 之間的通訊。

source: Important concepts in device management
es: Conceptos importantes de la gestión de dispositivos
fr: Concepts importants de la gestion des terminaux
it: Concetti importanti nella gestione dispositivo
ja: デバイス管理における重要な概念
ko: 디바이스 관리의 중요한 개념
pt_br: Conceitos importantes no gerenciamento de dispositivos
zh_cn: 设备管理中的重要概念
zh_tw: 重要的裝置管理概念

source: Managed and Unmanaged Devices
es: Dispositivos gestionados y no gestionados
fr: Terminaux gérés et non gérés
it: Dispositivi gestiti e non gestiti
ja: 管理対象デバイスと非管理対象デバイス
ko: 관리 및 비관리 디바이스
pt_br: Dispositivos Gerenciados e Não Gerenciados
zh_cn: 受管设备和非受管设备
zh_tw: 受管理與未受管理的裝置

source: Device management creates a distinction between managed and unmanaged devices.
es: La gestión de dispositivos establece una diferencia entre dispositivos gestionados y no gestionados.
fr: La fonction de gestion des terminaux établit une distinction entre les terminaux gérés et les terminaux non gérés.
it: La gestione dispositivo crea una distinzione tra i dispositivi gestiti e non gestiti.
ja: デバイス管理は、管理対象デバイスと非管理対象デバイスとの区別を作成します。
ko: 디바이스 관리에서는 관리 및 비관리 디바이스 간의 차이를 작성합니다.
pt_br: O gerenciamento de dispositivos cria uma distinção entre dispositivos gerenciados e não gerenciados.
zh_cn: 设备管理可区分受管设备和非受管设备。
zh_tw: 裝置管理會區別受管理與未受管理的裝置。

source: **Managed Devices** are defined as devices which have a management agent installed. The management agent sends and receives device metadata and responds to device management commands from the Internet of Things Foundation. The device management agent and the Internet of Things Foundation device management service must share an understanding of data formats and communication patterns so they can interpret data correctly.
es: **Dispositivos gestionados** se definen como dispositivos que tienen instalado un agente. El agente de gestión envía y recibe metadatos de dispositivo y responde a los mandatos de gestión de dispositivos procedentes de Internet of Things Foundation. El agente de gestión de dispositivos y el servicio de gestión de dispositivos Internet of Things Foundation deben compartir el mismo concepto de formato de datos y patrones de comunicación para que puedan interpretar los datos correctamente.
fr: Les **terminaux gérés** sont des terminaux où un agent de gestion a été installé. L'agent de gestion envoie et reçoit les métadonnées du terminal et répond aux commandes de gestion des terminaux provenant d'Internet of Things Foundation. L'agent de gestion des terminaux et le service de gestion des terminaux Internet of Things Foundation doivent comprendre les formats de données et les modèles de communication de la même manière afin de pouvoir interpréter les données correctement.
it: **Dispositivi gestiti** sono definiti come dispositivi che hanno un agent di gestione installato. L'agent di gestione invia e riceve i metadati del dispositivo e risponde ai comandi di gestione dispositivo da Internet of Things Foundation. L'agente di gestione dispositivo e il servizio di gestione dispositivo di Internet of Things Foundation devono condividere una comprensione dei formati di dati e degli schemi di comunicazione in modo da poter interpretare i dati correttamente.
ja: **管理対象デバイス**とは、管理エージェントがインストールされているデバイスのことです。管理エージェントは、デバイスのメタデータを送受信し、Internet of Things Foundation からのデバイス管理コマンドに応答します。データを正しく解釈できるように、デバイス管理エージェントと Internet of Things Foundation デバイス管理サービスでデータ形式および通信パターンについての理解を共有する必要があります。
ko: 관리 에이전트가 설치되어 있는 디바이스로 **Managed Devices**가 정의됩니다. 관리 에이전트가 디바이스 메타데이터를 전송하고 수신하며 Internet of Things Foundation에서 디바이스 관리 명령에 응답합니다. 디바이스 관리 에이전트 및 Internet of Things Foundation 디바이스 관리 서비스가 데이터 형식 및 통신 패턴에 대한 이해를 공유해야 데이터를 올바르게 해석할 수 있습니다.
pt_br: **Dispositivos Gerenciados** são definidos como dispositivos que possuem um agente de gerenciamento instalado. O agente de gerenciamento envia e recebe metadados do dispositivo e responde aos comandos de gerenciamento de dispositivo do Internet of Things Foundation. O agente de gerenciamento de dispositivos e o serviço de gerenciamento de dispositivos do Internet of Things Foundation devem compartilhar informações sobre formatos de dados e padrões de comunicação para que possam interpretar os dados corretamente.
zh_cn: **Managed Devices** 定义为已安装管理代理程序的设备。管理代理程序可以与 Internet of Things Foundation 之间传输设备元数据，并响应来自 Internet of Things Foundation 的设备管理命令。设备管理代理程序和 Internet of Things Foundation 设备管理服务必须就数据格式和通信模式达成共识，这样它们才能正确解释数据。
zh_tw: **受管理裝置** 定義為已安裝管理代理程式的裝置。管理代理程式會傳送及接收裝置 meta 資料，並回應來自 Internet of Things Foundation 的裝置管理指令。裝置管理代理程式及 Internet of Things Foundation 裝置管理服務必須共用對資料格式與通訊型樣的瞭解，才能正確地解譯資料。

source: **Unmanaged Devices** are any devices which do not have a device management agent. All devices begin their lifecycle as unmanaged devices, and can transition to managed devices by sending a message from a device management agent to the Internet of Things Foundation. Devices without a device management agent installed can never become managed devices.
es: **Dispositivos no gestionados** son los dispositivos que no tienen un agente de gestión de dispositivos. Todos los dispositivos comienzan su ciclo de vida como dispositivos no gestionados y pueden pasar a ser dispositivos gestionados enviando un mensaje desde un agente de gestión de dispositivos a Internet of Things Foundation. Los dispositivos sin un agente de gestión de dispositivos instalado no pueden convertirse nunca en dispositivos gestionados.
fr: Les **terminaux non gérés** sont des terminaux qui ne comportent pas d'agent de gestion des terminaux. Tous les terminaux commencent leur cycle de vie en tant que terminaux non gérés et peuvent devenir des terminaux gérés lorsqu'ils envoient un message à Internet of Things Foundation via un agent de gestion des terminaux. Les terminaux où il n'y a pas d'agent de gestion des terminaux installé ne peuvent jamais devenir des terminaux gérés.
it: **Dispositivi non gestiti** * sono tutti i dispositivi che non dispongono di un agent di gestione dispositivo. Tutti i dispositivi iniziano il loro ciclo di vita come dispositivi non gestiti e possono passare a dispositivi gestiti inviando un messaggio da un agent di gestione dispositivo a Internet of Things Foundation. I dispositivi senza un agent di gestione dispositivo installato non possono mai diventare dispositivi gestiti.
ja: **非管理対象デバイス**とは、デバイス管理エージェントを持たないデバイスのことです。すべてのデバイスは、非管理対象デバイスとしてライフサイクルを開始し、メッセージをデバイス管理エージェントから Internet of Things Foundation に送信することによって管理対象デバイスに移行できます。デバイス管理エージェントがインストールされていないデバイスを、管理対象デバイスにすることはできません。
ko: **Unmanaged Devices**는 디바이스 관리 에이전트가 없는 디바이스입니다. 모든 디바이스가 비관리 디바이스로 라이프사이클을 시작하고 디바이스 관리 에이전트에서 Internet of Things Foundation까지 메시지를 보내서 관리 디바이스로 전이할 수 있습니다. 디바이스 관리 에이전트가 설치되어 있지 않은 디바이스는 관리 디바이스가 될 수 없습니다.
pt_br: **Dispositivos Não Gerenciados** são todos os dispositivos que não possuem um agente de gerenciamento de dispositivo. Todos os dispositivos iniciam seus ciclos de vida como dispositivos não gerenciados e podem se transformar em dispositivos gerenciados através do envio de uma mensagem de um agente de gerenciamento de dispositivo para o Internet of Things Foundation. Os dispositivos que não possuem um agente de gerenciamento de dispositivo instalado nunca poderão se tornar dispositivos gerenciados.
zh_cn: **非受管设备** 是没有安装设备管理代理程序的设备。在生命周期一开始，所有设备都是非受管设备，并可以通过设备管理代理程序将消息发送到 Internet of Things Foundation 来转换为受管设备。未安装设备管理代理程序的设备绝不可能成为受管设备。
zh_tw: **未受管理的裝置** 是指沒有裝置管理代理程式的任何裝置。所有裝置都會以未受管理的裝置開始其生命週期，且可以從裝置管理代理程式傳送一則訊息給 Internet of Things Foundation，將它轉換成受管理裝置。未安裝裝置管理代理程式的裝置絕對無法成為受管理裝置。

source: Device Model
es: Modelo de dispositivo
fr: Modèle de terminal
it: Modello dispositivo
ja: デバイス・モデル
ko: 디바이스 모델
pt_br: Modelo de Dispositivo
zh_cn: 设备模型
zh_tw: 裝置模型

source: The device model is the combination of device metadata and management characteristics of a device. Devices can contain a lot of metadata, including device identifiers, device type and associated identifiers, and device model extensions. For a list of identifiers, see the device model reference documentation.
es: El modelo de dispositivo es la combinación de los metadatos y las características de gestión de un dispositivo. Los dispositivos pueden contener muchos metadatos, como identificadores de dispositivos, tipo de dispositivo e identificadores asociados, así como extensiones de modelo. Para obtener una lista de identificadores, consulte la documentación de referencia de modelos de dispositivo.
fr: Le modèle de terminal est une combinaison de métadonnées et de caractéristiques de gestion d'un terminal. Les terminaux peuvent comporter de nombreuses métadonnées, notamment des identificateurs de terminaux, un type de terminal et les identificateurs associés, ainsi que des extensions du modèle de terminal. Pour connaître la liste d'identificateurs, reportez-vous à la documentation de référence du modèle de terminal.
it: Il modello dispositivo è una combinazione delle caratteristiche di gestione e metadati di un dispositivo. I dispositivi possono contenere molti metadati, compresi gli identificativi di dispositivo, il tipo di dispositivo e gli identificativi associati e le estensioni del modello di dispositivo. Per un elenco di identificativi, fare riferimento alla documentazione di riferimento del modello di dispositivo.
ja: デバイス・モデルとは、デバイスのメタデータとデバイスの管理特性を組み合わせたものです。デバイスには、デバイス ID、デバイス・タイプ、関連 ID、デバイス・モデル拡張など、多数のメタデータを含めることができます。ID のリストについては、デバイス・モデルの参照資料をご覧ください。
ko: 디바이스 모델은 디바이스의 관리 특성 및 디바이스 메타데이터의 조합입니다. 디바이스에는 디바이스 ID, 디바이스 유형 및 연관된 ID와 디바이스 모델 확장기능을 포함하여 많은 메타데이터가 포함될 수 있습니다. ID의 목록을 보려면 디바이스 모델 참조 문서를 참조하십시오.
pt_br: O modelo de dispositivo é a combinação dos metadados do dispositivo e das características de gerenciamento de um dispositivo. Os dispositivos podem conter vários metadados, incluindo identificadores de dispositivo, tipo de dispositivo e identificadores associados e extensões de modelo de dispositivo. Para obter uma lista de identificadores, consulte a documentação de referência do modelo de dispositivo.
zh_cn: 设备模型是由设备的元数据和管理特征组合而成。设备可以包含大量元数据（包括设备标识、设备类型和相关标识，以及设备模型扩展）。要获取标识列表，请参阅《设备模型参考》文档。
zh_tw: 裝置模型是裝置 meta 資料與裝置管理性質的組合。裝置可以包含許多 meta 資料，包括裝置 ID、裝置類型和關聯的 ID，以及裝置模型延伸規格。如需 ID 的清單，請參閱裝置模型參考文件。

source: Device Management Protocol
es: Protocolo de gestión de dispositivo
fr: Protocoles de gestion des terminaux
it: Protocollo di gestione dispositivo
ja: デバイス管理プロトコル
ko: 디바이스 관리 프로토콜
pt_br: Protocolo de Gerenciamento de Dispositivo
zh_cn: 设备管理协议
zh_tw: 裝置管理通訊協定

source: This protocol is used for device management communication between the Internet of Things Foundation and the management agent on a managed device. The device management protocol is based on MQTT and uses a different set of topics than the regular device messaging protocol. The device management agent of a device must implement the device management protocol in order to enable device management functions.
es: Este protocolo se utiliza para la comunicación de gestión de dispositivos entre Internet of Things Foundation y el agente de gestión en un dispositivo gestionado. El protocolo de gestión de dispositivos se basa en MQTT y utiliza un conjunto de temas distinto al del protocolo ordinario de mensajes de dispositivo. El agente de gestión de dispositivos de un dispositivo debe implementar el protocolo de gestión de dispositivos para habilitar las funciones de gestión de dispositivos.
fr: Ce protocole est utilisé pour établir des communications de gestion des terminaux entre Internet of Things Foundation et l'agent de gestion installé sur un terminal géré. Le protocole de gestion des terminaux s'appuie sur MQTT et utilise un ensemble de sujets différents de celui du protocole de messagerie des terminaux standard. L'agent de gestion d'un terminal doit mettre en oeuvre le protocole de gestion des terminaux pour activer les fonctions de gestion correspondantes.
it: Questo protocollo viene utilizzato per comunicazione di gestione dispositivo tra Internet of Things Foundation e l'agent di gestione su un dispositivo gestito. Il protocollo di gestione dispositivo è basato su MQTT e utilizza un insieme differente di argomenti rispetto al protocollo di messaggistica dispositivo regolare. L'agent di gestione dispositivo di un dispositivo deve implementare il protocollo di gestione dispositivo per abilitare le funzioni di gestione dispositivo.
ja: このプロトコルは、Internet of Things Foundation と管理対象デバイス上の管理エージェントの間のデバイス管理通信に使用されます。デバイス管理プロトコルは MQTT をベースとするプロトコルですが、通常のデバイス・メッセージ・プロトコルとは異なるトピックのセットを使用します。デバイス管理機能を有効にするには、デバイスのデバイス管理エージェントがデバイス管理プロトコルを実装している必要があります。
ko: 이 프로토콜이 관리 디바이스에서 관리 에이전트 및 Internet of Things Foundation 간의 디바이스 관리 통신을 위해 사용됩니다. 디바이스 관리 프로토콜은 MQTT에 기반하고 일반 디바이스 메시징 프로토콜과 다른 주제 세트를 사용합니다. 디바이스의 디바이스 관리 에이전트는 디바이스 관리 기능을 사용으로 설정하도록 디바이스 관리 프로토콜을 구현해야 합니다.
pt_br: Este protocolo é usado para a comunicação de gerenciamento de dispositivos entre o Internet of Things Foundation e o agente de gerenciamento em um dispositivo gerenciado. O protocolo de gerenciamento de dispositivo é baseado em MQTT e usa um conjunto diferente de tópicos do que o protocolo regular de sistema de mensagens do dispositivo. O agente de gerenciamento de dispositivo de um dispositivo deve implementar o protocolo de gerenciamento de dispositivo para ativar as funções de gerenciamento de dispositivos.
zh_cn: 此协议用于 Internet of Things Foundation 与受管设备上的管理代理程序之间的设备管理通信。设备管理协议基于 MQTT，但它使用的主题集不同于普通设备消息传递协议。设备的设备管理代理程序必须实施设备管理协议，才能启用设备管理功能。
zh_tw: 這個通訊協定是用於 Internet of Things Foundation 與受管理裝置上的管理代理程式之間的裝置管理通訊。裝置管理通訊協定是以 MQTT 為基礎，且使用了一組與一般裝置傳訊通訊協定不同的主題。裝置的裝置管理代理程式必須實作裝置管理通訊協定，才能啟用裝置管理功能。

source: Device Identifiers
es: Identificadores de dispositivo
fr: Identificateurs de terminaux
it: Identificativi dispositivo
ja: デバイス ID
ko: 디바이스 ID
pt_br: Identificadores de Dispositivo
zh_cn: 设备标识
zh_tw: 裝置 ID

source: Manufactured devices come with a variety of identifiers, such as model and serial number. Each identifier can be considered a separate namespace, but the combination of identifiers which uniquely identify a specific device is customer dependent and may be very complex.
es: Los dispositivos fabricados se suministran con varios identificadores, como el modelo y el número de serie. Cada identificador se puede considerar un espacio de nombres independiente, pero la combinación de identificadores que identifican de manera exclusiva un dispositivo concreto dependen del cliente y puede ser muy compleja.
fr: Lors de leur fabrication, les terminaux reçoivent un certain nombre d'identificateurs, comme un numéro de modèle et un numéro de série. Chaque identificateur peut être considéré comme un espace de nom distinct mais la combinaison d'identificateurs qui identifient de manière unique un terminal spécifique varie d'un client à l'autre et peut être très complexe.
it: I dispositivo di fabbrica sono forniti con vari identificativi, come modello e numero di serie. Ogni identificativo può essere considerato uno spazio dei nomi separato, ma la combinazione di identificativi che identificano univocamente un dispositivo specifico dipende dal cliente e può essere molto complessa.
ja: 製造デバイスには、モデル番号やシリアル番号などのさまざまな ID があります。各 ID は、個別の名前空間と見なせますが、特定のデバイスを一意に識別する ID の組み合わせは顧客によって異なり、非常に複雑になる場合があります。
ko: 제조된 디바이스는 모델 및 일련 번호 등의 여러 ID와 함께 제공됩니다. 각 ID는 별도의 네임스페이스로 간주될 수 있지만, 특정 디바이스를 고유하게 식별하는 ID의 조합이 고객에 따라 다르고 매우 복잡할 수 있습니다.
pt_br: Os dispositivos fabricados são fornecidos com diversos identificadores, como modelo e número de série. Cada identificador pode ser considerado um namespace separado, mas a combinação de identificadores que identificam de forma exclusiva um dispositivo específico depende do cliente e pode ser muito complexa.
zh_cn: 制造的设备都会随附各种标识，如型号和序列号。每个标识可视为一个单独的名称空间，但是用于唯一标识特定设备的标识组合与客户有关，而且可能非常复杂。
zh_tw: 製造的裝置附有各種 ID，如：型號及序號。每一個 ID 都可以視為個別的名稱空間，但能夠唯一識別特定裝置的 ID 組合與客戶有關，且可能非常複雜。
