Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/device_mgmt.po
Languages: es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: In order to accommodate this complexity, the device management standards have defined many types of identifier, and these are represented in the core device model. See the Device Model Attributes reference document for more detailed information on device identifiers and attributes.
es: Para adaptarse a esta complejidad, los estándares de gestión de dispositivos han definido muchos tipos de identificador y estos están representados en el modelo básico de dispositivo. Consulte el documento Referencia de atributos de modelo de dispositivo para obtener más información sobre los identificadores y atributos de dispositivo.
fr: Pour prendre en charge cette complexité, les normes de gestion des terminaux ont défini de nombreux types d'identificateur qui sont représentés dans le modèle de terminal de base. Pour plus d'informations sur les identificateurs et les attributs d'un terminal, reportez-vous au document de référence consacré aux attributs du modèle de terminal.
it: Per risolvere questa complessità, gli standard di gestione dispositivo hanno definito molti tipi di identificativo e questi sono rappresentati nel modello di dispositivo principale. Consultare il documento di riferimento Attributi modello dispositivo per informazioni più dettagliate sugli attributi e identificativi del dispositivo.
ja: この複雑さを解消するために、デバイス管理の規格では多数の ID が定義されており、中核となるデバイス・モデルで表されています。デバイスの ID および属性について詳しくは、「デバイス・モデル属性」の参照資料をご覧ください。
ko: 이 복잡도를 수용하기 위해 디바이스 관리 표준이 여러 유형의 ID를 정의했고 이는 코어 디바이스 모델에 나타납니다. 디바이스 ID 및 속성에 대한 자세한 정보는 디바이스 모델 속성 참조 문서를 참조하십시오.
pt_br: Para acomodar essa complexidade, os padrões de gerenciamento de dispositivos definiram muitos tipos de identificadores, que são representados no modelo de dispositivo principal. Consulte o documento de referência Atributos do Modelo de Dispositivo para obter informações mais detalhadas sobre identificadores de dispositivos e atributos.
zh_cn: 为了适应这种复杂性，设备管理标准定义了多种类型的标识，并且在核心设备模型中表示了这些标识类型。请参阅《设备模型属性参考》文档，以了解有关设备标识和属性的更多详细信息。
zh_tw: 為了納入此複雜性，裝置管理標準定義了多種類型的 ID，這些 ID 都會顯示在核心裝置模型中。請參閱「裝置模型屬性」參考文件，以取得更詳細的裝置 ID 與屬性資訊。

source: Management Agent
es: Agente de gestión
fr: Agent de gestion
it: Agent di gestione
ja: 管理エージェント
ko: 관리 에이전트
pt_br: Agente de Gerenciamento
zh_cn: 管理代理程序
zh_tw: 管理代理程式

source: A management agent is a collection of logic installed on a device which allows it to connect to the Internet of Things Foundation service as a managed device. The management agent understands the metadata and device management commands used in the device management messaging protocol. Without a management agent, devices cannot use the device management messaging protocol and so cannot become managed devices.
es: Un agente de gestión es una colección de lógica instalada en un dispositivo que permite conectarse al servicio Internet of Things Foundation como un dispositivo gestionado. El agente de gestión comprende los metadatos y mandatos de gestión de dispositivos que se utilizan en el protocolo de mensajería de gestión de dispositivos. Sin un agente de gestión, los agentes de gestión no podrán utilizar el protocolo de mensajes de gestión de dispositivos y, por lo tanto, no podrán convertirse en dispositivos gestionados.
fr: Un agent de gestion est un bloc de logique installé sur un terminal pour lui permettre de se connecter au service Internet of Things Foundation en tant que terminal géré. L'agent de gestion comprend les métadonnées et les commandes de gestion des terminaux utilisées dans le protocole de messagerie de gestion des terminaux. Sans agent de gestion, les terminaux ne peuvent pas utiliser le protocole de messagerie des terminaux et ne peuvent donc pas devenir des terminaux gérés.
it: Un agent di gestione è una raccolta di logica installata su un dispositivo che consente di connettersi al servizio Internet of Things Foundation come un dispositivo gestito. L'agent di gestione comprende i metadati e i comandi di gestione dispositivo utilizzati nel protocollo di messaggistica di gestione dispositivo. Senza un agent di gestione, i dispositivi non possono utilizzare il protocollo di messaggistica di gestione dispositivo e quindi non possono diventare dispositivi gestiti.
ja: 管理エージェントは、管理対象デバイスとして Internet of Things Foundation サービスに接続するための、デバイス上にインストールされたロジックの集合です。管理エージェントは、デバイス管理メッセージ・プロトコルで使用されるメタデータおよびデバイス管理コマンドを理解します。管理エージェントがなければ、デバイスはデバイス管理メッセージ・プロトコルを使用できないため、管理対象デバイスになることはできません。
ko: 관리 에이전트는 관리 디바이스로 Internet of Things Foundation 서비스에 연결하도록 허용하는 디바이스에 설치된 로직의 콜렉션입니다. 관리 에이전트는 디바이스 관리 메시징 프로토콜에서 사용되는 메타데이터 및 디바이스 관리 명령에 대해 파악하고 있습니다. 관리 에이전트가 없으면 디바이스가 디바이스 관리 메시징 프로토콜을 사용할 수 없고 관리 디바이스가 될 수 없습니다.
pt_br: Um agente de gerenciamento é uma coleção de lógica instalada em um dispositivo que permite que ele se conecte ao serviço do Internet of Things Foundation como um dispositivo gerenciado. O agente de gerenciamento entende os metadados e os comandos de gerenciamento de dispositivo usados no protocolo de sistema de mensagens de gerenciamento de dispositivos. Sem um agente de gerenciamento, os dispositivos não podem usar o protocolo de sistema de mensagens de gerenciamento de dispositivos e, portanto, não podem se tornar dispositivos gerenciados.
zh_cn: 管理代理程序是安装在设备上的一组逻辑，可将设备作为受管设备连接到 Internet of Things Foundation 服务。管理代理程序将理解设备管理消息传递协议中使用的元数据和设备管理命令。如果没有管理代理程序，设备将无法使用设备管理消息传递协议，因此也无法成为受管设备。
zh_tw: 管理代理程式是安裝在裝置上的邏輯集合，它可讓裝置連接至 Internet of Things Foundation 服務作為受管理裝置。管理代理程式瞭解裝置管理傳訊通訊協定中使用的 meta 資料及裝置管理指令。如果沒有管理代理程式，裝置就無法使用裝置管理傳訊通訊協定，因此無法成為受管理裝置。

source: The Device Management Lifecycle
es: Ciclo de vida de gestión de dispositivos
fr: Cycle de vie de la gestion des terminaux
it: Il ciclo di vita di Gestione dispositivo
ja: デバイス管理ライフサイクル
ko: 디바이스 관리 라이프사이클
pt_br: O Ciclo de Vida de Gerenciamento do Dispositivo
zh_cn: 设备管理生命周期
zh_tw: 裝置管理生命週期

source: A device and its associated device type are created in the Internet of Things Foundation using the dashboard or REST API.
es: Se crean un dispositivo y su tipo de dispositivo asociado en Internet of Things Foundation mediante el panel de control y la API REST.
fr: Un terminal et le type de terminal associé sont créés dans Internet of Things Foundation à l'aide du tableau de bord ou de l'API REST.
it: Un dispositivo e il relativo tipo di dispositivo associato sono creati in Internet of Things Foundation utilizzando il dashboard o l'API REST.
ja: デバイスおよびそれに関連したデバイス・タイプは、ダッシュボードまたは REST API を使用して Internet of Things Foundation に作成されます。
ko: 디바이스 및 연관된 디바이스 유형이 대시보드 또는 REST API를 통해 Internet of Things Foundation에 작성됩니다.
pt_br: O dispositivo e seu tipo de dispositivo associado são criados no Internet of Things Foundation usando o painel ou a API REST.
zh_cn: 在 Internet of Things Foundation 中使用仪表板或 REST API 创建设备及相关设备类型。
zh_tw: 裝置及其關聯的裝置類型會使用儀表板或 REST API 建立在 Internet of Things Foundation 中。

source: The device connects to the Internet of Things Foundation and uses the 'Manage Device' operation to become a managed device.
es: El dispositivo se conecta a Internet of Things Foundation y utiliza la operación 'Manage Device' para convertirse en un dispositivo gestionado.
fr: Le terminal se connecte à Internet of Things Foundation et utilise l'opération 'Gérer le terminal' pour devenir un terminal géré.
it: Il dispositivo si connette a Internet of Things Foundation e utilizza l'operazione 'Gestisci dispositivo' per diventare un dispositivo gestito.
ja: デバイスは Internet of Things Foundation に接続し、「デバイスを管理」操作によって管理対象デバイスになります。
ko: 디바이스가 Internet of Things Foundation에 연결하고 관리 디바이스가 되도록 '디바이스 관리' 오퍼레이션을 사용합니다.
pt_br: O dispositivo se conecta ao Internet of Things Foundation e usa a operação 'Gerenciar Dispositivo' para se tornar um dispositivo gerenciado.
zh_cn: 设备必须连接到 Internet of Things Foundation 并使用“管理设备”操作，才能成为受管设备。
zh_tw: 裝置會連接至 Internet of Things Foundation，並使用「管理裝置」作業成為受管理裝置。

source: The device's metadata, as described in the Device Model can now be viewed and manipulated through device operations, for example, firmware update and device reboot.
es: Los metadatos del dispositivo, como se describe en el modelo de dispositivo, ahora se pueden ver y manipular mediante las operaciones de dispositivo, por ejemplo, la actualización de firmware y el reinicio del dispositivo.
fr: Les métadonnées du terminal, telles qu'elles sont décrites dans le modèle de terminal, peuvent désormais être affichées et manipulées via l'exécution d'opérations sur le terminal, par exemple la mise à jour du microprogramme et le réamorçage du terminal.
it: I metadati del dispositivo, come descritto nel Modello dispositivo, possono essere ora visualizzati e manipolati attraverso operazioni dispositivo, ad esempio, l'aggiornamento firmware e il riavvio dispositivo.
ja: これで、「デバイス・モデル」で説明したようなデバイスのメタデータを表示し、ファームウェアの更新やデバイスのリブートなどのデバイス操作によって操作できるようになりました。
ko: 디바이스 모델에 설명된 대로 이제 디바이스의 메타데이터를 펌웨어 업데이트 및 디바이스 다시 부팅 등의 디바이스 오퍼레이션을 통해 보고 조작할 수 있습니다.
pt_br: Os metadados do dispositivo, conforme descrito no Modelo de Dispositivo, agora podem ser visualizados e manipulados por meio de operações de dispositivo, por exemplo, a atualização de firmware e a reinicialização do dispositivo.
zh_cn: 现在，可以通过设备操作（例如，固件更新和设备重新引导）来查看和操纵设备的元数据（如设备模型中所述）。
zh_tw: 如「裝置模型」中所述，裝置的 meta 資料現在可以透過裝置作業（例如，韌體更新及裝置重新開機）來檢視及操作。

source: The device can communicate updates through the device-management protocol, such as location or diagnostic information and error codes.
es: El dispositivo puede comunicar actualizaciones mediante el protocolo de gestión de dispositivos, por ejemplo, información de la ubicación o de diagnóstico y códigos de error.
fr: Le terminal peut transmettre des mises à jour via le protocole de gestion des terminaux, comme des informations d'emplacement ou de diagnostic ou des codes d'erreur.
it: Il dispositivo può comunicare aggiornamenti tramite il protocollo di gestione dispositivo, come l'ubicazione o informazioni di diagnostica e codici di errore.
ja: デバイスは、ロケーション、診断情報、エラー・コードなどの更新をデバイス管理プロトコルを介して伝達できます。
ko: 디바이스가 위치 또는 진단 정보와 오류 코드 등의 디바이스 관리 프로토콜을 통해 업데이트를 통신할 수 있습니다.
pt_br: O dispositivo pode comunicar atualizações por meio do protocolo de gerenciamento de dispositivo, como informações de local ou de diagnóstico e códigos de erro.
zh_cn: 设备可以通过设备管理协议来传达更新（例如，位置或诊断信息，以及错误代码）。
zh_tw: 裝置可以透過裝置管理通訊協定來傳遞更新項目，如：位置或診斷資訊，以及錯誤碼。

source: In order to provice a way to deal with defunct devices in large device populations, the 'Manage device' operation request has an optional lifetime parameter. This lifetime parameter is the number of seconds within which the device must make another 'Manage device' request in order to avoid being marked as dormant and becoming an unmanaged device.
es: Con el fin de proporcionar una forma de manejar los dispositivos inactivos en las poblaciones de dispositivos grandes, la solicitud de una operación 'Manage device' tiene un parámetro de tiempo de vida opcional. Este parámetro de tiempo de vida es el número de segundos durante el cual el dispositivo debe enviar otra solicitud 'Manage device' para evitar que se marque como inactivo y convertirse en un dispositivo no gestionado.
fr: Pour prendre en charge les terminaux obsolètes dans des parcs de terminaux volumineux, la demande de l'opération 'Gérer le terminal' inclut un paramètre de durée de vie (lifetime) facultatif. Ce paramètre correspond au nombre de secondes au cours desquelles le terminal doit effectuer une autre demande 'Gérer le terminal' pour éviter d'être considéré comme un terminal en veille et devenir un terminal non géré.
it: Al fine di fornire un modo per gestire i dispositivi inattivi in vaste popolazione di dispositivi, la richiesta dell'operazione 'Gestisci dispositivo' ha un parametro di durata facoltativo. Questo parametro di durata è il numero di secondi entro il quale il dispositivo deve effettuare un'altra richiesta 'Gestisci dispositivo' per evitare di essere contrassegnato come inattivo e diventare un dispositivo non gestito.
ja: デバイスが大量に存在する環境で機能不良デバイスに対処できるように、「デバイスを管理」操作リクエストにはオプションのライフタイム・パラメーターが用意されています。このライフタイム・パラメーターは、休止のマークが付けられて非管理対象デバイスにならないように、デバイスが次の「デバイスを管理」リクエストを行わなければならない制限時間 (秒) です。
ko: 다수의 디바이스에서 존재하지 않는 디바이스를 처리하는 방법을 제공하기 위해 '디바이스 관리' 오퍼레이션 요청에 선택적 영구 매개변수가 있습니다. 이 영구 매개변수는 휴지 상태로 표시되어 관리 해제된 디바이스가 되지 않도록 디바이스가 다른 '디바이스 관리' 요청을 작성해야 하는 제한시간(초)입니다.
pt_br: A fim de fornecer um meio de lidar com dispositivos inativos em grandes populações de dispositivos, a solicitação da operação 'Gerenciar dispositivo' possui um parâmetro de tempo de vida opcional. Esse parâmetro de tempo de vida é o período, em segundos, no qual o dispositivo deve fazer outra solicitação 'Gerenciar dispositivo' para evitar ser marcado como inativo e tornar-se um dispositivo não gerenciado.
zh_cn: 为了能够在设备众多的情况下处理失效的设备，“管理设备”操作请求中提供了一个可选的生命周期参数。此生命周期参数包含的是一个秒数，设备必须在这段时间内发出另一个“管理设备”请求，才能避免被标记为停止而成为非受管设备。
zh_tw: 為了提供一種方式來處理大量裝置群中已廢止的裝置，「管理裝置」作業要求有一個選用的生命期限參數。這個生命期限參數是裝置必須在此期間內產生另一個「管理裝置」要求，以避免被標示為休眠並成為未受管理裝置的秒數。

source: When a device is decommissioned it can be removed from the Internet of Things Foundation using the dashboard or REST API.
es: Cuando un dispositivo está fuera de servicio se puede eliminar de Internet of Things Foundation mediante el panel de control o la API REST.
fr: Lorsqu'un terminal n'est plus utilisé, il peut être supprimé d'Internet of Things Foundation à l'aide du tableau de bord ou de l'API REST.
it: Quando un dispositivo viene decommissionato può essere rimosso da Internet of Things Foundation utilizzando il dashboard o l'API REST.
ja: 使用廃止にしたデバイスは、ダッシュボードまたは REST API を使用して Internet of Things Foundation から削除できます。
ko: 디바이스가 권한 해제되면 대시보드 또는 REST API를 통해 Internet of Things Foundation에서 제거할 수 있습니다.
pt_br: Quando um dispositivo é desatribuído, ele pode ser removido do Internet of Things Foundation usando o painel ou a API REST.
zh_cn: 设备退役后，可以使用仪表板或 REST API 从 Internet of Things Foundation 中移除该设备。
zh_tw: 當裝置解除任務時，即可使用儀表板或 REST API 從 Internet of Things Foundation 中移除。
