Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/security.po
Languages: fr

source: Securing the Internet of Things
fr: Sécurisation de l'internet des objets

source: The IBM Internet of Things Foundation (IoT Foundation) is a fully managed, cloud-hosted service that makes it simple to derive value from Internet of Things (IoT) devices.
fr: IBM Internet of Things Foundation (IoT Foundation) est un service intégralement géré, hébergé dans des clouds, qui permet de tirer facilement parti des terminaux IoT (internet des objets).

source: The following document aims to answer common questions about how your organization's data is protected. Focusing on specific areas:
fr: Le document ci-après vise à répondre aux questions les plus fréquemment posées sur le mode de protection des données de votre organisation en s'intéressant aux domaines suivants :

source: Authentication: assuring the identity of users, devices or applications attempting to access your organization's information.
fr: Authentification : Vérifier l'identité des utilisateurs, des terminaux ou des applications qui tentent d'accéder aux informations de l'organisation.

source: Authorization: assuring that users, devices and applications have permission to access your organization's information.
fr: Autorisation : Vérifier que les utilisateurs, les terminaux et les applications sont autorisés à accéder aux informations de l'organisation.

source: Encryption: assuring that data is only readable by authorized parties and cannot be intercepted.
fr: Chiffrement : Vérifier que les données peuvent être lues uniquement par les parties autorisées et ne peuvent pas être interceptées.

source: Terminology
fr: Terminologie

source: How do we secure management of your organization?
fr: Comment sécurisons-nous la gestion de votre organisation ?

source: The browser-based GUI and REST APIs are fronted by HTTPS, with a certificate signed by DigiCert enabling you to trust that you're connecting to the genuine IoT Foundation.
fr: L'interface graphique du navigateur et les API REST sont protégées par HTTPS, avec un certificat signé par DigiCert pour s'assurer que vous vous connectez réellement au service IoT Foundation habilité.

source: GUI: authenticated via your IBM ID.
fr: Interface graphique utilisateur : Authentification via votre ID IBM.

source: REST API: once you create an API key through the GUI, you can use this to make authenticated REST calls against your organization.
fr: API REST : Une fois que vous avez créé une clé d'API dans l'interface graphique, vous pouvez l'utiliser pour effectuer des appels REST authentifiés destinés à votre organisation.

source: How do we secure your device and application credentials?
fr: Comment sécurisons-nous les données d'identification de votre terminal ou de votre application ?

source: When devices are registered or API keys are generated, the authentication token is salted and hashed. This means your organization's credentials can never be recovered from our systems - even in the unlikely event that the IoT Foundation is compromised.
fr: Lors de l'enregistrement des terminaux ou de la génération des clés d'API, le jeton d'authentification est soumis à une opération de hachage et de salage. Cela signifie que les données d'identification de l'organisation ne peuvent jamais être récupérées sur nos systèmes, même dans le cas peu probable d'un piratage du service IoT Foundation.

source: Device credentials and API keys can be individually revoked if they are compromised.
fr: Les données d'identification et les clés d'API des terminaux peuvent être révoquées individuellement si elles sont compromises.

source: How do we ensure your devices connect securely to the IoT Foundation?
fr: Comment vérifions-nous que vos terminaux se connectent en toute sécurité à IoT Foundation ?

source: Devices connect through a unique combination of clientId and authentication token that only you know.
fr: Les terminaux se connectent à l'aide de la combinaison unique d'un ID client (clientId) et d'un jeton d'authentification que vous êtes seul à connaître.

source: Full support for connectivity over TLS (v1.2) is provided.
fr: La prise en charge totale de la connectivité sur TLS (version 1.2) est assurée.

source: Open standards are used (MQTT v3.1.1) to allow easy interop across many platforms and languages.
fr: Des normes ouvertes sont utilisées (MQTT version 3.1.1) pour faciliter l'interopérabilité de plateformes et de langages différents.

source: How do we prevent data leaking between devices?
fr: Comment évitons-nous la fuite des données entre des terminaux ?

source: Secure messaging patterns are baked in. Once authenticated, devices are only authorized to publish and subscribe to a restricted topic space:
fr: Les structures de messagerie sécurisée sont intégrées. Une fois authentifiés, les terminaux sont autorisés uniquement à publier des données et à s'abonner à un espace de sujet limité :

source: All devices work with the same topic space. The authentication credentials provided by the client connecting dictate to which device this topic space will be scoped by the IoT Foundation. This prevents devices from being able to impersonate another device.
fr: Tous les terminaux fonctionnent avec le même espace de sujet. Les données d'authentification fournies par le client qui se connecte déterminent le terminal auquel IoT Foundation affecte cet espace de sujet. Ce mécanisme permet d'empêcher les terminaux de simuler les droits d'accès d'un autre terminal.

source: The only way to impersonate another device is by obtaining compromised security credentials for the device.
fr: Le seul moyen de simuler les droits d'accès d'un autre terminal est d'obtenir les données d'identification de sécurité compromises du terminal.

source: Applications can subscribe and publish on both the event and command topics for all devices in the organization. Applications can analyse data from many devices simultaneously, and can also simulate or proxy devices in addition to forming the complementary side of a full duplex communication loop.
fr: Les applications peuvent s'abonner et publier des données dans les sujets d'événement et de commande de tous les terminaux de l'organisation. Elles peuvent analyser simultanément les données de nombreux terminaux et simuler ou représenter des terminaux, en plus de la formation de la partie complémentaire de la boucle de communication en mode duplex intégral.

source: How do we prevent data leaking between organizations?
fr: Comment évitons-nous la fuite des données entre des organisations ?

source: The topic space in which devices and applications operate is scoped within a single organization. When authenticated, the IoT Foundation transforms the topic structure using an organization ID based on the client authentication, making it impossible for data from one organization to be accessed from another.
fr: L'espace de sujet dans lequel les terminaux et les applications fonctionnent est défini au sein d'une organisation unique. Une fois l'authentification effectuée, IoT Foundation transforme la structure du sujet à l'aide d'un ID organisation provenant de l'authentification du client. Ce mécanisme rend impossible l'accès aux données d'une organisation à partir d'une autre organisation.
