Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/dashboard.po
Languages: es, fr, ko

source: Connecting and Using a Gateway Device using the IoT Platform Dashboard
es: Conexión y utilización de un dispositivo de pasarela utilizando el panel de control de IoT Platform
fr: Connexion et utilisation d'un terminal de passerelle avec le tableau de bord IoT Platform
ko: IoT Platform 대시보드를 사용하여 게이트웨이 디바이스 연결 및 사용

source: This task describes the process of connecting a gateway device, which connects itself, and devices behind the gateway, and sends data from itself and devices behind it to the IoT Platform.
es: Esta tarea describe el proceso de conexión de un dispositivo de pasarela, que se conecta a sí mismo y a los dispositivos detrás de la pasarela y envía a IoT Platform los datos propios y de los dispositivos que están detrás.
fr: Cette tâche décrit le processus de connexion d'un terminal de passerelle qui se connecte lui-même ainsi que les terminaux situés derrière la passerelle, et qui envoie ses données ainsi que des données depuis les terminaux à IoT Platform.
ko: 이 태스크는 게이트웨이 디바이스 연결 프로세스, 즉 디바이스 자체와 게이트웨이 뒤에 있는 디바이스를 연결한 다음 데이터를 해당 디바이스와 게이트웨이 뒤에 있는 디바이스에서 IoT Platform으로 전송하는 프로세스에 대해 설명합니다.

source: Gateways can also subscribe to commands on behalf of devices connected to the gateway.
es: Las pasarelas también se pueden suscribir a los mandatos en nombre de los dispositivos conectados a la pasarela.
fr: Une passerelle peut également s'abonner à des commandes pour le compte des terminaux qui lui sont connectés.
ko: 게이트웨이는 게이트웨이에 연결된 디바이스를 대신하여 명령을 구독할 수도 있습니다.

source: Prerequisites
es: Requisitos previos
fr: Conditions préalables
ko: 전제조건

source: This task assumes that you already have an IoT Platform organization.
es: Esta tarea supone que ya tiene una organización de IoT Platform.
fr: Cette tâche suppose que vous disposez déjà d'une organisation IoT Platform.
ko: 이 태스크는 사용자에게 이미 IoT Platform 조직이 있다고 가정합니다.

source: Procedure
es: Procedimiento
fr: Procédure
ko: 절차

source: Creating a device type for your gateway: A gateway has more rights than a normal device, and can send and receive device data on behalf of other devices.
es: Creación de un tipo de dispositivo para la pasarela: Una pasarela tiene más derechos que un dispositivo normal y puede enviar y recibir datos de dispositivo en nombre de otros dispositivos.
fr: Création d'un type de terminal pour votre passerelle : une passerelle dispose de davantage de droits qu'un terminal standard, et peut envoyer et recevoir des données de terminal pour le compte d'autres terminaux.
ko: 게이트웨이에 대한 디바이스 유형 작성: 게이트웨이는 일반 디바이스보다 더 많은 권한을 가지며, 다른 디바이스를 대신하여 디바이스 데이터를 전송하고 수신할 수 있습니다.

source: In your organization dashboard 'Devices' tab, select the 'Device Types' sub-tab. Click 'Create Type'. Click 'Create gateway type', and follow the instructions in the flow, including adding any device properties and metadata. Click 'Create' to complete the flow and create the device type.
es: En el separador 'Dispositivos' del panel de control de la organización, seleccione el subseparador 'Tipos de dispositivo'. Pulse 'Crear tipo'. Pulse 'Crear tipo de pasarela' y siga las instrucciones del flujo, incluida la adición de propiedades de dispositivo y metadatos. Pulse 'Crear' para completar el flujo y crear el tipo de dispositivo.
fr: Dans l'onglet 'Terminaux' du tableau de bord de votre organisation, sélectionnez le sous-onglet 'Types de terminaux'. Cliquez sur 'Créer un type'. Cliquez sur 'Créer un type de passerelle' et suivez les instructions du flux ; ajoutez notamment les métadonnées et les propriétés de terminal nécessaires. Cliquez sur 'Créer' pour terminer le flux et créer le type de terminal.
ko: 조직 대시보드 '디바이스' 탭에서 '디바이스 유형' 하위 탭을 선택하고 '유형 작성'을 클릭하십시오. '게이트웨이 유형 작성'을 클릭하고 디바이스 특성 및 메타데이터 추가를 비롯한 플로우의 지시사항을 따르십시오. '작성'을 클릭하여 플로우를 완료하고 디바이스 유형을 작성하십시오.

source: To create a gateway device:
es: Para crear un dispositivo de pasarela:
fr: Pour créer un terminal de passerelle :
ko: 게이트웨이 디바이스 작성:

source: In your organization dashboard 'Devices' tab, select the 'Browse' sub-tab and click 'Add device'. Select the gateway device type created in the previous step. Follow the 'Add device' flow, entering the mandatory *deviceId* property, and any other optional properties.
es: En el separador 'Dispositivos' del panel de control de la organización, seleccione el subseparador 'Examinar' y pulse 'Añadir dispositivo'. Seleccione el tipo de dispositivo de pasarela creado en el paso anterior. Siga el flujo de 'Añadir dispositivo', entrando la propiedad *deviceId* obligatoria y otras propiedades opcionales.
fr: Dans l'onglet 'Terminaux' du tableau de bord de votre organisation, sélectionnez le sous-onglet 'Parcourir' et cliquez sur 'Ajouter un terminal'. Sélectionnez le type de terminal de passerelle créé à l'étape précédente. Suivez le flux 'Ajouter un terminal' en entrant la propriété *deviceId* obligatoire et d'autres propriétés facultatives.
ko: 조직 대시보드 '디바이스' 탭에서 '찾아보기' 하위 탭을 선택하고 '디바이스 추가'를 클릭하십시오. 이전 단계에서 작성한 게이트웨이 디바이스 유형을 선택하십시오. '디바이스 추가' 플로우에 따라 필수 특성인 *deviceId* 및 기타 선택적 특성을 입력하십시오.

source: After creating a gateway device, the authentication token provided should be saved for use in configuring the gateway to connect to the IoT Platform.
es: Después de crear un dispositivo de pasarela, se debe guardar la señal de autenticación proporcionada para utilizarla en la configuración de la pasarela para conectarse a IoT Platform.
fr: Une fois le terminal de passerelle créé, vous devez sauvegarder le jeton d'authentification fourni pour la configuration de la passerelle en vue de sa connexion à IoT Platform.
ko: 게이트웨이 디바이스를 작성한 후에는 게이트웨이가 IoT Platform에 연결되도록 구성하는 데 사용할 수 있도록 인증 토큰이 저장되어야 합니다.

source: Connecting the gateway to the IoT Platform.
es: Conexión de la pasarela a IoT Platform.
fr: Connexion de la passerelle à IoT Platform
ko: IoT Platform에 게이트웨이 연결

source: There are a range of recipes available for connecting devices to the IoT Platform platform. Connecting a gateway requires the same steps as connecting a normal device with one exception. When connecting a normal device, the clientId uses the following format:
es: Existe un rango de recetas disponibles para conectar dispositivos a IoT Platform. Para conectar una pasarela es necesario realizar los mismos pasos que para conectar un dispositivo normal, con una excepción: al conectar un dispositivo normal, el ID de cliente utiliza el formato siguiente:
fr: Plusieurs recettes sont disponibles pour connecter des terminaux à IoT Platform. Pour connecter une passerelle, vous devez effectuer les mêmes opérations que pour la connexion d'un terminal standard, à une exception près. Lorsque vous connectez un terminal standard, l'ID client est au format suivant :
ko: 디바이스를 IoT Platform 플랫폼에 연결할 수 있는 방법은 다양합니다. 게이트웨이를 연결하려면 일반 디바이스를 연결할 때와 동일한 단계를 수행해야 합니다. 이때, 한 가지 점만 다릅니다. 일반 디바이스를 연결하는 경우 clientId는 다음 형식을 사용합니다.

source: ``d:<orgId>:<typeId>:<deviceId>``
es: ``d:<IdOrg>:<IdTipo>:<IdDispositivo>``

source: When connecting a gateway device, the clientId replaces ``d`` with ``g``:
es: Al conectar un dispositivo de pasarela, el ID de cliente sustituye ``d`` por ``g``:
fr: Lorsque vous connectez un terminal de passerelle, ``d`` est remplacé par ``g`` dans l'ID client :
ko: 게이트웨이 디바이스를 연결할 때 clientId는 ``d``를 ``g``로 대체합니다.

source: ``g:<orgId>:<typeId>:<deviceId>``
es: ``g:<IdOrg>:<IdTipo>:<IdDispositivo>``

source: Set up devices that are connected to the gateway and are to be connected to the IoT Platform:
es: Configurar dispositivos que están conectados a la pasarela y se deben conectar a IoT Platform:
fr: Configurez les terminaux qui sont connectés à la passerelle et qui doivent être connectés à IoT Platform :
ko: 게이트웨이에 연결되어 있고 IoT Platform에 연결될 디바이스를 설정하십시오.

source: Create a device type for the device or devices which are to connect through the gateway. The devices should have *gatewayId* and *gatewayTypeId* properties matching the *deviceId* and *deviceTypeId* of the gateway they are connecting through. Add the devices which are connected to the gateway to the IoT Platform.
es: Cree un tipo de dispositivo para el dispositivo o los dispositivos que se deben conectar a través de la pasarela. Los dispositivos deben tener propiedades *gatewayId* y *gatewayTypeId* que coincidan con las propiedades *deviceId* y *deviceTypeId* de la pasarela a la través de la cual se están conectando. Añada a IoT Platform los dispositivos que están conectados a la pasarela.
fr: Créez un type de terminal pour le terminal ou les terminaux devant être connectés via la passerelle. Les propriétés *gatewayId* et *gatewayTypeId* des terminaux doivent correspondre aux propriétés *deviceId* et *deviceTypeId* de la passerelle via laquelle ils se connectent. Ajoutez les terminaux qui sont connectés à la passerelle à IoT Platform.
ko: 게이트웨이를 통해 연결할 디바이스의 디바이스 유형을 작성하십시오. 디바이스의 *gatewayId* 및 *gatewayTypeId* 특성은 디바이스를 연결할 때 사용될 게이트웨이의 *deviceId* 및 *deviceTypeId*와 일치해야 합니다. 게이트웨이에 연결된 디바이스를 IoT Platform에 추가하십시오.

source: The devices connected to the gateway should now be visible in your IoT Platform organization dashboard.
es: Ahora los dispositivos conectados a la pasarela deben estar visibles en el panel de control de organización de IoT Platform.
fr: A présent, les terminaux connectés à la passerelle devraient s'afficher dans le tableau de bord de votre organisation IoT Platform.
ko: 게이트웨이에 연결된 디바이스가 IoT Platform 조직 대시보드에 표시되어야 합니다.
