Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java.po
Languages: es, fr, ko

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-gateway-to-watson-iot-platform/>`__ that explains how to connect your Gateway and devices behind the Gateway to IBM Watson Internet of Things Platform with the sample present in this github project.
es: Consulte `la receta <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-gateway-to-watson-iot-platform/>`__ que explica cómo conectar la pasarela y los dispositivos que hay tras dicha pasarela a IBM Watson Internet of Things Platform con el objeto presente en este proyecto github.

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ that explains how to connect your Gateway as managed device in IBM Watson Internet of Things Platform and perform one or more device management operations.
es: Consulte `la receta <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ que explica cómo conectar la pasarela como un dispositivo gestionado en IBM Watson Internet of Things Platform y realizar una o más operaciones de gestión de dispositivos.

source: Constructor
fr: Constructeur
ko: 생성자

source: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/gateway/SampleRasPiGateway.java>`__ - A Gateway sample that shows how to connect Raspberry Pi as Gateway. This sample is explained in detail in `this recipe <https://developer.ibm.com/recipes/?post_type=tutorials&p=9397>`__.
fr: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/gateway/SampleRasPiGateway.java>`__ - Exemple de passerelle qui montre comment connecter Raspberry Pi en tant que passerelle. Il est expliqué en détail dans `cette recette <https://developer.ibm.com/recipes/?post_type=tutorials&p=9397>`__.
ko: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/gateway/SampleRasPiGateway.java>`__ - Raspberry Pi를 게이트웨이로 연결하는 방법을 보여주는 게이트웨이 샘플입니다. 이 샘플은 `이 지침서 <https://developer.ibm.com/recipes/?post_type=tutorials&p=9397>`__에 자세히 설명되어 있습니다.
