Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java_managedgateway.po
Languages: es, fr, ko

source: As shown, this method accepts the details of the attached device apart from the lifetime and device/firmware support parameters. The gateway can also use the overloaded sendDeviceManageRequest() method to specify the DeviceData for the attached device.
es: Como se muestra, este método acepta los detalles del dispositivo conectado, además de los parámetros de tiempo de vida y de soporte de dispositivos/firmware. La pasarela también puede utilizar el método sendDeviceManageRequest() sobrecargado para especificar el objeto DeviceData para el dispositivo conectado.
fr: Comme indiqué, cette méthode accepte les détails du terminal connecté, hormis les paramètres de durée de vie et de prise en charge de terminal/microprogramme. La passerelle peut aussi utiliser la méthode sendDeviceManageRequest() surchargée afin de spécifier l'objet DeviceData pour le terminal connecté.
ko: 표시된 대로, 이 메소드는 lifetime 및 device/firmware 지원 매개변수와 별도로 접속된 디바이스의 세부사항을 허용합니다. 또한 게이트웨이는 오버로드된 sendDeviceManageRequest() 메소드를 사용하여 접속된 디바이스에 대한 DeviceData를 지정할 수 있습니다.

source: Refer to the `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/manage-device#manage-device>`__ for more information about the manage operation.
es: Consulte la `documentación <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/manage-device#manage-device>`__ para obtener más información sobre la operación de gestión.
fr: Voir la `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/manage-device#manage-device>`__ pour plus d'informations sur l'opération de gestion.
ko: 관리 오퍼레이션에 대한 자세한 정보는 `문서 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/manage-device#manage-device>`__의 내용을 참조하십시오.

source: Unmanage request - gateway
es: Solicitud de no gestionar: Pasarela
fr: Demande d'arrêt de gestion - passerelle
ko: 비관리 요청 - 게이트웨이

source: A gateway can invoke sendGatewayUnmanageRequet() method when it no longer needs to be managed. The IBM Watson Internet of Things Platform will no longer send new device management requests for this gateway and all device management requests from the gateway (only for the gateway and not for the attached devices) will be rejected other than a **Manage** request.
es: Una pasarela puede invocar el método sendGatewayUnmanageRequet() cuando ya no necesite ser gestionado. IBM Watson Internet of Things Platform ya no enviará nuevas solicitudes de gestión de dispositivos para esta pasarela, y todas las solicitudes de gestión de dispositivos procedentes de dicha pasarela (solo respecto a la pasarela, no respecto a los dispositivos conectados) se rechazarán, excepto la solicitud **Gestionar dispositivo**.
fr: Une passerelle peut appeler la méthode sendGatewayUnmanageRequet() si elle n'a plus besoin d'être gérée. IBM Watson Internet of Things Platform n'enverra plus de demande de gestion de terminal pour cette passerelle et toutes les demandes de gestion de terminal émises par la passerelle (uniquement pour la passerelle et non pour les terminaux connectés) seront rejetées, à l'exception de la demande de **gestion**.
ko: 게이트웨이가 관리될 필요가 없는 경우 sendGatewayUnmanageRequet() 메소드를 호출할 수 있습니다. 그러면 IBM Watson Internet of Things Platform이 더 이상 이 게이트웨이에 대해 새 디바이스 관리 요청을 보내지 않으며 **관리** 요청을 제외한 게이트웨이의 모든 디바이스 관리 요청(게이트웨이에만 해당되며 접속된 디바이스에는 해당되지 않음)이 거부됩니다.

source: Unmanage request - attached devices
es: Solicitud de no gestionar: Dispositivos conectados
fr: Demande d'arrêt de gestion - terminaux connectés
ko: 비관리 요청 - 접속된 디바이스

source: The gateway can invoke sendDeviceUnmanageRequet() method to move the attached device from managed state to unmanaged state. The IBM Watson Internet of Things Platform will no longer send new device management requests for this device and all device management requests from the gateway for this attached device will be rejected other than a **Manage** request.
es: La pasarela puede invocar el método sendDeviceUnmanageRequet() para pasar el dispositivo conectado del estado managed (gestionado) al estado unmanaged (no gestionado). IBM Watson Internet of Things Platform ya no enviará nuevas solicitudes de gestión de dispositivos para este dispositivo, y todas las solicitudes de gestión de dispositivos procedentes de dicha pasarela respecto respecto a este dispositivos conectado se rechazarán, excepto la solicitud **Gestionar dispositivo**.
fr: La passerelle peut appeler la méthode sendDeviceUnmanageRequet() pour faire passer le terminal connecté de l'état géré à l'état non géré. IBM Watson Internet of Things Platform n'enverra plus de demande de gestion de terminal pour ce terminal et toutes les demandes de gestion de terminal émises par la passerelle pour ce terminal connecté seront rejetées, à l'exception de la demande de **gestion**.
ko: 게이트웨이는 sendDeviceUnmanageRequet() 메소드를 호출하여 접속된 디바이스를 관리 상태에서 비관리 상태로 이동할 수 있습니다. 그러면 IBM Watson Internet of Things Platform이 더 이상 이 디바이스에 대해 새 디바이스 관리 요청을 보내지 않으며 **관리** 요청을 제외한 이 접속된 디바이스에 대한 게이트웨이에서의 모든 디바이스 관리 요청이 거부됩니다.

source: Refer to the `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/unmanage-device#unmanage-device>`__ for more information about the Unmanage operation.
es: Consulte la `documentación <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/unmanage-device#unmanage-device>`__ para obtener más información sobre la operación de no gestionar.
fr: Voir la `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/unmanage-device#unmanage-device>`__ pour plus d'informations sur l'opération d'arrêt de la gestion.
ko: 비관리 오퍼레이션에 대한 자세한 정보는 `문서 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/unmanage-device#unmanage-device>`__의 내용을 참조하십시오.

source: Location update - gateway
es: Actualización de ubicación: Pasarela
fr: Mise à jour d'emplacement - passerelle
ko: 위치 업데이트 - 게이트웨이

source: Gateways that can determine their location can choose to notify the IBM Watson Internet of Things Platform about location changes. The gateway can invoke one of the overloaded updateLocation() method to update the location of the device.
es: Las pasarelas que pueden determinar su ubicación pueden optar por notificar los cambios de ubicación a IBM Watson Internet of Things Platform. La pasarela puede invocar uno de los métodos updateLocation() sobrecargados para actualizar la ubicación del dispositivo.
fr: Les passerelles qui peuvent identifier leur emplacement peuvent signaler à IBM Watson Internet of Things Platform qu'un emplacement a été modifié. La passerelle peut appeler l'une des méthodes updateLocation() surchargées pour mettre à jour l'emplacement du terminal.
ko: 위치를 판별할 수 있는 게이트웨이는 IBM Watson Internet of Things Platform에 위치 변경을 알리도록 선택할 수 있습니다. 게이트웨이는 오버로드된 updateLocation() 메소드 중의 하나를 호출하여 디바이스의 위치를 업데이트할 수 있습니다.

source: Location update - attached devices
es: Actualización de ubicación: Dispositivos gestionados
fr: Mise à jour d'emplacement - terminaux connectés
ko: 위치 업데이트 - 접속된 디바이스

source: The gateway can invoke corresponding device method updateDeviceLocation() to update the location of the attached devices. The overloaded method can be used to specify the measuredDateTime and etc..
es: La pasarela puede invocar el método del dispositivo correspondiente updateDeviceLocation() para actualizar la ubicación de los dispositivos conectados. Se puede utilizar el método sobrecargado para especificar measuredDateTime, etc..
fr: La passerelle peut appeler la méthode de terminal correspondante updateDeviceLocation() pour mettre à jour l'emplacement des terminaux connectés. La méthode surchargée peut être utilisée pour spécifier measuredDateTime, etc.
ko: 게이트웨이는 해당되는 디바이스 메소드 updateDeviceLocation()을 호출하여 접속된 디바이스의 위치를 업데이트할 수 있습니다. 오버로드된 메소드는 measuredDateTime 등을 지정하는 데 사용될 수 있습니다.

source: Refer to the `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ for more information about the Location update.
es: Consulte la `documentación <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ para obtener más información sobre la actualización de la ubicación.
fr: Voir la `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ pour plus d'informations sur la mise à jour des emplacements.
ko: 위치 업데이트에 대한 자세한 정보는 `문서 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__의 내용을 참조하십시오.

source: Append/Clear ErrorCodes - gateway
es: Añadir/borrar códigos de error: Pasarela
fr: Ajouter/effacer des codes d'erreur - passerelle
ko: ErrorCode 추가/삭제 - 게이트웨이

source: Gateways can choose to notify the IBM Watson Internet of Things Platform about changes in their error status. The gateway can invoke addErrorCode() method to add the current errorcode to Watson IoT Platform.
es: Las pasarelas pueden optar por notificar a IBM Watson Internet of Things Platform los cambios producidos en sus estados de error. La pasarela puede invocar el método addErrorCode() para añadir el código de error a Watson IoT Platform.
fr: Les passerelles peuvent signaler les modifications de leur statut d'erreur à IBM Watson Internet of Things Platform. La passerelle peut appeler la méthode addErrorCode() pour ajouter le code d'erreur en cours à Watson IoT Platform.
ko: 게이트웨이는 IBM Watson Internet of Things Platform에 오류 상태의 변경을 알리도록 선택할 수 있습니다. 게이트웨이는 addErrorCode() 메소드를 호출하여 현재 오류 코드를 Watson IoT Platform에 추가할 수 있습니다.

source: Also, the ErrorCodes of gateway can be cleared from IBM Watson Internet of Things Platform by calling the clearErrorCodes() method as follows:
es: Además, los ErrorCodes de la pasarela se pueden borrar de IBM Watson Internet of Things Platform mediante una llamada al método clearErrorCodes(), del modo siguiente:
fr: De plus, vous pouvez effacer les codes d'erreur de passerelle dans IBM Watson Internet of Things Platform en appelant la méthode clearErrorCodes() comme suit :
ko: 또한 게이트웨이의 오류 코드는 다음과 같이 clearErrorCodes() 메소드를 호출하여 IBM Watson Internet of Things Platform에서 지울 수 있습니다.

source: Append/Clear ErrorCodes - attached devices
es: Añadir/borrar códigos de error: Dispositivos conectados
fr: Ajouter/effacer des codes d'erreur - terminaux connectés
ko: ErrorCode 추가/삭제 - 접속된 디바이스

source: Similarly, the gateway can invoke the corresponding device method to add/clear the errorcodes of the attached devices,
es: De forma parecida, la pasarela puede invocar el método del dispositivo correspondiente para añadir o borrar los códigos de error de los dispositivos conectados:
fr: De même, la passerelle peut appeler la méthode de terminal correspondante pour ajouter/effacer les codes d'erreur des terminaux connectés,
ko: 마찬가지로 게이트웨이는 해당되는 디바이스 메소드를 호출하여 접속된 디바이스의 errorcode를 추가/삭제할 수 있습니다.

source: Append/Clear Log messages - gateway
es: Añadir/borrar mensajes de registro: Pasarela
fr: Ajouter/effacer des messages de journal - passerelle
ko: 로그 메시지 추가/삭제 - 게이트웨이

source: Gateways can choose to notify the IBM Watson Internet of Things Platform about changes by adding a new log entry. Log entry includes a log messages, its timestamp and severity, as well as an optional base64-encoded binary diagnostic data. The gateways can invoke addGatewayLog() method to send log messages,
es: Los dispositivos pueden optar por notificar los cambios a IBM Watson Internet of Things Platform mediante el añadido de una nueva entrada de registro. La entrada de registro incluye un mensaje de error, su indicación de fecha y hora y su gravedad, así como datos de diagnóstico opcionales, binarios y codificados en base 64. La pasarela puede invocar el método addGatewayLog() para enviar mensajes de registro,
fr: Les passerelles peuvent signaler des modifications à IBM Platform en ajoutant une nouvelle entrée de journal. L'entrée de journal inclut des messages de journal, l'horodatage et le niveau de gravité associés, ainsi que des données de diagnostic binaires facultatives codées en base64. Les passerelles peuvent appeler la méthode addGatewayLog() pour envoyer des messages de journal.
ko: 게이트웨이는 새 로그 항목을 추가하여 IBM Watson Internet of Things Platform에 변경사항을 알리도록 선택할 수 있습니다. 로그 항목에는 선택적 base64 인코딩된 2진 진단 데이터와 로그 메시지, 해당 시간소인 및 심각도가 포함됩니다.게이트웨이는 addGatewayLog() 메소드를 호출하여 로그 메시지를 전송할 수 있습니다.

source: Also, the log messages can be cleared from IBM Watson Internet of Things Platform by calling the clearLogs() method as follows:
es: Además, los mensajes de registro de la pasarela se pueden borrar de IBM Watson Internet of Things Platform mediante una llamada al método clearLogs(), del modo siguiente:
fr: De plus, vous pouvez effacer les messages de journal dans IBM Watson Internet of Things Platform en appelant la méthode clearLogs() comme suit :
ko: 또한 로그 메시지는 다음과 같이 clearLogs() 메소드를 호출하여 IBM Watson Internet of Things Platform에서 지울 수 있습니다.

source: Append/Clear Logs - attached devices
es: Añadir/borrar registros: Dispositivos conectados
fr: Ajouter/effacer des journaux - terminaux connectés
ko: 로그 추가/삭제 - 접속된 디바이스

source: Similarly, the gateway can invoke the corresponding device method to add/clear the Logs of the attached devices,
es: De forma parecida, la pasarela puede invocar el método del dispositivo correspondiente para añadir o borrar los registros de los dispositivos conectados.
fr: De même, la passerelle peut appeler la méthode de terminal correspondante pour ajouter/effacer les journaux des terminaux connectés,
ko: 마찬가지로 게이트웨이는 해당되는 디바이스 메소드를 호출하여 접속된 디바이스의 로그를 추가/삭제할 수 있습니다.

source: and to clear the Logs of attached devices, invoke the clearDeviceLogs() method with the details of the attached device,
es: Y para borrar los registros de los dispositivos conectados, invoque el método clearDeviceLogs() con los detalles del dispositivo conectado:
fr: et pour effacer les journaux des terminaux connectés, appelez la méthode clearDeviceLogs() avec les détails du terminal connecté,
ko: 또한 접속된 디바이스의 로그를 지우려면 접속된 디바이스의 세부사항을 사용하여 clearDeviceLogs() 메소드를 호출하십시오.

source: The device diagnostics operations are intended to provide information on gateway/device errors, and does not provide diagnostic information relating to the devices connection to the IBM Watson Internet of Things Platform.
es: El diagnóstico de los dispositivos está pensado para proporcionar información sobre errores de pasarelas y dispositivos y no proporciona información relacionada con la conexión de los dispositivos a IBM Watson Internet of Things Platform.
fr: Les opérations de diagnostic des terminaux fournissent des informations sur les erreurs relatives aux terminaux/passerelles, mais ne transmettent pas d'informations de diagnostic sur la connexion des terminaux à IBM Watson Internet of Things Platform.
ko: 디바이스 진단 오퍼레이션은 게이트웨이/디바이스 오류에 대한 정보를 제공하기 위한 것으로, IBM Watson Internet of Things Platform에 대한 디바이스 연결과 관련된 진단 정보를 제공하지 않습니다.

source: Refer to the `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ for more information about the Diagnostics operation.
es: Consulte la `documentación <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ para obtener más información sobre la operación de diagnóstico.
fr: Voir la `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ pour plus d'informations sur l'opération de diagnostic.
ko: 진단 오퍼레이션에 대한 자세한 정보는 `문서 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__의 내용을 참조하십시오.

source: Firmware Action
es: Acción de firmware
fr: Action sur le microprogramme
ko: 펌웨어 조치

source: The firmware update process is separated into two distinct actions:
es: El proceso de actualización del firmware se divide en dos acciones distintas:
fr: La procédure de mise à jour du microprogramme se compose de deux actions distinctes :
ko: 펌웨어 업데이트 프로세스는 두 개의 개별 조치로 구분됩니다.

source: Downloading Firmware
es: Descarga del firmware
fr: Téléchargement du microprogramme
ko: 펌웨어 다운로드

source: Updating Firmware.
es: Actualización del firmware.
fr: Mise à jour du microprogramme
ko: 펌웨어 업데이트

source: The gateway needs to do the following activities to support Firmware Action for itself and for the attached devices:
es: La pasarela debe realizar las actividades siguientes para admitir la acción de firmware para sí misma y para los dispositivos conectados:
fr: La passerelle doit effectuer les opérations suivantes afin de prendre en charge l'action sur le microprogramme pour elle-même et les terminaux connectés :
ko: 게이트웨이는 게이트웨이 및 접속된 디바이스에 대한 펌웨어 조치를 지원하도록 다음 활동을 수행해야 합니다.

source: **1. Construct DeviceFirmware Object (Optional)**
es: **1. Construir el objeto DeviceFirmware (opcional)**
fr: **1. Construire l'objet DeviceFirmware (facultatif)**
ko: **1. DeviceFirmware 오브젝트 생성(선택사항)**

source: In order to perform Firmware action, the gateway can optionally construct a DeviceFirmware object for itself and for attached devices and add it to DeviceData as follows:
es: Para llevar a cabo la acción de firmware, la pasarela tiene la opción de construir un objeto DeviceFirmware para sí misma y para los dispositivos conectados y añadirlo al objeto DeviceData del modo siguiente:
fr: Pour effectuer une action sur le microprogramme, la passerelle peut, en option, construire un objet DeviceFirmware pour elle-même et pour les terminaux connecter, et l'ajouter à DeviceData comme suit :
ko: 펌웨어 조치를 수행하도록 게이트웨이는 다음과 같이 필요에 따라 게이트웨이 및 접속된 디바이스에 대한 DeviceFirmware 오브젝트를 생성하고 DeviceData에 추가할 수 있습니다.

source: And in the case of attached devices, the constructed DeviceData can be passed to the library while sending the manage request. i.e
es: Y en el caso de los dispositivos conectados, el objeto DeviceData construido puede pasarse a la biblioteca mientras se envía la solicitud de gestión. Por ejemplo:
fr: Dans le cas des terminaux connectés, l'objet DeviceData construit peut être transmis à la bibliothèque lors de l'envoi de la demande de gestion, c'est-à-dire
ko: 접속된 디바이스의 경우, 메시지 요청을 보내는 중에 생성된 DeviceData가 라이브러리에 전달될 수 있습니다. 예:

source: The DeviceFirmware object represents the current firmware of the gateway or attached device and will be used to report the status of the Firmware Download and Firmware Update actions to IBM Watson Internet of Things Platform. In case this DeviceFirmware object is not constructed by the gateway, the library creates an empty object and reports the status to Watson IoT Platform.
es: El objeto DeviceFirmware representa el firmware actual de la pasarela o del dispositivo conectado y se utilizará para informar sobre el estado de las acciones de descarga del firmware y de actualización del firmware a IBM Watson Internet of Things Platform. En caso de que la pasarela no construya este objeto DeviceFirmware, la biblioteca crea un objeto vacío e informa del estado a Watson IoT Platform.
fr: L'objet DeviceFirmware représente le microprogramme en cours de la passerelle ou du terminal connecté et est utilisé pour indiquer le statut des actions de téléchargement et de mise à jour du microprogramme dans IBM Watson Internet of Things Platform. Si cet objet DeviceFirmware n'est pas construit par la passerelle, la bibliothèque crée un objet vide et indique le statut à Watson IoT Platform.
ko: DeviceFirmware 오브젝트는 게이트웨이 또는 접속된 디바이스의 현재 펌웨어를 나타내며, 펌웨어 다운로드 및 펌웨어 업데이트 조치의 상태를 IBM Watson Internet of Things Platform에 보고하는 데 사용됩니다. 이 경우, 이 DeviceFirmware 오브젝트는 게이트웨이에서 생성하지 않으며 라이브러리가 비어 있는 오브젝트를 작성하고 상태를 Watson IoT Platform에 보고합니다.

source: **2. Inform the server about the Firmware action support**
es: **2. Informar al servidor sobre el soporte de la acción de firmware**
fr: **2. Signaler au serveur la prise en charge de l'action sur le microprogramme**
ko: **2. 펌웨어 조치 지원에 대해 서버에 알림**

source: The gateway/attached devices needs to set the firmware action flag to true in order for the server to initiate the firmware request. This can be achieved by passing true value for supportFirmwareActions parameter while sending the manage request.
es: Para que el servidor inicie la solicitud de firmware, la pasarela o los dispositivos conectados deben definir el distintivo de la acción de firmware en true. Para hacerlo, es necesario pasar el valor true para el parámetro supportFirmwareActions mientras se envía la solicitud de gestión.
fr: La passerelle/les terminaux connectés doivent associer l'indicateur d'action sur le microprogramme à la valeur true pour permettre au serveur d'initier la demande de microprogramme. Pour ce faire, transmettez la valeur true pour le paramètre supportFirmwareActions lors de l'envoi de la demande de gestion.
ko: 서버가 펌웨어 요청을 시작하도록 게이트웨이/접속된 디바이스는 펌웨어 조치 플래그를 true로 설정해야 합니다. 관리 요청을 보내는 중에 supportFirmwareActions 매개변수에 대한 true 값을 전달하여 수행할 수 있습니다.

source: The gateway can invoke the following method to inform the server about its firmware support,
es: La pasarela puede invocar el método siguiente para informar al servidor acerca de su soporte del firmware:
fr: La passerelle peut appeler la méthode suivante afin de signaler au serveur la prise en charge du microprogramme,
ko: 게이트웨이는 다음 메소드를 호출하여 서버에 펌웨어 지원에 대해 알릴 수 있습니다.

source: Similarly, the gateway can invoke the corresponding device method to inform the firmware support of attached devices,
es: De forma parecida, la pasarela puede invocar el método del dispositivo correspondiente para informar sobre el soporte del firmware de los dispositivos conectados:
fr: De même, la passerelle peut appeler la méthode de terminal correspondante pour signaler la prise en charge du microprogramme des terminaux connectés,
ko: 마찬가지로 게이트웨이는 해당되는 디바이스 메소드를 호출하여 접속된 디바이스의 펌웨어 지원을 알릴 수 있습니다.

source: Once the support is informed to the DM server, the server then forwards the firmware actions to the gateway for the gateway itself/attached devices.
es: Una vez que se ha informado al servidor de DM acerca del soporte, dicho servidor reenvía las acciones de firmware a la pasarela para la propia pasarela o para los dispositivos conectados.
fr: Une fois la prise en charge signalée au serveur de gestion des terminaux, le serveur transmet les actions sur le microprogramme à la passerelle pour la passerelle elle-même et les terminaux connectés.
ko: 일단 지원을 DM 서버에 알리면 서버가 펌웨어 조치를 게이트웨이 자체/접속된 디바이스에 대해 게이트웨이에 전달합니다.

source: **3. Create the Firmware Action Handler**
es: **3. Crear el manejador de acciones de firmware**
fr: **3. Créer le gestionnaire d'actions sur le microprogramme**
ko: **3. 펌웨어 조치 핸들러 작성**

source: In order to support the Firmware action, the gateway needs to create a handler and add it to managedGateway. The handler must extend a DeviceFirmwareHandler class and implement the following methods:
es: Para soportar la acción de firmware, la pasarela debe crear un manejador y añadirlo a managedGateway. El manejador debe ampliar una clase DeviceFirmwareHandler e implementar los métodos siguientes:
fr: Pour que l'action sur le microprogramme soit prise en charge, la passerelle doit créer un gestionnaire et l'ajouter à managedGateway. Le gestionnaire doit étendre une classe DeviceFirmwareHandler et implémenter les méthodes suivantes :
ko: 펌웨어 조치를 지원하기 위해 게이트웨이는 핸들러를 작성하고 managedGateway에 추가해야 합니다. 핸들러는 DeviceFirmwareHandler 클래스를 확장하고 다음 메소드를 구현해야 합니다.
