Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java_managedgateway.po
Languages: es, fr, ko

source: **Note**: There must be only one handler added to the library for both the gateway and attached devices where the firmware download/update requests will be redirected. The implementation must create a thread (possibly a pool of threads) to handle multiple firmware requests at the same time. A sample handler implementation with a threadpool is `demonstrated here <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__
es: **Nota**: Solo debe añadirse un manejador a la biblioteca para la pasarela y los dispositivos conectados, adonde se redirigirán las solicitudes de descarga o actualización del firmware. La implementación debe crear un subproceso (posiblemente una agrupación de subprocesos) para manejar varias solicitudes de firmware a la vez. Un ejemplo de implementación del manejador con una agrupación de subprocesos se `muestra aquí <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__
fr: **Remarque** : un gestionnaire et un seul doit être ajouté à la bibliothèque pour la passerelle et les terminaux connectés vers lesquels les demandes de téléchargement/mise à jour du microprogramme seront redirigées. L'implémentation doit créer une unité d'exécution (un pool d'unités d'exécution généralement) afin de gérer plusieurs demandes de microprogramme simultanément. Vous trouverez ici un exemple d'implémentation de gestionnaire avec un pool d'unités d'exécution : `<https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__
ko: **참고**: 펌웨어 다운로드/업데이트 요청을 경로 재지정할 게이트웨이 및 접속된 디바이스 둘 다에 대한 라이브러리에 하나의 핸들러만 추가되어야 합니다. 구현은 동시에 다중 펌웨어 요청을 처리하기 위해 스레드(또는 스레드 풀)를 작성해야 합니다. 스레드 풀이 있는 샘플 핸들러 구현은 `<https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>에서 설명합니다.`__

source: **3.1 Sample implementation of downloadFirmware**
es: **3.1 Implementación de muestra de downloadFirmware**
fr: **3.1 Exemple d'implémentation de downloadFirmware**
ko: **3.1 downloadFirmware의 샘플 구현**

source: The implementation must add a logic to download the firmware and report the status of the download via DeviceFirmware object. If the Firmware Download operation is successful, then the state of the firmware to be set to DOWNLOADED and UpdateStatus should be set to SUCCESS.
es: La implementación debe añadir una lógica para descargar el firmware e informar sobre el estado de la descarga a través del objeto DeviceFirmware. Si la operación Descarga de firmware se realiza correctamente, el estado del firmware se definirá en DOWNLOADED y UpdateStatus deberá definirse en SUCCESS.
fr: L'implémentation doit ajouter une logique permettant de télécharger le microprogramme et d'indiquer le statut du téléchargement via l'objet DeviceFirmware. Si l'opération de téléchargement du microprogramme aboutit, l'état du microprogramme doit correspondre à DOWNLOADED et UpdateStatus doit correspondre à SUCCESS.
ko: 구현에서는 DeviceFirmware 오브젝트를 통해 펌웨어를 다운로드하고 다운로드 상태를 보고하는 로직을 추가해야 합니다. 펌웨어 다운로드 오퍼레이션이 완료되면 펌웨어 상태를 DOWNLOADED로 설정하고 UpdateStatus를 SUCCESS로 설정해야 합니다.

source: If an error occurs during Firmware Download the state should be set to IDLE and updateStatus should be set to one of the error status values:
es: Si se produce un error durante la Descarga de firmware, el estado deberá definirse en IDLE y updateStatus se debe definir en uno de los valores de estado de error:
fr: Si une erreur se produit lors du téléchargement du microprogramme, l'état doit correspondre à IDLE et updateStatus doit représenter l'une des valeurs de statut d'erreur suivants :
ko: 펌웨어 다운로드 중 오류가 발생한 경우 상태를 IDLE로 설정하고 updateStatus를 오류 상태 값 중 하나로 설정해야 합니다.

source: A sample Firmware Download implementation is shown below, (The below code doesn't include the threadpool part, refer to the `github sample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ for the complete implementation of the FirmwareHandler).
es: A continuación se muestra una implementación de la descarga del firmware. (El código siguiente no incluye la parte de la agrupación de subprocesos; consulte el `ejemplo de Github <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ para obtener la implementación completa de FirmwareHandler).
fr: Un exemple d'implémentation de téléchargement de microprogramme est présenté ci-après (le code ci-dessous n'inclut pas la partie relative au pool d'unités d'exécution ; voir `l'exemple github <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ pour l'implémentation complète de FirmwareHandler).
ko: 샘플 펌웨어 다운로드 구현은 아래에 표시되어 있습니다. (아래 코드에는 스레드 풀 부분이 포함되어 있지 않습니다. FirmwareHandler의 전체 구현에 대해서는 `Github 샘플 <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__의 내용을 참조하십시오.)

source: Gateway can check the integrity of the downloaded firmware image using the verifier and report the status back to IBM Watson Internet of Things Platform. The verifier can be set by the gateway during the startup (while creating the DeviceFirmware Object) or as part of the Download Firmware request by the application. A sample code to verify the same is below:
es: La pasarela puede comprobar la integridad de la imagen del firmware descargada mediante el verificador e informar sobre el estado a IBM Watson Internet of Things Platform. La pasarela puede definir el verificador durante el inicio (al crear el objeto DeviceFirmware), o puede definirlo la aplicación como parte de la solicitud de descarga del firmware. A continuación de indica un código de muestra para realizar la verificación:
fr: La passerelle peut vérifier l'intégrité de l'image de microprogramme téléchargée à l'aide du vérificateur et renvoyer le statut à IBM Watson Internet of Things Platform. Le vérificateur peut être défini par la passerelle au démarrage (lors de la création de l'objet DeviceFirmware) ou dans le cadre de la demande de téléchargement du microprogramme envoyée par l'application. Un exemple de code de vérification est présenté ci-dessous :
ko: 게이트웨이는 검사기를 사용하여 다운로드된 펌웨어 이미지의 무결성을 검사하고 IBM Watson Internet of Things Platform에 상태를 다시 보고할 수 있습니다. 시작 중(DeviceFirmware 오브젝트를 작성하는 중) 또는 애플리케이션의 펌웨어 다운로드 요청의 일부분으로 게이트웨이가 검사기를 설정할 수 있습니다. 동일하게 검사하기 위한 샘플 코드는 다음과 같습니다.

source: The complete code can be found in the gateway management sample `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__.
es: El código completo se puede encontrar en el ejemplo de gestión de la pasarela `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__.
fr: Le code complet est présenté dans l'exemple de gestion de passerelle `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__.
ko: 전체 코드는 게이트웨이 관리 샘플 `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__에서 찾을 수 있습니다.

source: **3.2 Sample implementation of updateFirmware**
es: **3.2 Implementación de muestra de updateFirmware**
fr: **3.2 Exemple d'implémentation d'updateFirmware**
ko: **3.2 updateFirmware의 샘플 구현**

source: The implementation must create a separate thread and add a logic to install the downloaded firmware and report the status of the update via DeviceFirmware object. If the Firmware Update operation is successful, then the state of the firmware should to be set to IDLE and UpdateStatus should be set to SUCCESS.
es: La implementación debe crear un subproceso distinto y añadir una lógica para instalar el firmware descargado e informar sobre el estado de la actualización a través del objeto DeviceFirmware. Si la operación de actualización del firmware se realiza correctamente, el estado del firmware se definirá en IDLE y UpdateStatus deberá definirse en SUCCESS.
fr: L'implémentation doit créer une unité d'exécution distincte et ajouter une logique permettant d'installer le microprogramme téléchargé et d'indiquer le statut de la mise à jour via l'objet DeviceFirmware. Si l'opération de mise à jour du microprogramme aboutit, l'état du microprogramme doit correspondre à IDLE et UpdateStatus doit correspondre à SUCCESS.
ko: 구현에서는 별도의 스레드를 작성하고 DeviceFirmware 오브젝트를 통해 다운로드된 펌웨어를 설치하고 업데이트 상태를 보고하는 로직을 추가해야 합니다. 펌웨어 업데이트 오퍼레이션이 완료되면 펌웨어 상태를 IDLE로 설정하고 UpdateStatus를 SUCCESS로 설정해야 합니다.

source: If an error occurs during Firmware Update, updateStatus should be set to one of the error status values:
es: Si se produce un error durante la Actualización de firmware, updateStatus se debe definir en uno de los valores de estado de error:
fr: Si une erreur se produit lors de la mise à jour du microprogramme, updateStatus doit correspondre à l'une valeurs de statut d'erreur suivantes :
ko: 펌웨어 업데이트 중 오류가 발생한 경우 updateStatus를 오류 상태 값 중 하나로 설정해야 합니다.

source: A sample Firmware Update implementation for a Raspberry Pi device is shown below:
es: A continuación se incluye una muestra de implementación de la Actualización de firmware del dispositivo Raspberry Pi:
fr: Un exemple d'implémentation de la mise à jour du microprogramme du terminal Raspberry Pi est présenté ci-dessous :
ko: Raspberry Pi 디바이스의 샘플 펌웨어 업데이트 구현은 다음과 같습니다.

source: **4. Add the handler to ManagedGateway**
es: **4. Añadir el manejador a ManagedGateway**
fr: **4. Ajouter le gestionnaire à ManagedGateway**
ko: **4. ManagedGateway에 핸들러 추가**

source: The created handler needs to be added to the ManagedGateway instance so that the WIoTP client library invokes the corresponding method when there is a Firmware action request from IBM Watson Internet of Things Platform.
es: El manejador creado se debe añadir a la instancia de ManagedGateway para que la biblioteca de cliente de WIoTP invoque el método correspondiente cuando se produzca una solicitud de acción de firmware desde IBM Watson Internet of Things Platform.
fr: Le gestionnaire créé doit être ajouté à l'instance ManagedGateway afin que la bibliothèque client WIoTP appelle la méthode correspondante lorsqu'une demande d'action sur le microprogramme est émise depuis IBM Watson Internet of Things Platform.
ko: IBM Watson Internet of Things Platform에서 제공하는 펌웨어 조치 요청이 있는 경우 WIoTP 클라이언트 라이브러리가 해당 메소드를 호출하도록, 작성된 핸들러를 ManagedGateway 인스턴스에 추가해야 합니다.

source: Refer to `this page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/firmware-actions#firmware-actions>`__ for more information about the Firmware action.
es: Consulte `esta página <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/firmware-actions#firmware-actions>`__ para obtener más información sobre la acción de firmware.
fr: Voir `cette page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/firmware-actions#firmware-actions>`__ pour plus d'informations sur l'action sur le microprogramme.
ko: 펌웨어 조치에 대한 자세한 정보는 `이 페이지 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/firmware-actions#firmware-actions>`__의 내용을 참조하십시오.

source: Device Actions
es: Acciones de dispositivo
fr: Actions sur les terminaux
ko: 디바이스 조치

source: The IBM Watson Internet of Things Platform supports the following device actions:
es: IBM Watson Internet of Things Platform soporta las siguientes acciones de dispositivo:
fr: IBM Watson Internet of Things Platform prend en charge les actions suivantes sur les terminaux :
ko: IBM Watson Internet of Things Platform은 다음과 같은 디바이스 조치를 지원합니다.

source: Reboot
es: Reinicio
fr: Réamorcer
ko: 다시 부팅

source: Factory Reset
es: Restablecimiento de fábrica
fr: Restaurer les paramètres d'usine
ko: 팩토리 재설정

source: The gateway needs to do the following activities to support Device Actions for itself and for the attached devices:
es: La pasarela debe realizar las actividades siguientes para admitir las acciones de dispositivo para sí misma y para los dispositivos conectados:
fr: La passerelle doit effectuer les opérations suivantes afin de prendre en charge les actions sur les terminaux pour elle-même et pour les terminaux connectés :
ko: 게이트웨이는 게이트웨이 및 접속된 디바이스에 대한 디바이스 조치를 지원하도록 다음 활동을 수행해야 합니다.

source: **1. Inform server about the Device Actions support**
es: **1. Informar al servidor sobre el soporte de las acciones del dispositivo**
fr: **1. Signaler au serveur la prise en charge des actions sur les terminaux**
ko: **1. 디바이스 조치 지원에 대해 서버에 알림**

source: In order to perform Reboot or Factory Reset action for itself and attached devices, the gateway needs to inform the IBM Watson Internet of Things Platform about the support first. This can be achieved by passing true value for supportDeviceActions parameter while sending the manage request.
es: Para realizar la acción de rearranque o de restablecimiento de fábrica para sí misma y para los dispositivos conectados, la pasarela debe informar antes a IBM Watson Internet of Things Platform sobre el soporte. Para hacerlo, es necesario pasar el valor true para el parámetro supportDeviceActions mientras se envía la solicitud de gestión.
fr: Afin d'effectuer l'action de réamorçage ou de restauration des paramètres d'usine pour elle-même et les terminaux connectés, la passerelle doit d'abord signaler la prise en charge à IBM Watson Internet of Things Platform. Pour ce faire, transmettez la valeur true pour le paramètre supportDeviceActions lors de l'envoi de la demande de gestion.
ko: 게이트웨이 및 접속된 디바이스에 대한 다시 부팅 또는 팩토리 재설정 조치를 수행하려면 먼저 게이트웨이가 IBM Watson Internet of Things Platform에 지원에 대해 알려야 합니다. 관리 요청을 보내는 중에 supportDeviceActions 매개변수에 대한 true 값을 전달하여 수행할 수 있습니다.

source: The gateway can invoke the following method to inform the server about its device action support,
es: La pasarela puede invocar el método siguiente para informar al servidor acerca de su soporte de las acciones de dispositivo:
fr: La passerelle peut appeler la méthode suivante afin de signaler au serveur la prise en charge des actions sur les terminaux,
ko: 게이트웨이는 다음 메소드를 호출하여 서버에 디바이스 조치 지원에 대해 알릴 수 있습니다.

source: Similarly, the gateway can invoke the corresponding device method to inform the device action support of attached devices,
es: De forma parecida, la pasarela puede invocar el método del dispositivo correspondiente para informar sobre el soporte de las acciones de dispositivo de los dispositivos conectados:
fr: De même, la passerelle peut appeler la méthode de terminal correspondante pour signaler la prise en charge des actions sur les terminaux pour les terminaux connectés,
ko: 마찬가지로 게이트웨이는 해당되는 디바이스 메소드를 호출하여 접속된 디바이스의 디바이스 조치 지원을 알릴 수 있습니다.

source: Once the support is informed to the DM server, the server then forwards the device action requests to the device.
es: Una vez que se ha informado al servidor de DM acerca del soporte, dicho servidor reenvía las solicitudes de acciones de dispositivo al dispositivo.
fr: Une fois la prise en charge signalée au serveur de gestion des terminaux, le serveur transmet les demandes d'action sur les terminaux au terminal.
ko: 일단 지원을 DM 서버에 알리면 서버가 디바이스 조치 요청을 디바이스에 전달합니다.

source: **2. Create the Device Action Handler**
es: **2. Crear el manejador de acciones del dispositivo**
fr: **2. Créer le gestionnaire d'actions sur les terminaux**
ko: **2. 디바이스 조치 핸들러 작성**

source: In order to support the device action, the gateway needs to create a handler and add it to managedGateway instance. The handler must extend a DeviceActionHandler class and provide implementation for the following methods:
es: Para soportar la acción de dispositivo, la pasarela debe crear un manejador y añadirlo a la instancia de managedGateway. El manejador debe ampliar una clase DeviceActionHandler e implementar los métodos siguientes:
fr: Pour prendre en charge l'action sur les terminaux, la passerelle doit créer un gestionnaire et l'ajouter à l'instance managedGateway. Le gestionnaire doit étendre une classe DeviceActionHandler et implémenter les méthodes suivantes :
ko: 디바이스 조치를 지원하도록 게이트웨이는 핸들러를 작성하고 managedGateway 인스턴스에 추가해야 합니다. 핸들러는 DeviceActionHandler 클래스를 확장하고 다음 메소드에 대한 구현을 제공해야 합니다.

source: **Note:** There must be only one handler added to the library for both the gateway and attached devices where the device action requests will be redirected. The implementation must create a thread (possibly a pool of threads) to handle multiple device action requests at the same time. A sample handler implementation with a threadpool is `demonstrated here <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
es: **Nota:** Solo debe añadirse un manejador a la biblioteca para la pasarela y los dispositivos conectados, adonde se redirigirán las solicitudes de acciones de dispositivo. La implementación debe crear un subproceso (posiblemente una agrupación de subprocesos) para manejar varias solicitudes de acciones de dispositivo a la vez. Un ejemplo de implementación del manejador con una agrupación de subprocesos se `muestra aquí <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__
fr: **Remarque :** un gestionnaire et un seul doit être ajouté à la bibliothèque pour la passerelle et les terminaux connectés vers lesquels les demandes d'actions sur les terminaux seront redirigées. L'implémentation doit créer une unité d'exécution (un pool d'unités d'exécution généralement) afin de gérer plusieurs demandes d'action sur les terminaux simultanément. Vous trouverez ici un exemple d'implémentation de gestionnaire avec un pool d'unités d'exécution : `<https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
ko: **참고**: 디바이스 조치 요청을 경로 재지정할 게이트웨이 및 접속된 디바이스 둘 다에 대한 라이브러리에 하나의 핸들러만 추가되어야 합니다. 구현은 동시에 다중 디바이스 조치 요청을 처리하도록 스레드(또는 스레드 풀)를 작성해야 합니다. 스레드 풀이 있는 샘플 핸들러 구현은 `demonstrated here <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>에서 설명합니다.`__

source: **2.1 Sample implementation of handleReboot**
es: **2.1 Implementación de muestra de handleReboot**
fr: **2.1 Exemple d'implémentation de handleReboot**
ko: **2.1 handleReboot의 샘플 구현**

source: The implementation must create a separate thread and add a logic to reboot the gateway/attached device and report the status of the reboot via DeviceAction object. Upon receiving the request, the gateway first needs to inform the server about the support(or failure) before proceeding with the actual reboot. And if the sample can not reboot the device or any other error during the reboot, the gateway can update the status along with an optional message. A sample reboot implementation for a Raspberry Pi device is shown below (The below code doesn't include the threadpool part, refer to the `github location <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ for the complete implementation of a sample device action handler).
es: La implementación debe crear un subproceso distinto y añadir una lógica para rearrancar la pasarela o el dispositivo conectado e informar sobre el estado del rearranque a través del objeto DeviceAction. Tras recibir la solicitud, la pasarela debe informar al servidor acerca del soporte (o de su ausencia) antes de continuar con el arranque en sí. Y si el ejemplo no puede rearrancar el dispositivo o se produce cualquier error error durante el rearranque, la pasarela puede actualizar el estado junto con un mensaje opcional. A continuación se muestra una implementación de ejemplo del rearranque para un dispositivo Raspberry Pi. (El código siguiente no incluye la parte sobre la agrupación de subprocesos; consulte la `ubicación Github <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ para obtener la implementación completa de un manejador de acciones de dispositivo de ejemplo).
fr: L'implémentation doit créer une unité d'exécution distincte et ajouter une logique permettant de réinitialiser la passerelle/le terminal connecté et de signaler le statut du réamorçage via l'objet DeviceAction. Une fois la demande reçue, la passerelle doit d'abord signaler au serveur la prise en charge (ou l'échec) avant de procéder au réamorçage. Si l'exemple ne parvient pas à réamorcer le terminal ou si toute autre erreur survient au cours du réamorçage, la passerelle peut mettre à jour le statut avec un message facultatif. Un exemple d'implémentation de réamorçage pour un terminal Raspberry Pi est présenté ci-après (le code ci-dessous n'inclut pas la partie relative au pool d'unités d'exécution ; voir `la page github <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ pour l'implémentation complète d'un exemple de gestionnaire d'actions sur les terminaux).
ko: 구현에서는 별도의 스레드를 작성하고 게이트웨이/접속된 디바이스를 다시 부팅하고 DeviceAction 오브젝트를 통해 다시 부팅 상태를 보고하는 로직을 추가해야 합니다. 요청을 수신하면 실제 다시 부팅을 진행하기 전에 먼저 게이트웨이가 서버에 지원(또는 실패)에 대해 알려야 합니다. 또한 샘플이 디바이스를 다시 부팅할 수 없거나 다시 부팅하는 동안 기타 오류가 발생하는 경우, 게이트웨이가 선택적 메시지와 함께 상태를 업데이트할 수 있습니다. Raspberry Pi 디바이스에 대한 샘플 다시 부팅은 아래에 표시되어 있습니다. (아래 코드에는 스레드 풀 부분이 포함되어 있지 않습니다. 샘플 디바이스 조치 핸들러의 전체 구현에 대해서는 `Github 위치 <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__의 내용을 참조하십시오.)
