Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java_managedgateway.po
Languages: es, fr, ko

source: Java Client Library - Managed Gateway
es: Biblioteca de cliente Java: Pasarela gestionada
fr: Bibliothèque client Java - Passerelle gérée
ko: Java 클라이언트 라이브러리 - 관리 게이트웨이

source: Introduction
es: Introducción
ko: 소개

source: Gateway plays an important role in the device management of devices connected to it. Many of these devices will be too basic to be managed. For a managed device, the device management agent on the gateway acts as a proxy for the connected device. The protocol used by the gateway to manage the connected devices is arbitrary, and there need not be a device management agent on the connected devices. It is only necessary for the gateway to ensure that devices connected to it perform their responsibilities as managed devices, performing any translation and processing required to achieve this. The management agent in gateway will act as more than a transparent tunnel between the attached device and the Watson IoT Platform.
es: La pasarela juega un papel importante en la gestión de los dispositivos conectados a ella. Muchos de estos dispositivos serán demasiado básicos como para gestionarlos. En el caso de un dispositivo gestionado, el agente de gestión de dispositivos de la pasarela actúa como proxy para el dispositivo conectado. El protocolo que utiliza la pasarela para gestionar los dispositivos conectados es arbitrario, y no es necesario que haya un agente de gestión de dispositivos en los dispositivos conectados. Solo es necesario que la pasarela se asegure de que los dispositivos conectados a ella realicen sus responsabilidades como dispositivos gestionados, realizando cualquier conversión y proceso necesario para lograrlo. El agente de gestión de la pasarela actuará más como un túnel transparente entre el dispositivo conectado y Watson IoT Platform.
fr: La passerelle joue un rôle essentiel dans la gestion des terminaux qui lui sont connectés. La plupart de ces terminaux sont trop basiques pour être gérés. Dans le cas d'un terminal géré, l'agent de gestion des terminaux sur la passerelle fait office de proxy pour le terminal connecté. Le protocole utilisé par la passerelle pour gérer les terminaux connectés est arbitraire, et un agent de gestion des terminaux n'est pas requis sur les terminaux connectés. La passerelle doit seulement s'assurer que les terminaux qui lui sont connectés effectuent les opérations qui leur incombent, telles que toute traduction requise et le traitement connexe. L'agent de gestion sur la passerelle constitue plus qu'un tunnel transparent entre le terminal connecté et Watson IoT Platform.
ko: 게이트웨이는 연결된 디바이스의 디바이스 관리에서 중요한 역할을 수행합니다. 많은 해당 디바이스가 관리하기에 너무 기본적입니다. 관리되는 디바이스의 경우, 게이트웨이의 디바이스 관리 에이전트가 연결된 디바이스에 대한 프록시 역할을 수행합니다. 연결된 디바이스를 관리하도록 게이트웨이에서 사용하는 프로토콜은 임의적이며 연결된 디바이스에 디바이스 관리 에이전트가 있어야 할 필요는 없습니다. 게이트웨이에 연결된 디바이스가 게이트웨이를 사용하는 데 필요한 변환 및 처리를 수행하면서 관리 디바이스로서의 책임을 수행하는지 확인하는 데만 필요합니다. 게이트웨이 내의 관리 에이전트는 접속된 디바이스 및 Watson IoT Platform 사이의 투명 터널 이상의 역할을 수행합니다.

source: For example, It is unlikely that a device connected to a gateway will be able to download the firmware itself. In this case, the gateway’s device management agent will intercept the request to download the firmware and perform the download to its own storage. Then, when the device is instructed to perform the upgrade, the gateway’s device management agent will push the firmware to the device and update it.
es: Por ejemplo, es poco probable que un dispositivo conectado a una pasarela pueda descargar el firmware por sí mismo. En este caso, el agente de gestión de dispositivos de la pasarela interceptará la solicitud de descarga del firmware y realizará la descarga en su propio almacenamiento. Posteriormente, cuando el dispositivo reciba las instrucciones para realizar la actualización, el agente de gestión de dispositivos de la pasarela enviará el firmware al dispositivo y lo actualizará.
fr: Par exemple, il est peu probable qu'un terminal connecté à une passerelle puisse télécharger le microprogramme lui-même. Dans ce cas, l'agent de gestion des terminaux de la passerelle intercepte la demande de téléchargement du microprogramme et le télécharge dans son propre espace de stockage. Ensuite, lorsque le terminal doit procéder à la mise à niveau, l'agent de gestion des terminaux de la passerelle envoie le microprogramme au terminal et le met à jour.
ko: 예를 들어, 게이트웨이에 연결된 디바이스가 펌웨어 자체를 다운로드하는 경우는 거의 없습니다. 이 경우, 게이트웨이의 디바이스 관리 에이전트가 요청을 가로채어 펌웨어를 다운로드하고 자체 스토리지에 다운로드를 수행합니다. 그런 다음 디바이스에 업그레이드 수행 지시가 전달되면 게이트웨이의 디바이스 관리 에이전트가 펌웨어를 디바이스에 푸시하고 업데이트합니다.

source: This section contains information on how gateways (and attached devices) can connect to the Internet of Things Platform Device Management service using Java and perform device management operations like firmware update, location update, and diagnostics update.
es: Esta sección contiene información sobre cómo se pueden conectar pasarelas (y los dispositivos conectados) al servicio de gestión de dispositivos de Internet of Things Platform utilizando Java y cómo llevar a cabo operaciones de gestión de dispositivos, como la actualización del firmware, la actualización de la ubicación y la actualización del diagnóstico.
fr: Cette section contient des informations sur la façon dont les passerelles (et les terminaux connectés) peuvent se connecter au service de gestion des terminaux d'Internet of Things Platform avec Java et effectuer des opérations de gestion des terminaux telles que la mise à jour du microprogramme, la mise à jour de l'emplacement et la mise à jour des diagnostics.
ko: 이 절에서는 Java를 사용하여 게이트웨이 및 접속된 디바이스를 Internet of Things Platform 디바이스 관리 서비스에 연결하고 펌웨어 업데이트, 위치 업데이트 및 진단 업데이트와 같은 디바이스 관리 오퍼레이션을 수행하는 방법에 대한 정보를 다룹니다.

source: Create DeviceData
es: Crear DeviceData
fr: Créer DeviceData
ko: DeviceData 작성

source: The `device model <https://docs.internetofthings.ibmcloud.com/reference/device_model.html>`__ describes the metadata and management characteristics of a device or a gateway. The device database in the IBM Watson Internet of Things Platform is the master source of device information. Applications and managed devices are able to send updates to the database such as a location or the progress of a firmware update. Once these updates are received by the IBM Watson Internet of Things Platform, the device database is updated, making the information available to applications.
es: El `modelo de dispositivo <https://docs.internetofthings.ibmcloud.com/reference/device_model.html>`__ describe los metadatos y las características de gestión de un dispositivo o una pasarela. La base de datos de dispositivos de IBM Watson Internet of Things Platform es el origen maestro de la información sobre el dispositivo. Las aplicaciones y los dispositivos gestionados pueden enviar actualizaciones a la base de datos, como la ubicación o el progreso de una actualización del firmware. Una vez que IBM Watson Internet of Things Platform ha recibido estas actualizaciones, la base de datos de dispositivos se actualiza y pone la información a disposición de las aplicaciones.
fr: Le `modèle de terminal <https://docs.internetofthings.ibmcloud.com/reference/device_model.html>`__ décrit les métadonnées et les caractéristiques de gestion d'un terminal ou d'une passerelle. La base de données de terminaux d'IBM Watson Internet of Things Platform représente la principale source d'informations sur les terminaux. Les applications et les terminaux gérés peuvent envoyer des mises à jour à la base de données, comme un emplacement ou la progression de la mise à jour d'un microprogramme. Une fois ces mises à jour reçues par IBM Watson Internet of Things Platform, la base de données de terminaux est modifiée et les informations sont mises à la disposition des applications.
ko: `디바이스 모델 <https://docs.internetofthings.ibmcloud.com/reference/device_model.html>`__에서는 디바이스 또는 게이트웨이의 메타데이터 및 관리 특성에 대해 설명합니다. IBM Watson Internet of Things Platform에 있는 디바이스 데이터베이스는 디바이스 정보에 대한 마스터 소스입니다. 애플리케이션 및 관리 디바이스가 펌웨어 업데이트의 진행상태 또는 위치 등 데이터베이스에 대한 업데이트를 보낼 수 있습니다. IBM Watson Internet of Things Platform에서 해당 업데이트를 수신하면 디바이스 데이터베이스가 업데이트되므로 애플리케이션에서 정보를 사용할 수 있게 됩니다.

source: The device model in the WIoTP client library is represented as DeviceData and to create a DeviceData one needs to create the following objects,
es: El modelo de dispositivo de la biblioteca de cliente de WIoTP se representa como DeviceData, y para crear DeviceData se deben crear los siguientes objetos,
fr: Le modèle de terminal inclus dans la bibliothèque client WIoTP est représenté en tant qu'objet DeviceData. Pour créer un objet DeviceData, vous devez créer les objets suivants :
ko: WIoTP 클라이언트 라이브러리의 디바이스 모델은 DeviceData로 표시되며 DeviceData를 작성하려면 다음 오브젝트를 작성해야 합니다.

source: DeviceInfo (Optional)
es: DeviceInfo (Opcional)
fr: DeviceInfo (facultatif)
ko: DeviceInfo(선택사항)

source: DeviceLocation (Optional, required only if the device wants to be notified about the location set by the application through Watson IoT Platform API)
es: DeviceLocation (opcional, solo es necesario si el dispositivo desea recibir notificaciones sobre la ubicación establecida por la aplicación a través de la API de Watson IoT Platform).
fr: DeviceLocation (facultatif, requis seulement si le terminal souhaite recevoir une notification concernant l'emplacement défini par l'application via l'API Watson IoT Platform)
ko: DeviceLocation(선택사항, 디바이스가 Watson IoT Platform API를 통해 애플리케이션에서 설정한 위치에 대한 알림을 받기를 원하는 경우에만 필수)

source: DeviceFirmware (Optional)
es: DeviceFirmware (opcional)
fr: DeviceFirmware (facultatif)
ko: DeviceFirmware(선택사항)

source: DeviceMetadata (optional)
es: DeviceMetadata (opcional)
fr: DeviceMetadata (facultatif)
ko: DeviceMetadata(선택사항)

source: The following code snippet shows how to create the object DeviceInfo along with DeviceMetadata with sample data:
es: El siguiente fragmento de código muestra cómo crear el objeto DeviceInfo junto con DeviceMetadata con datos de muestra:
fr: Le fragment de code suivant indique comment créer l'objet DeviceInfo, ainsi que l'objet DeviceMetadata avec des exemples de données :
ko: 다음의 코드 스니펫은 DeviceMetadata를 샘플 데이터로 사용하여 오브젝트 DeviceInfo를 작성하는 방법을 표시합니다.

source: The following code snippet shows how to create the DeviceData object with the above created DeviceInfo and DeviceMetadata objects:
es: El siguiente fragmento de código muestra cómo crear el objeto DeviceData con los objetos creados anteriormente DeviceInfo y DeviceMetadata:
fr: Le fragment de code suivant indique comment créer l'objet DeviceData avec les objets DeviceInfo et DeviceMetadata créés ci-dessus :
ko: 다음의 코드 스니펫은 위에서 작성된 DeviceInfo 및 DeviceMetadata 오브젝트를 사용하여 DeviceData 오브젝트를 작성하는 방법을 표시합니다.

source: Each gateway and attached devices must have its own DeviceData to represent itself in the Platform. In the case of gateway, the DeviceData will be passed to the library as part of constructing the ManagedGateway instance, and in the case of attached device, the DeviceData will be passed as part of the sendDeviceManageRequest().
es: Cada pasarela y los dispositivos conectados deben contar con su propio objeto DeviceData para representarse en la plataforma. En el caso de la pasarela, el objeto DeviceData se pasará a la biblioteca como parte de la construcción de la instancia de ManagedGateway, y en el caso de un dispositivo conectado, DeviceData se pasará como parte de sendDeviceManageRequest().
fr: Chaque passerelle et chaque terminal connecté doit posséder son propre objet DeviceData qui le représente sur la plateforme. Dans le cas d'une passerelle, l'objet DeviceData est transmis à la bibliothèque dans le cadre de la construction de l'instance ManagedGateway ; dans le cas d'un terminal connecté, il est transmis dans le cadre de sendDeviceManageRequest().
ko: 각 게이트웨이 및 접속된 디바이스에는 Platform에서 자신을 표시하기 위한 자체 DeviceData가 있어야 합니다. 게이트웨이의 경우, DeviceData가 ManagedGateway 인스턴스 생성의 일부로 라이브러리에 전달되고 접속된 디바이스의 경우, DeviceData가 sendDeviceManageRequest()의 일부로 전달됩니다.

source: Construct ManagedGateway
es: Construcción de ManagedGateway
fr: Construction de ManagedGateway
ko: ManagedGateway 생성

source: ManagedGateway - A gateway class that connects the gateway as managed gateway to IBM Watson Internet of Things Platform and enables the gateway to perform one or more Device Management operations for itself and attached devices. Also the ManagedGateway instance can be used to do normal gateway operations like publishing gateway events, attached device events and listening for commands from application.
es: ManagedGateway: Una clase de pasarela que conecta la pasarela como una pasarela gestionada a IBM Watson Internet of Things Platform y permite que dicha pasarela realice una o más operaciones de gestión de dispositivos para sí misma y para los dispositivos conectados. Además, la instancia de ManagedGateway se puede utilizar para realizar operaciones normales de la pasarela, como publicar sucesos de la pasarela o sucesos de los dispositivos conectados o escuchar mandatos procedentes de la aplicación.
fr: ManagedGateway - Classe de terminaux qui connecte la passerelle en tant que passerelle gérée à IBM Watson Internet of Things Platform et qui permet à la passerelle d'effectuer une ou plusieurs opérations de gestion des terminaux pour elle-même et les terminaux connectés. Vous pouvez aussi utiliser l'instance ManagedGateway pour effectuer des opérations de passerelle standard telles que la publication d'événements de passerelle et de terminal connecté, et l'écoute des commandes émises par l'application.
ko: ManagedGateway - 게이트웨이를 관리 게이트웨이로 IBM Watson Internet of Things Platform에 연결하고 게이트웨이 자체 및 접속된 디바이스에 대해 하나 이상의 디바이스 관리 오퍼레이션을 수행할 수 있도록 게이트웨이를 사용 설정하는 게이트웨이 클래스입니다. 또한 ManagedGateway 인스턴스를 사용하면 게이트웨이 이벤트, 접속된 디바이스 이벤트 공개 및 애플리케이션의 명령 청취와 같은 일반 게이트웨이 오퍼레이션을 수행할 수 있습니다.

source: ManagedGateway exposes 2 different constructors to support different user patterns,
es: ManagedGateway expone 2 constructores diferentes para soportar distintos patrones de usuario,
fr: ManagedGateway expose deux constructeurs différents pour la prise en charge de divers modèles d'utilisateur,
ko: ManagedGateway는 여러 가지 다른 사용자 패턴을 지원하도록 두 개의 다른 생성자를 표시합니다.

source: **Constructor One**
es: **Constructor uno**
fr: **Constructeur 1**
ko: **생성자 1**

source: Constructs a ManagedGateway instance by accepting the DeviceData and the following properties,
es: Construye una instancia de ManagedGateway mediante la aceptación de DeviceData y las siguientes propiedades:
fr: Construit une instance ManagedGateway en acceptant DeviceData et les propriétés suivantes :
ko: DeviceData 및 다음 특성을 허용하여 ManagedGateway 인스턴스를 생성합니다.

source: Organization-ID - Your organization ID.
es: Organization-ID; El ID de su organización.
fr: Organization-ID - ID de votre organisation.
ko: Organization-ID - 사용자의 조직 ID입니다.

source: Gateway-Type - The type of your gateway device.
es: Gateway-Type: El tipo del dispositivo de pasarela.
fr: Gateway-Type - Type de votre terminal de passerelle.
ko: Gateway-Type - 게이트웨이 디바이스의 유형입니다.

source: Gateway-ID - The ID of your gateway device.
es: Gateway-ID: El ID del dispositivo de pasarela.
fr: Gateway-ID - ID de votre terminal de passerelle.
ko: Gateway-ID - 게이트웨이 디바이스의 ID입니다.

source: Authentication-Method - Method of authentication (The only value currently supported is "token").
es: Authentication-Method: El método de autenticación (el único valor actualmente soportado es "token").
fr: Authentication-Method - Méthode d'authentification (la seule valeur actuellement prise en charge est "token").
ko: Authentication-Method - 인증 방법입니다(현재 "token" 값만 지원됨).

source: Authentication-Token - API key token
es: Authentication-Token: La señal de la clave de API.
fr: Authentication-Token - Jeton de clé d'API
ko: Authentication-Token - API 키 토큰입니다.

source: All these properties are required to interact with the IBM Watson Internet of Things Platform.
es: Todas estas propiedades son necesarias para interactuar con IBM Watson Internet of Things Platform.
fr: Toutes ces propriétés sont nécessaires pour interagir avec IBM Watson Internet of Things Platform.
ko: 이러한 모든 특성은 IBM Watson Internet of Things Platform과 상호작용하는 데 필요합니다.

source: The following code shows how to create a ManagedGateway instance:
es: El código siguiente muestra cómo crear una instancia de ManagedGateway:
fr: Le code suivant indique comment créer une instance ManagedGateway :
ko: 다음 코드는 ManagedGateway 인스턴스를 작성하는 방법을 표시합니다.

source: **Constructor Two**
es: **Constructor dos**
fr: **Constructeur 2**
ko: **생성자 2**

source: Construct a ManagedGateway instance by accepting the DeviceData and the MqttClient instance. This constructor requires the DeviceData to be created with additional device attributes like Device Type and Device Id as follows:
es: Construye una instancia ManagedGateway aceptando DeviceData y la instancia de MqttClient. Este constructor requiere que el DeviceData se cree con atributos de dispositivo adicionales como Device Type y Device Id del modo siguiente:
fr: Construit une instance ManagedGateway en acceptant DeviceData et l'instance MqttClient. Ce constructeur requiert la création de DeviceData avec des attributs de terminal complémentaires (comme Device Type et Device Id) de la manière suivante :
ko: DeviceData 및 MqttClient 인스턴스를 허용하여 ManagedGateway 인스턴스를 생성합니다. 이 생성자는 다음과 같이 디바이스 유형 및 디바이스 ID와 같은 추가 디바이스 속성을 사용하여 DeviceData를 작성해야 합니다.

source: Note this constructor helps the custom device users to create a ManagedGateway instance with the already created and connected MqttClient instance to take advantage of device management operations. But we recommend the users to use the library for all the device functionalities.
es: Tenga en cuenta que este constructor ayuda a los usuarios de dispositivos personalizados a crear una instancia de ManagedGateway con la instancia ya creada y conectada de MqttClient para hacer uso de las operaciones de gestión de dispositivos. No obstante, recomendamos a los usuarios utilizar la biblioteca para todas las funcionalidades de dispositivos.
fr: Ce constructeur permet aux utilisateurs de terminaux personnalisés de créer une instance ManagedGateway avec l'instance MqttClient déjà créée et connectée pour tirer parti des opérations de gestion des terminaux. Il est recommandé d'utiliser la bibliothèque pour toutes les fonctionnalités du terminal.
ko: 이 생성자는 디바이스 관리 오퍼레이션을 활용하기 위해 사용자 정의 디바이스 사용자가 이미 작성되고 연결된 MqttClient 인스턴스를 사용하여 ManagedGateway 인스턴스를 작성하는 데 도움이 된다는 점을 참고하십시오. 그러나 사용자는 모든 디바이스 기능의 라이브러리를 사용하도록 권장됩니다.

source: Manage request - gateway
es: Solicitud de gestión: Pasarela
fr: Demande de gestion - passerelle
ko: 관리 요청 - 게이트웨이

source: The gateway can invoke sendGatewayManageRequest() method to participate in device management activities. The manage request will initiate a connect request internally if the device is not connected to the IBM Watson Internet of Things Platform already:
es: La pasarela puede invocar el método sendGatewayManageRequest() para participar en las actividades de gestión de dispositivos. La solicitud de gestión iniciará una solicitud de conexión interna si el dispositivo no está conectado ya a IBM Watson Internet of Things Platform:
fr: La passerelle peut appeler la méthode sendGatewayManageRequest() pour participer aux opérations de gestion des terminaux. La demande de gestion lance une demande de connexion en interne si le terminal n'est pas encore connecté à IBM Watson Internet of Things Platform :
ko: 게이트웨이는 sendGatewayManageRequest() 메소드를 호출하여 디바이스 관리 활동에 참여할 수 있습니다. 디바이스가 IBM Watson Internet of Things Platform에 아직 연결되지 않은 경우 관리 요청은 연결 요청을 내부적으로 시작합니다.

source: As shown, this method accepts following 3 parameters,
es: Como se muestra, este método acepta los 3 parámetros siguientes:
fr: Comme indiqué, cette méthode accepte les trois paramètres suivants :
ko: 표시된 대로 이 메소드는 다음 세 개의 매개변수를 허용합니다.

source: *lifetime* The length of time in seconds within which the gateway must send another **Manage** request in order to avoid being reverted to an unmanaged device and marked as dormant. If set to 0, the managed gateway will not become dormant. When set, the minimum supported setting is 3600 (1 hour).
es: *lifetime*: El periodo de tiempo en segundos durante el cual la pasarela debe enviar otra solicitud **Gestionar** para evitar revertir a ser un dispositivo no gestionado y marcarse como inactiva. Si se establece en 0, la pasarela gestionada no pasará a estar inactiva. Cuando se establece, el valor mínimo admitido es 3600 (1 hora).
fr: *lifetime* Période en secondes au cours de laquelle la passerelle doit envoyer une autre demande de **gestion** pour ne pas revenir à l'état de terminal non géré et passer en mode veille. Si la valeur est 0, la passerelle gérée ne passe pas en veille. Si une valeur est définie, le paramètre minimal pris en charge est 3600 (1 heure).
ko: *lifetime* 비관리 디바이스로 되돌아가고 휴지 상태로 표시되는 것을 방지하려고 게이트웨이가 다른 **관리** 요청을 전송해야 하는 시간(초)입니다. 0으로 설정된 경우 관리 게이트웨이가 휴지 상태가 되지 않습니다. 설정된 경우 최소한으로 지원되는 설정값은 3600(1시간)입니다.

source: *supportFirmwareActions* Tells whether the gateway supports firmware actions or not. The gateway must add a firmware handler to handle the firmware requests.
es: *supportFirmwareActions* Indica si la pasarela admite acciones de firmware o no. La pasarela debe agregar un manejador de firmware para gestionar las solicitudes de firmware.
fr: *supportFirmwareActions* Indique si la passerelle prend en charge les actions sur le microprogramme ou non. La passerelle doit ajouter un gestionnaire de microprogramme afin de gérer les demandes de microprogramme.
ko: *supportFirmwareActions* 게이트웨이가 펌웨어 조치를 지원하는지 여부를 표시합니다. 게이트웨이가 펌웨어 요청을 처리하도록 펌웨어 핸들러를 추가해야 합니다.

source: *supportDeviceActions* Tells whether the gateway supports Device actions or not. The gateway must add a Device action handler to handle the reboot and factory reset requests.
es: *supportDeviceActions* Indica si la pasarela admite acciones de dispositivo o no. La pasarela debe agregar un manejador de acciones de dispositivo para gestionar las solicitudes de rearranque y restablecimiento de fábrica.
fr: *supportDeviceActions* Indique si la passerelle prend en charge les actions sur les terminaux ou non. La passerelle doit ajouter un gestionnaire d'actions sur les terminaux afin de gérer les demandes de réamorçage et de restauration des paramètres d'usine.
ko: *supportDeviceActions* 게이트웨이가 디바이스 조치를 지원하는지 여부를 표시합니다. 게이트웨이가 다시 부팅 및 팩토리 재설정 요청을 처리하도록 디바이스 조치 핸들러를 추가해야 합니다.

source: Manage request - attached devices
es: Solicitud de gestión: Dispositivos conectados
fr: Demande de gestion - terminaux connectés
ko: 관리 요청 - 접속된 디바이스

source: The gateway can invoke sendDeviceManageRequest() method to make the attached devices participate in the device management activities.
es: La pasarela puede invocar el método sendDeviceManageRequest() para hacer que los dispositivos conectados participen en las actividades de gestión de dispositivos.
fr: La passerelle peut appeler la méthode sendDeviceManageRequest() pour que les terminaux connectés participent aux activités de gestion des terminaux.
ko: 게이트웨이는 sendDeviceManageRequest() 메소드를 호출하여 접속된 디바이스가 디바이스 관리 활동에 참여하도록 만들 수 있습니다.
