Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java.po
Languages: es, fr, ko

source: Java for Gateway Developers
es: Java para desarrolladores de pasarela
fr: Java pour les développeurs de passerelles
ko: 게이트웨이 개발자용 Java

source: See `iot-java <https://github.com/ibm-messaging/iot-java>`_ in GitHub
es: Consulte `iot-java <https://github.com/ibm-messaging/iot-java>`_ en GitHub
fr: Voir `iot-java <https://github.com/ibm-messaging/iot-java>`_ dans GitHub
ko: GitHub에서 `iot-java <https://github.com/ibm-messaging/iot-java>`_ 참조

source: The constructor builds the Gateway client instance, and accepts a Properties object containing the following definitions:
es: El constructor crea la instancia de cliente de Pasarela y acepta un objeto Propiedades que contiene las siguientes definiciones:
fr: Le constructeur génère l'instance de client de passerelle et accepte un objet Properties contenant les définitions suivantes :
ko: 생성자는 게이트웨이 클라이언트 인스턴스를 빌드하고 다음 정의가 포함된 특성 오브젝트를 허용합니다.

source: org - Your organization ID.
es: org - ID de organización.
fr: org - ID de votre organisation.
ko: org - 조직 ID.

source: type - The type of your Gateway device.
es: type - Tipo del dispositivo de pasarela.
fr: type - type de votre terminal de passerelle.
ko: type - Gateway 디바이스의 유형.

source: id - The ID of your Gateway.
es: id - ID de la pasarela.
fr: id - ID de votre passerelle.
ko: id - Gateway 디바이스의 ID.

source: auth-method - Method of authentication (The only value currently supported is "token").
es: auth-method - Método de autenticación (el único valor soportado actualmente es "token").
fr: auth-method - Méthode d'authentification (la seule valeur actuellement admise est "token").
ko: auth-method - 인증 방법(현재 지원되는 유일한 값은 "token"임).

source: auth-token - API key token.
es: auth-token - Señal de clave de API.
fr: auth-token - Jeton de clé d'API.
ko: auth-token - API 키 토큰.

source: The Properties object creates definitions which are used to interact with the Watson Internet of Things Platform module.
es: El objeto Propiedades crea definiciones que se utilizan para interactuar con el módulo de Watson Internet of Things Platform.
fr: L'objet Properties crée des définitions qui permettent d'interagir avec le module Watson Internet of Things Platform.
ko: 특성 오브젝트는 Watson Internet of Things Platform 모듈과 상호작용하는 데 사용되는 정의를 작성합니다.

source: The following code snippet shows how to construct the GatewayClient instance,
es: El siguiente fragmento de código muestra cómo construir la instancia GatewayClient,
fr: Le fragment de code suivant explique comment construire l'instance de client de passerelle (GatewayClient) :
ko: 다음 코드 스니펫은 GatewayClien 인스턴스를 생성하는 방법을 보여줍니다.

source: Using a configuration file
es: Utilización de un archivo de configuración
fr: Utilisation d'un fichier de configuration
ko: 구성 파일 사용

source: Instead of including a Properties object directly, you can use a configuration file containing the name-value pairs for Properties. If you are using a configuration file containing a Properties object, use the following code format.
es: En lugar de incluir un objeto Propiedades directamente, puede utilizar un archivo de configuración que contenga los pares nombre-valor para Propiedades. Si está utilizando un archivo de configuración que contiene un objeto Propiedades, utilice el formato de código siguiente.
fr: Au lieu d'inclure un objet Properties directement, vous pouvez utiliser un fichier de configuration contenant les paires nom-valeur de l'objet Properties. Si vous utilisez un fichier de configuration contenant un objet Properties, utilisez le format de code suivant :
ko: 특성 오브젝트를 직접 포함하는 대신 특성에 대한 이름 값 쌍이 포함된 구성 파일을 사용할 수 있습니다. 특성 오브젝트가 포함된 구성 파일을 사용 중인 경우 다음 코드 형식을 사용하십시오.

source: The Gateway device configuration file must be in the following format:
es: El archivo de configuración de dispositivo de pasarela debe tener el formato siguiente:
fr: Le fichier de configuration du terminal de passerelle doit être au format suivant :
ko: Gateway 디바이스 구성 파일의 형식은 다음 형식이어야 합니다.

source: Connecting to the Watson Internet of Things Platform
es: Conexión a Watson Internet of Things Platform
fr: Connexion à Watson Internet of Things Platform
ko: Watson Internet of Things Platform에 연결

source: Connect to the Watson Internet of Things Platform by calling the *connect* function.
es: Conéctese a Watson Internet of Things Platform llamando a la función *connect*.
fr: Connectez-vous à Watson Internet of Things Platform en appelant la fonction *connect*.
ko: *connect* 함수를 호출하여 Watson Internet of Things Platform에 연결하십시오.

source: After the successful connection to the IBM Watson IoT Platform, the Gateway client can perform the following operations,
es: Tras la conexión satisfactoria a IBM Watson IoT Platform, el cliente de pasarela puede realizar las operaciones siguientes,
fr: Une fois la connexion à IBM Watson IoT Platform établie, le client de passerelle peut effectuer les opérations suivantes :
ko: IBM Watson IoT Platform에 성공적으로 연결되면 게이트웨이 클라이언트는 다음 오퍼레이션을 수행할 수 있습니다.

source: Publish events for itself and on behalf of devices connected behind the Gateway.
es: Publicar sucesos para sí mismo y en nombre de los dispositivos conectados detrás de la pasarela.
fr: Publier des événements pour lui-même et pour le compte de terminaux connectés derrière la passerelle.
ko: 게이트웨이 자체 및 게이트웨이 뒤에 연결된 디바이스를 대신해 이벤트 공개

source: Subscribe to commands for itself and on behalf of devices behind the Gateway.
es: Suscribirse a mandatos para sí mismo y en nombre de los dispositivos detrás de la pasarela.
fr: S'abonner à des commandes pour lui-même et pour le compte de terminaux situés derrière la passerelle.
ko: 게이트웨이 자체 및 게이트웨이 뒤에 연결된 디바이스를 대신해 명령 구독

source: Register devices using the Watson IoT Platform API
es: Registrar dispositivos utilizando la API de Watson IoT Platform
fr: Enregistrez des terminaux avec l'API Watson IoT Platform.
ko: Watson IoT Platform API를 사용하여 디바이스 등록

source: There are different ways to register the devices behind the Gateway to IBM Watson IoT Platform,
es: Existen diferentes maneras de registrar los dispositivos que hay detrás de la pasarela en IBM Watson IoT Platform,
fr: Vous pouvez enregistrer les terminaux situés derrière la passerelle auprès d'IBM Watson IoT Platform de plusieurs façons :
ko: 게이트웨이 뒤에 있는 디바이스를 IBM Watson IoT Platform에 등록하는 방법에는 여러 가지가 있습니다.

source: **Auto registration**: The device gets added automatically in IBM Watson IoT Platform when Gateway publishes any event/subscribes to any commands for the devices connected to it.
es: **Registro automático**: El dispositivo se añade automáticamente a IBM Watson IoT Platform cuando la pasarela publica sucesos o se suscribe a mandatos para los dispositivos conectados a ella.
fr: **Enregistrement automatique** : le terminal est ajouté automatiquement dans IBM Watson IoT Platform lorsque la passerelle publie un événement ou s'abonne à des commandes pour le compte des terminaux qui lui sont connectés.
ko: **자동 등록**: 게이트웨이가 이벤트를 공개하거나 게이트웨이에 연결된 디바이스에 대한 명령을 구독할 경우 디바이스가 IBM Watson IoT Platform에 자동으로 추가됩니다.

source: **API**: The Watson IoT Platform API can be used to register the devices to the Watson IoT Platform.
es: **API**: La API de Watson IoT Platform se puede utilizar para registrar los dispositivos en Watson IoT Platform.
fr: **API** : l'API Watson IoT Platform peut être utilisée pour enregistrer les terminaux auprès de Watson IoT Platform.
ko: **API**: Watson IoT Platform API를 사용하여 디바이스를 Watson IoT Platform에 등록할 수 있습니다.

source: The Watson IoT Platform API can be used to register the devices (that are connected to the Gateway) to the Watson IoT Platform. The APIClient simplifies the interactions with Watson IoT Platform API. Get the APIClient instance by invoking the api() method as follows,
es: La API de Watson IoT Platform se puede utilizar para registrar los dispositivos (que están conectados a la pasarela) a Watson IoT Platform. APIClient simplifica las interacciones con la API de Watson IoT Platform. Obtenga la instancia de APIClient invocando el método api() de la manera siguiente,
fr: L'API Watson IoT Platform peut être utilisée pour enregistrer les terminaux (qui sont connectés à la passerelle) auprès de Watson IoT Platform. APIClient simplifie les interactions avec l'API Watson IoT Platform. Obtenez l'instance APIClient en appelant la méthode api() comme suit :
ko: Watson IoT Platform API를 사용하여 디바이스(게이트웨이에 연결됨)를 Watson IoT Platform에 등록할 수 있습니다. APIClient를 사용하면 Watson IoT Platform API와의 상호작용이 단순해집니다. APIClient 인스턴스를 가져오려면 다음과 같이 api() 메소드를 호출하십시오.

source: Once you get the handle of APIClient, you can add the devices. Following code snippet shows how to add a device to a Gateway in Watson IoT Platform,
es: Una vez que obtenga el manejador de APIClient, puede añadir los dispositivos. El siguiente fragmento de código muestra cómo añadir un dispositivo a una pasarela en Watson IoT Platform,
fr: Après avoir obtenu le descripteur d'APIClient, vous pouvez ajouter les terminaux. Le fragment de code suivant explique comment ajouter un terminal à une passerelle dans Watson IoT Platform :
ko: APIClient 핸들을 가져온 후에는 디바이스를 추가할 수 있습니다. 다음 코드 스니펫은 Watson IoT Platform에서 게이트웨이에 디바이스를 추가하는 방법을 보여줍니다.

source: The gwDeviceId and gwDeviceType are the Gateway properties to which this device will be attached to when its registered.
es: gwDeviceId y gwDeviceType son las propiedades de pasarela a las que se adjuntará este dispositivo cuando se registre.
fr: gwDeviceId et gwDeviceType sont les propriétés de passerelle auxquelles ce terminal sera associé lors de son enregistrement.
ko: gwDeviceId 및 gwDeviceType은 등록 시 해당 디바이스가 연결될 게이트웨이 특성입니다.

source: Publishing events
es: Publicación de sucesos
fr: Publication d'événements
ko: 이벤트 공개

source: Events are the mechanism by which Gateways/devices publish data to the Watson IoT Platform. The Gateway/device controls the content of the event and assigns a name for each event it sends.
es: Los sucesos son el mecanismo mediante el cual las pasarelas o los dispositivos publican datos en Watson IoT Platform. La pasarela o el dispositivo controla el contenido del suceso y asigna un nombre para cada suceso que envía.
fr: Les événements constituent le mécanisme selon lequel les passerelles/les terminaux publient des données dans Watson IoT Platform. La passerelle/le terminal contrôle le contenu de l'événement et affecte un nom à chaque événement qu'elle ou il envoie.
ko: 이벤트는 게이트웨이/디바이스가 데이터를 Watson IoT Platform에 공개할 때 사용하는 메커니즘입니다. 게이트웨이/디바이스는 이벤트의 컨텐츠를 제어하고 전송하는 각 이벤트에 대해 이름을 지정합니다.

source: **The Gateway can publish events from itself and on behalf of any device connected via the Gateway**.
es: **La pasarela puede publicar sucesos propios y en nombre de cualquier dispositivo conectado a través de la pasarela**.
fr: **La passerelle peut publier des événements pour elle-même ou pour le compte de tout terminal connecté via la passerelle**.
ko: **게이트웨이는 게이트웨이 자체에서 그리고 게이트웨이를 통해 연결된 모든 디바이스를 대신해 이벤트를 공개할 수 있습니다.**

source: When an event is received by the IBM Watson IoT Platform the credentials of the connection on which the event was received are used to determine from which Gateway the event was sent. With this architecture it is impossible for a Gateway to impersonate another device.
es: Cuando IBM Watson IoT Platform recibe un suceso, se utilizan las credenciales de la conexión en la que se ha recibido el suceso para determinar desde qué pasarela se ha enviado el suceso. Con esta arquitectura es imposible que una pasarela suplante otro dispositivo.
fr: Lorsqu'un événement est reçu par IBM Watson IoT Platform, les données d'identification de la connexion sur laquelle l'événement a été reçu sont utilisées pour déterminer quelle est la passerelle depuis laquelle l'événement a été envoyé. Avec cette architecture, il est impossible pour une passerelle de simuler les droits d'accès d'un autre terminal.
ko: IBM Watson IoT Platform에서 이벤트를 수신하면 이벤트가 수신된 연결의 신임 정보를 사용하여 이벤트를 전송한 게이트웨이를 판별합니다. 이 아키텍처를 사용할 경우 게이트웨이가 다른 디바이스로 위장할 수 없습니다.

source: Events can be published at any of the three `quality of service levels <../messaging/mqtt.html#/>`__ defined by the MQTT protocol. By default events will be published as qos level 0.
es: Los sucesos se pueden publicar en cualquiera de los sucesos de los 'niveles de calidad de servicio <../messaging/mqtt.html#/>`__ definidos por el protocolo MQTT. De forma predeterminada los sucesos se publicarán como qos nivel 0.
fr: Les événements peuvent être publiés à l'aide de l'un des trois `niveaux de qualité de service <../messaging/mqtt.html#/>`__ définis par le protocole MQTT. Par défaut, les événements sont publiés au niveau de qualité de service 0.
ko: 이벤트는 MQTT 프로토콜에서 정의한 세 가지 `서비스 품질(QoS) 레벨 <../messaging/mqtt.html#/>`__에서 공개될 수 있습니다. 기본적으로 이벤트는 qos 레벨 0으로 공개됩니다.

source: Publish Gateway event using default quality of service
es: Publicar suceso de pasarela utilizando calidad de servicio predeterminada
fr: Publication d'un événement de passerelle avec la qualité de service par défaut
ko: 기본 서비스 품질(QoS)을 사용하여 Gateway 이벤트 공개

source: Publish Gateway event using user-defined quality of service
es: Publicar suceso de pasarela utilizando calidad de servicio definida por el usuario
fr: Publication d'un événement de passerelle avec la qualité de service définie par l'utilisateur
ko: 사용자 정의 서비스 품질(QoS)을 사용하여 Gateway 이벤트 공개

source: Events can be published at higher MQTT quality of service levels, but these events may take slower than QoS level 0, because of the extra confirmation of receipt.
es: Los sucesos se pueden publicar a niveles de calidad de servicio MQTT más altos, pero es posible que estos sucesos vayan más lentos que el nivel de QoS 0, debido a la confirmación adicional de recepción.
fr: Les événements peuvent être publiés à des niveaux de qualité de service MQTT plus élevés mais la publication de ces événements risque de prendre plus temps qu'avec la qualité de service 0 en raison du délai nécessaire pour obtenir la confirmation de la réception.
ko: 이벤트는 더 높은 MQTT 서비스 품질(QoS) 레벨에서 공개될 수 있지만 이러한 이벤트는 별도의 수신 확인으로 인해 QoS 레벨 0보다 느릴 수 있습니다.

source: Publishing events from devices
es: Publicación de sucesos desde dispositivos
fr: Publication d'événements à partir de terminaux
ko: 디바이스의 이벤트 공개

source: The Gateway can publish events on behalf of any device connected via the Gateway by passing the appropriate typeId and deviceId based on the origin of the event:
es: La pasarela puede publicar sucesos en nombre de cualquier dispositivo conectado a través de la pasarela pasando el typeID y el deviceId apropiados basándose en el origen del suceso:
fr: La passerelle peut publier des événements pour le compte de tout terminal connecté via la passerelle en transmettant les éléments typeId et deviceId appropriés en fonction de l'origine de l'événement :
ko: 게이트웨이는 이벤트 출처를 기반으로 적합한 typeId 및 deviceId를 전달하여 게이트웨이를 통해 연결된 모든 디바이스를 대신해 이벤트를 공개할 수 있습니다.

source: One can use the overloaded publishDeviceEvent() method to publish the device event in the desired quality of service. Refer to `MQTT Connectivity for Gateways <https://docs.internetofthings.ibmcloud.com/gateways/mqtt.html>`__ documentation to know more about the topic structure used.
es: Se puede utilizar el método publishDeviceEvent() sobrecargado para publicar el suceso de dispositivo en la calidad de servicio deseada. Consulte la documentación de `Conectividad de MQTT para pasarelas <https://docs.internetofthings.ibmcloud.com/gateways/mqtt.html>`__ para obtener más información sobre la estructura de tema utilizada.
fr: Vous pouvez utiliser la méthode publishDeviceEvent() surchargée afin de publier l'événement de terminal avec la qualité de service de votre choix. Consultez la documentation `Connectivité MQTT pour les passerelles <https://docs.internetofthings.ibmcloud.com/gateways/mqtt.html>`__ pour en savoir plus sur la structure des sujets utilisée.
ko: overloaded publishDeviceEvent() 메소드를 사용하여 원하는 서비스 품질(QoS)로 디바이스 이벤트를 공개할 수 있습니다. 사용된 주제 구조에 대한 자세한 내용은 `게이트웨이를 위한 MQTT 연결 <https://docs.internetofthings.ibmcloud.com/gateways/mqtt.html>`__ 문서를 참조하십시오.

source: Handling commands
es: Manejo de mandatos
fr: Traitement des commandes
ko: 명령 처리

source: The Gateway can subscribe to commands directed at the gateway itself and to any device connected via the gateway. When the Gateway client connects, it automatically subscribes to any commands for this Gateway. But to subscribe to any commands for the devices connected via the Gateway, use one of the overloaded subscribeToDeviceCommands() method, for example,
es: La pasarela se puede suscribir a mandatos dirigidos a la propia pasarela y a cualquier dispositivo conectado a través de la pasarela. Cuando el cliente de pasarela se conecta, se suscribe automáticamente a los mandatos para esta pasarela. Pero para suscribirse a los mandatos para los dispositivos conectados a través de la pasarela, utilice uno de los métodos subscribeToDeviceCommands() sobrecargados, por ejemplo,
fr: La passerelle peut s'abonner à des commandes qui lui sont envoyées directement et qui sont envoyées à tout terminal connecté via la passerelle. Lorsque le client de passerelle se connecte, il s'abonne automatiquement aux commandes pour cette passerelle. Toutefois, afin de vous abonner à des commandes pour les terminaux connectés via la passerelle, utilisez la méthode subscribeToDeviceCommands() surchargée, par exemple :
ko: 게이트웨이는 게이트웨이 자체 및 게이트웨이를 통해 연결된 모든 디바이스에 전달되는 명령을 구독할 수 있습니다. 게이트웨이 클라이언트가 연결되면 해당 게이트웨이에 대한 명령을 자동으로 구독합니다. 그러나 게이트웨이를 통해 연결된 디바이스에 대한 명령을 구독하려면 오버로드된 ubscribeToDeviceCommands() 메소드 중 하나를 사용하십시오. 예를 들면 다음과 같습니다.

source: To process specific commands you need to register a command callback method. The messages are returned as an instance of the Command class which has the following properties:
es: Para procesar mandatos específicos, necesita registrar un método de devolución de llamada de mandato. Los mensajes se devuelven como una instancia de la clase de mandato que tiene las propiedades siguientes:
fr: Pour traiter des commandes, vous devez enregistrer une méthode de rappel de commande. Les messages sont renvoyés sous la forme d'une instance de la classe Command dotée des propriétés suivantes :
ko: 특정 명령을 처리하려면 명령 콜백 메소드를 등록해야 합니다. 메시지는 다음과 같은 특성을 가진 명령 클래스의 인스턴스로 리턴됩니다.

source: deviceType - The device type for which the command is received.
es: deviceType - Tipo de dispositivo para el que se recibe el mandato.
fr: deviceType - Type de terminal pour lequel la commande est reçue.
ko: deviceType - 명령이 수신된 디바이스 유형입니다.

source: deviceId - The device id for which the command is received, Could be the Gateway or any device connected via the Gateway.
es: deviceId - ID de dispositivo para el que se recibe el mandato. Puede ser la pasarela o cualquier dispositivo conectado a través de la pasarela.
fr: deviceId - ID terminal pour lequel la commande est reçue. Il peut s'agir de la passerelle ou de tout terminal connecté via la passerelle.
ko: deviceId - 명령이 수신된 디바이스 ID로, 게이트웨이 또는 게이트웨이를 통해 연결된 디바이스일 수 있습니다.

source: payload - The command payload.
es: payload - Carga útil de mandato.
fr: payload - Contenu de la commande.
ko: payload - 명령 페이로드입니다.

source: format - The format of the command payload, currently only JSON format is supported in the Java Client Library.
es: format - Formato de la carga útil de mandato, actualmente solo se soporta el formato JSON en la biblioteca de cliente Java.
fr: format - Format du contenu de la commande ; actuellement, seul le format JSON est pris en charge dans la bibliothèque client Java.
ko: format - 명령 페이로드의 형식입니다. 현재는 Java 클라이언트 라이브러리에서 JSON 형식만 지원됩니다.

source: command - The name of the command.
es: command - Nombre del mandato.
fr: command - Nom de la commande.
ko: command - 명령 이름입니다.

source: timestamp - The org.joda.time.DateTime when the command is sent.
es: timestamp - org.joda.time.DateTime cuando se envía el mandato.
fr: timestamp - org.joda.time.DateTime lorsque la commande est envoyée.
ko: timestamp - 명령이 전송될 당시의 org.joda.time.DateTime입니다.

source: A sample implementation of the Command callback is shown below,
es: A continuación se muestra una implementación de ejemplo de la devolución de llamada de mandato,
fr: Vous trouverez ci-dessous un exemple d'implémentation de rappel de commande :
ko: 명령 콜백의 샘플 구현은 다음과 같습니다.

source: Once the Command callback is added to the GatewayClient, the processCommand() method is invoked whenever any command is published on the subscribed criteria, The following snippet shows how to add the command call back into GatewayClient instance,
es: Una vez añadida la devolución de llamada de mandato a GatewayClient, se invoca el método processCommand() siempre que se publica cualquier mandato en los criterios suscritos. El siguiente fragmento de código muestra cómo añadir la devolución de llamada de mandato a la instancia GatewayClient,
fr: Une fois le rappel de commande ajouté à l'instance de client de passerelle (GatewayClient), la méthode processCommand() est appelée à chaque fois qu'une commande est publiée sur les critères d'abonnement. Le fragment suivant explique comment ajouter le rappel de commande dans l'instance de client de passerelle (GatewayClient) :
ko: 명령 콜백이 GatewayClient에 추가되면 명령이 구독된 기준에 공개될 때마다 processCommand() 메소드가 호출됩니다. 다음 스니펫은 GatewayClient 인스턴스에 명령 콜백을 추가하는 방법을 보여줍니다.

source: Overloaded methods are available to control the command subscription.
es: Hay disponibles métodos sobrecargados para controlar la suscripción de mandatos.
fr: Des méthodes surchargées sont disponibles pour contrôler l'abonnement aux commandes.
ko: 명령 구독을 제어하는 데 과부하된 메소드를 사용할 수 있습니다.

source: List Devices Connected through the Gateway
es: Listar dispositivos conectados mediante la pasarela
fr: Liste des terminaux connectés via la passerelle
ko: 게이트웨이를 통해 연결된 디바이스 나열

source: Invoke the method getDevicesConnectedThroughGateway() to retrieve all devices that are connected through the specified gateway(typeId, deviceId) to Watson IoT Platform:
es: Invoque el método getDevicesConnectedThroughGateway() para recuperar todos los dispositivos que están conectados mediante el gateway(typeId, deviceId) especificado a Watson IoT Platform:
fr: Appelez la méthode getDevicesConnectedThroughGateway() pour extraire tous les terminaux qui sont connectés via la passerelle spécifiée (typeId, deviceId) dans Watson IoT Platform :
ko: getDevicesConnectedThroughGateway() 메소드를 호출하여 지정된 게이트웨이(typeId, deviceId)를 통해 Watson IoT Platform에 연결된 모든 디바이스를 검색하십시오.

source: Examples
es: Ejemplos
fr: Exemples
ko: 예제

source: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-gateway-samples/tree/master/java/gateway-samples>`__ - This Java project contains 3 samples, which will help one to connect their own Gateway and devices behind the Gateway to IBM Watson Internet of Things Platform. All the samples use the Java Client Library for IBM Watson IoT Platform, that simplifies the Gateway interactions with the Platform.
es: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-gateway-samples/tree/master/java/gateway-samples>`__ - Este proyecto Java contiene 3 ejemplos, que que ayudarán al usuario a conectar su propia pasarela y los dispositivos tras dicha pasarela a IBM Watson Internet of Things Platform. Todos los ejemplos utilizan la biblioteca de cliente Java para IBM Watson IoT Platform, lo que simplifica las interacciones de la pasarela con la plataforma.

source: Recipes
es: Recetas
