Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java_managedgateway.po
Languages: es, fr, ko

source: The complete code can be found in the device management sample `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
es: El código completo se puede encontrar en el ejemplo de gestión del dispositivo `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
fr: Le code complet est présenté dans l'exemple de gestion des terminaux `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
ko: 전체 코드는 디바이스 관리 샘플 `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__에서 찾을 수 있습니다.

source: **2.2 Sample implementation of handleFactoryReset**
es: **2.2 Implementación de muestra de handleFactoryReset**
fr: **2.2 Exemple d'implémentation de handleFactoryReset**
ko: **2.2 handleFactoryReset의 샘플 구현**

source: The implementation must create a separate thread and add a logic to reset the gateway/attached device to factory settings and report the status of the reset via DeviceAction object. Upon receiving the request, the gateway first needs to inform the server about the support(or failure) before proceeding with the actual reset. The skeleton of the Factory Reset implementation is shown below:
es: La implementación debe crear un subproceso distinto y añadir una lógica para restablecer la pasarela o el dispositivo conectado a sus valores de fábrica e informar sobre el estado del restablecimiento a través del objeto DeviceAction. Tras recibir la solicitud, la pasarela debe informar al servidor acerca del soporte (o de su ausencia) antes de continuar con el restablecimiento en sí. A continuación se muestra un resumen de la implementación del restablecimiento de los valores de fábrica:
fr: L'implémentation doit créer une unité d'exécution distincte et ajouter une logique permettant de restaurer les paramètres d'usine de la passerelle/du terminal connecté et de signaler le statut de la restauration via l'objet DeviceAction. Une fois la demande reçue, la passerelle doit d'abord signaler au serveur la prise en charge (ou l'échec) avant de procéder à la restauration. Le squelette de l'implémentation de restauration des paramètres d'usine est affiché ci-dessous :
ko: 구현에서는 별도의 스레드를 작성하고 게이트웨이/접속된 디바이스를 팩토리 설정으로 재설정하고 DeviceAction 오브젝트를 통해 재설정 상태를 보고하는 로직을 추가해야 합니다. 요청을 수신하면 실제 재설정을 진행하기 전에 먼저 게이트웨이가 서버에 지원(또는 실패)에 대해 알려야 합니다. 팩토리 재설정 구현의 스켈레톤은 다음과 같습니다.

source: **3. Add the handler to ManagedGateway**
es: **3. Añadir el manejador a ManagedGateway**
fr: **3. Ajouter le gestionnaire à ManagedGateway**
ko: **3. ManagedGateway에 핸들러 추가**

source: The created handler needs to be added to the ManagedGateway instance so that the WIoTP client library invokes the corresponding method when there is a device action request for this gateway or attached devices, from IBM Watson Internet of Things Platform.
es: El manejador creado se debe añadir a la instancia de ManagedGateway para que la biblioteca de cliente de WIoTP invoque el método correspondiente cuando se produzca una solicitud de acción de dispositivo para esta pasarela o los dispositivos conectados desde IBM Watson Internet of Things Platform.
fr: Le gestionnaire créé doit être ajouté à l'instance ManagedGateway afin que la bibliothèque client WIoTP appelle la méthode correspondante lorsqu'une demande d'action sur le terminal pour cette passerelle ou les terminaux connectés est émise depuis IBM Watson Internet of Things Platform.
ko: IBM Watson Internet of Things Platform에서 제공하는 이 게이트웨이 또는 접속된 디바이스에 대한 디바이스 조치 요청이 있는 경우 WIoTP 클라이언트 라이브러리가 해당 메소드를 호출하도록, 작성된 핸들러를 ManagedGateway 인스턴스에 추가해야 합니다.

source: Refer to `this page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/device-actions-reboot#device-actions-reboot>`__ for more information about the Device Action.
es: Consulte `esta página <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/device-actions-reboot#device-actions-reboot>`__ para obtener más información sobre la acción de dispositivo.
fr: Voir `cette page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/device-actions-reboot#device-actions-reboot>`__ pour plus d'informations sur l'action sur le terminal.
ko: 디바이스 조치에 대한 자세한 정보는 `이 페이지 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/device-actions-reboot#device-actions-reboot>`__의 내용을 참조하십시오.

source: Listen for Device attribute changes
es: Escuchar cambios de los atributos del dispositivo
fr: Ecouter les modifications de l'attribut Device
ko: 디바이스 속성 변경 청취

source: This WIoTP client library updates the corresponding objects whenever there is an update request from the IBM Watson Internet of Things Platform, these update requests are initiated by the application either directly or indirectly (Firmware Update) via the IBM Watson Internet of Things Platform ReST API. Apart from updating these attributes, the library provides a mechanism where the gateway can be notified whenever a device attribute is updated.
es: Esta biblioteca de cliente de WIoTP actualiza los objetos correspondientes cuando se produce una solicitud de actualización desde IBM Watson Internet of Things Platform; estas solicitudes las inicia la aplicación de manera directa o indirecta (actualización del firmware) a través de la API REST de IBM Watson Internet of Things Platform. Además de actualizar estos atributos, la biblioteca proporciona un mecanismo con el que se puede notificar a la pasarela cuando se actualice un atributo del dispositivo.
fr: Cette bibliothèque client WIoTP met à jour les objets correspondants à chaque fois qu'une demande de mise à jour est émise depuis IBM Watson Internet of Things Platform. Ces demandes de mise à jour sont lancées par l'application directement ou indirectement (Mettre à jour le microprogramme) via l'API REST d'IBM Watson Internet of Things Platform. Hormis la mise à jour de ces attributs, la bibliothèque fournit un mécanisme qui permet de notifier la passerelle à chaque fois qu'un attribut de terminal est mis à jour.
ko: 이 WIoTP 클라이언트 라이브러리는 IBM Watson Internet of Things Platform의 업데이트 요청이 있을 때마다 해당 오브젝트를 업데이트하며, 이러한 업데이트 요청은 직접 또는 IBM Watson Internet of Things Platform REST API를 통해 간접적으로(펌웨어 업데이트) 애플리케이션에서 시작됩니다. 이러한 속성의 업데이트 외에 라이브러리는 디바이스 속성이 업데이트될 때마다 게이트웨이에 알릴 수 있는 메커니즘을 제공합니다.

source: Attributes that can be updated by this operation are location, metadata, device information and firmware of the gateway/attached devices.
es: Los atributos que se pueden actualizar mediante esta operación son la ubicación, los metadatos, la información y el firmware de dispositivo, tanto de la pasarela como del dispositivo conectado.
fr: Les attributs qui peuvent être mis à jour par cette opération sont l'emplacement, les métadonnées, les informations sur le terminal et le microprogramme de la passerelle/des terminaux connectés.
ko: 이 오퍼레이션에서 업데이트될 수 있는 속성은 위치, 메타데이터, 디바이스 정보 및 게이트웨이/접속된 디바이스의 펌웨어입니다.

source: In order to get notified, the gateway needs to add a property change listener on those objects that it is interested.
es: Para recibir la notificación, la pasarela debe añadir un escucha de cambio de propiedades a los objetos que le interesen.
fr: Pour recevoir une notification, la passerelle doit ajouter un programme d'écoute des modifications de propriétés sur les objets qui l'intéressent.
ko: 알림을 받으려면 게이트웨이는 관심이 있는 오브젝트에서 특성 변경 리스너를 추가해야 합니다.

source: Also, the gateway needs to implement the propertyChange() method where it receives the notification. A sample implementation is as follows:
es: Además, la pasarela debe implementar el método propertyChange() en el que recibe la notificación. A continuación, se incluye una implementación de muestra:
fr: De plus, la passerelle doit implémenter la méthode propertyChange() à l'endroit où elle reçoit la notification. Un exemple d'implémentation est présenté ci-dessous :
ko: 또한 게이트웨이는 알림을 받은 경우 propertyChange() 메소드를 구현해야 합니다. 샘플 구현은 다음과 같습니다.

source: Refer to `this page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-device-attributes#update-device-attributes>`__ for more information about updating the device attributes.
es: Consulte `esta página <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-device-attributes#update-device-attributes>`__ para obtener más información sobre los atributos de dispositivo.
fr: Voir `cette page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-device-attributes#update-device-attributes>`__ pour plus d'informations sur la mise à jour des attributs de terminal.
ko: 디바이스 속성 업데이트에 대한 자세한 정보는 `이 페이지 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-device-attributes#update-device-attributes>`__의 내용을 참조하십시오.

source: Examples
es: Ejemplos
fr: Exemples
ko: 예제

source: `ManagedRasPiGateway <https://github.com/ibm-messaging/gateway-samples/blob/master/java/gateway-samples/src/main/java/com/ibm/iotf/sample/client/gateway/devicemgmt/ManagedRasPiGateway.java>`__ - Gateway Device Management(DM) capabilities are demonstrated in this sample by managing the Arduino Uno device through the Raspberry Pi Gateway. If you do not have Raspberry Pi and Arduino UNO, don’t worry, you can still follow the sample to connect your device as a gateway and manage one or more attached devices.
es: `ManagedRasPiGateway <https://github.com/ibm-messaging/gateway-samples/blob/master/java/gateway-samples/src/main/java/com/ibm/iotf/sample/client/gateway/devicemgmt/ManagedRasPiGateway.java>`__ - En este ejemplo se muestran las prestaciones de gestión de datos (DM) de la pasarela mediante la gestión del dispositivo Arduino Uno a través de la pasarela Raspberry Pi. Si no dispone de Raspberry Pi y Arduino UNO, no se preocupe: igualmente podrá seguir el ejemplo para conectar una pasarela y gestionar uno o más dispositivos gestionados.
fr: `ManagedRasPiGateway <https://github.com/ibm-messaging/gateway-samples/blob/master/java/gateway-samples/src/main/java/com/ibm/iotf/sample/client/gateway/devicemgmt/ManagedRasPiGateway.java>`__ - Les fonctions de gestion des terminaux de passerelle sont présentées dans cet exemple par le biais de la gestion du terminal Arduino Uno via la passerelle Raspberry Pi. Si vous ne disposez pas de Raspberry Pi ni d'Arduino UNO, ne vous inquiétez pas. Vous pouvez tout de même suivre l'exemple pour connecter votre terminal en tant que passerelle et gérer un ou plusieurs terminaux connectés.
ko: `ManagedRasPiGateway <https://github.com/ibm-messaging/gateway-samples/blob/master/java/gateway-samples/src/main/java/com/ibm/iotf/sample/client/gateway/devicemgmt/ManagedRasPiGateway.java>`__ - 게이트웨이 디바이스 관리(DM) 기능은 Raspberry Pi 게이트웨이를 통해 Arduino Uno 디바이스를 관리함으로써 이 샘플에서 설명합니다. Raspberry Pi 및 Arduino UNO가 없는 경우에도 샘플에 따라 사용자의 디바이스를 게이트웨이로 연결하고 하나 이상의 접속된 디바이스를 관리할 수 있습니다.

source: `HomeGatewaySample <https://github.com/ibm-messaging/gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/HomeGatewaySample.java>`__ - A home gateway sample that manages few attached home devices like, Lights, Switches, Elevator, Oven and OutdoorTemperature.
es: `HomeGatewaySample <https://github.com/ibm-messaging/gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/HomeGatewaySample.java>`__ - Un ejemplo de una pasarela casera que gestiona unos cuantos dispositivos conectados de la casa, como luces, interruptores, el ascensor, el horno y la temperatura exterior.
fr: `HomeGatewaySample <https://github.com/ibm-messaging/gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/HomeGatewaySample.java>`__ - Exemple de passerelle d'accueil qui gère quelques terminaux d'accueil connectés tels que Lights, Switches, Elevator, Oven et OutdoorTemperature.
ko: `HomeGatewaySample <https://github.com/ibm-messaging/gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/HomeGatewaySample.java>`__ - 몇 개의 접속된 홈 디바이스(조명, 스위치, 엘리베이터, 오븐 및 실외 온도 등)를 관리하는 홈 게이트웨이 샘플입니다.

source: `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ - A sample implementation of FirmwareHandler.
es: `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ - Un ejemplo de implementación de FirmwareHandler.
fr: `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ - Exemple d'implémentation de FirmwareHandler.
ko: `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ - FirmwareHandler의 샘플 구현입니다.

source: `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ - A sample implementation of DeviceActionHandler.
es: `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ - Un ejemplo de implementación de DeviceActionHandler.
fr: `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ - Exemple d'implémentation de DeviceActionHandler.
ko: `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ - DeviceActionHandler의 샘플 구현입니다.

source: Recipe
es: Receta
fr: Recette
ko: 지침서

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ that shows how to connect Raspberry Pi as Managed Gateway to IBM Watson IoT Platform and manage the attached devices. For example, update Arduino Uno device with a new sketch program, reboot Arduino Uno using the Watson IoT Platform device management protocol and etc..
es: Consulte `la receta <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ que muestra cómo conectar Raspberry Pi como pasarela gestionada a IBM Watson IoT Platform y gestionar los dispositivos conectados. Por ejemplo, podrá actualizar el dispositivo Arduino Uno con un nuevo programa de esquema, rearrancar Arduino Uno mediante el protocolo de gestión de dispositivos de Watson IoT Platform, etc.
fr: Voir `la recette <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ qui explique comment connecter Raspberry Pi en tant que passerelle gérée à IBM Watson IoT Platform et gérer les terminaux connectés. Par exemple, mettez à jour le terminal Arduino Uno avec un nouveau programme d'esquisse, réamorcez Arduino Uni avec le protocole de gestion des terminaux Watson IoT Platform, etc.
ko: Raspberry Pi를 관리 게이트웨이로 IBM Watson IoT Platform에 연결하고 접속된 디바이스를 관리하는 방법을 보여주는 `지침서 <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__의 내용을 참조하십시오. 예를 들어, 새 스케치 프로그램을 사용하여 Arduino Uno 디바이스를 업데이트하고 Watson IoT Platform 디바이스 관리 프로토콜을 사용하여 Arduino Uno를 다시 부팅하십시오.
