Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/mqtt.po
Languages: es, fr, ko

source: Request_Type: Either publish or subscribe
es: Request_Type: Será publish o subscribe.
fr: Request_Type : publish ou subscribe
ko: Request_Type: 공개 또는 구독

source: Timestamp: Time in ISO 8601 Format
es: Timestamp: La hora en formato ISO 8601.
fr: Timestamp : heure au format ISO 8601
ko: Timestamp: ISO 8601 형식의 시간

source: Topic: The request topic from the gateway
es: Topic: El tema solicitado por la pasarela.
fr: Topic : sujet de demande de la passerelle
ko: Topic: 게이트웨이의 요청 주제

source: Device_Type: The device type from the topic
es: Device_Type: El tipo de dispositivo del tema.
fr: Device_Type : type de terminal du sujet
ko: Device_Type: 주제의 디바이스 유형

source: Device_Id: The device id from the topic
es: Device_Id: El ID de dispositivo del tema.
fr: Device_Id : ID de terminal du sujet
ko: Device_Id: 주제의 디바이스 ID

source: ClientID: The client id of the request
es: ClientID: El ID de cliente de la solicitud.
fr: ClientID : ID client de la demande
ko: ClientID: 요청의 클라이언트 ID

source: RC: The return code
es: RC: El código de retorno.
fr: RC : code retour
ko: RC: 리턴 코드

source: Message: The error message
es: Message: El mensaje de error.
fr: Message : message d'erreur
ko: Message: 오류 메시지

source: Notifications a gateway may receive:
es: Notificaciones que puede recibir una pasarela:
fr: Notifications qu'une passerelle peut recevoir :
ko: 게이트웨이가 받을 수 있는 알림:

source: Topic does not match with any allowed topic rules.
es: El tema no coincide con ninguna regla de tema permitida.
fr: Le sujet ne correspond à aucune règle de sujet autorisée.
ko: 주제가 허용되는 주제 규칙과 일치하지 않습니다.

source: Device type is not valid.
es: El tipo de dispositivo no es válido.
fr: Le type de terminal n'est pas valide.
ko: 디바이스 유형이 올바르지 않습니다.

source: Device id is not valid.
es: El dispositivo no es válido.
fr: L'ID de terminal n'est pas valide.
ko: 디바이스 ID가 올바르지 않습니다.

source: Maximum number of devices per gateway has been reached.
es: Se ha alcanzado el número máximo de dispositivos por pasarela.
fr: Le nombre maximal de terminaux par passerelle a été atteint.
ko: 게이트웨이당 디바이스의 최대수에 도달했습니다.

source: Maximum number of devices per organization has been reached.
es: Se ha alcanzado el número máximo de dispositivos por organización.
fr: Le nombre maximal de terminaux par organisation a été atteint.
ko: 조직당 디바이스의 최대수에 도달했습니다.

source: Failed to create device due to internal errors.
es: Se ha encontrado un error en la creación del dispositivo debido a errores internos.
fr: Echec de la création du terminal en raison d'erreurs internes.
ko: 내부 오류로 인해 디바이스 작성에 실패했습니다.

source: Managed Gateways
es: Pasarelas gestionadas
fr: Passerelles gérées
ko: 관리 게이트웨이

source: Support for device lifecycle management is optional, the device management protocol used by IoT Platform utilises the same MQTT connection that your gateway already uses for events and command control.
es: El soporte de la gestión del ciclo de vida de los dispositivos es opcional; el protocolo de gestión de dispositivos utilizado por IoT Platform emplea la misma conexión MQTT que su pasarela usa ya para los sucesos y el control de mandatos.
fr: La prise en charge de la gestion du cycle de vie des terminaux est facultative. Le protocole de gestion des terminaux utilisé par IoT Platform se sert de la même connexion MQTT que celle qu'utilise déjà votre passerelle pour les événements et le contrôle des commandes.
ko: 디바이스 라이프사이클 관리에 대한 지원은 선택적입니다. IoT Platform에서 사용하는 디바이스 관리 프로토콜은 게이트웨이가 이벤트 및 명령 제어에 이미 사용하고 있는 것과 동일한 MQTT 연결을 사용합니다.

source: Quality of Service Levels and Clean Session
es: Niveles de calidad de servicio y limpieza de sesiones
fr: Niveaux de qualité de service et option 'clean session'
ko: 서비스 품질(QoS) 레벨 및 정리 세션

source: Managed gateways can publish messages with Quality of Service (QoS) level of 0 or 1. If QoS 1 is used, messages from the gateway will be queued if necessary. Messages from the gateway must not be retained messages.
es: Las pasarelas gestionadas pueden publicar mensajes con el nivel de calidad de servicio (QoS) de 0 o 1. Si se utiliza QoS 1, los mensajes de la pasarela se pondrán en cola si es necesario. Los mensajes de la pasarela no debe ser mensajes retenidos.
fr: Les passerelles gérées peuvent publier des messages en utilisant le niveau de qualité de service (QoS) 0 ou 1. Si la qualité de service 0 est utilisée, les messages de la passerelle sont mis en file d'attente, si nécessaire. Les messages de la passerelle ne doivent pas être des messages conservés.
ko: 관리 게이트웨이는 서비스 품질(QoS) 레벨이 0 또는 1인 메시지를 공개할 수 있습니다. QoS 1을 사용하면 필요한 경우 게이트웨이의 메시지가 큐에 저장됩니다. 게이트웨이의 메시지는 보관된 메시지가 아니어야 합니다.

source: The IoT Platform publishes requests with a QoS level of 1 to support queuing of messages. In order to queue messages sent while a managed gateway is not connected, the device should use ``cleansession=false``.
es: IoT Platform publica solicitudes con un nivel de QoS 1 para permitir que los mensajes se pongan en cola. Para poner en cola mensajes mientras una pasarela gestionada no está conectada, esta debe utilizar ``cleansession=false``.
fr: IoT Platform publie des demandes en utilisant le niveau de qualité de service 1 pour prendre en charge la mise en file d'attente des messages. Pour mettre en file d'attente les messages envoyés lorsqu'une passerelle gérée n'est pas connectée, le terminal doit utiliser ``cleansession=false``.
ko: IoT Platform은 메시지의 큐 저장을 지원하기 위해 QoS 레벨이 1인 요청을 공개합니다. 관리 게이트웨이가 연결되지 않은 동안 전송된 메시지를 큐에 저장하려면 디바이스가 ``cleansession=false``를 사용해야 합니다.

source: If your managed gateway uses a durable subscription (cleansession=false) you need to be aware that device management commands sent to your gateway while it is offline will be reported as failed operations, however, when the gateway later connects those requests will be actioned by the gateway.
es: Si la pasarela gestionada utiliza una suscripción duradera (cleansession=false), es necesario saber qué mandatos de gestión de dispositivos enviados a la pasarela mientras esta se encuentre fuera de línea se comunicarán como operaciones erróneas; sin embargo, cuando la pasarela se conecte posteriormente, efectuará las acciones requeridas por dichas solicitudes.
fr: Si votre passerelle gérée utilise un abonnement durable (cleansession=false), vous devez tenir compte du fait que les commandes de gestion des terminaux envoyées à votre passerelle alors qu'elle est hors ligne seront signalées comme ayant échoué. Toutefois, après sa connexion, la passerelle activera ces demandes.
ko: 관리 게이트웨이가 지속적 구독(cleansession=false)을 사용하는 경우, 오프라인인 상태에서 게이트웨이로 전송된 디바이스 관리 명령은 실패한 오퍼레이션으로 보고됩니다. 그러나 게이트웨이가 나중에 연결되면 게이트웨이에서 해당 요청을 처리합니다.

source: When handling failures it is important to take this into account if you are using durable subscriptions for your managed gateways.
es: Al gestionar los errores de las solicitudes, es importante tener esto en cuenta si se utilizan suscripciones duraderas para las pasarelas gestionadas.
fr: Lors du traitement des échecs, il est important de prendre ce fait en compte si vous utilisez des abonnements durables pour vos passerelles gérées.
ko: 관리 게이트웨이에 대해 지속적 구독을 사용하는 경우 실패를 처리할 때 이 점을 고려해야 합니다.

source: Topics
es: Temas
fr: Sujets
ko: 주제

source: A managed gateway is required to subscribe to two topics to handle requests and responses from IoT Platform:
es: Se necesita una pasarela gestionada para suscribirse a dos temas con el fin de gestionar solicitudes y respuestas procedentes de IoT Platform:
fr: Une passerelle gérée doit s'abonner à deux sujets afin de traiter les demandes et les réponses d'IoT Platform :
ko: 관리 게이트웨이는 IoT Platform의 요청과 응답을 처리하기 위해 다음 두 개의 주제를 구독해야 합니다.

source: The managed gateway will subscribe to device management reponses on ``iotdm-1/type/<typeId>/id/<deviceId>/response/+``
es: La pasarela gestionada se suscribirá a las respuestas de gestión de dispositivos en ``iotdm-1/type/<Id_tipo>/id/<Id_dispositivo>/response/+``.
fr: La passerelle gérée va s'abonner aux réponses de gestion des terminaux dans `iotdm-1/type/<typeId>/id/<deviceId>/response/+``
ko: 관리 게이트웨이는 ``iotdm-1/type/<typeId>/id/<deviceId>/response/+``에서 디바이스 관리 응답을 구독합니다.

source: The managed gateway will subscribe to device management requests on ``iotdm-1/type/<typeId>/id/<deviceId>/+``
es: La pasarela gestionada se suscribirá a las solicitudes de gestión de dispositivos en ``iotdm-1/type/<Id_tipo>/id/<Id_dispositivo>/+``.
fr: La passerelle gérée va s'abonner aux demandes de gestion des terminaux dans ``iotdm-1/type/<typeId>/id/<deviceId>/+``
ko: 관리 게이트웨이는 ``iotdm-1/type/<typeId>/id/<deviceId>/+``에서 디바이스 관리 요청을 구독합니다.

source: A managed gateway will publish to two topics:
es: Una pasarela gestionada publicará en dos temas:
fr: Une passerelle gérée va publier des éléments dans deux sujets :
ko: 관리 게이트웨이는 다음 두 개의 주제를 공개합니다.

source: The managed gateway will publish device management responses on ``iotdevice-1/type/<typeId>/id/<deviceId>/response/``
es: La pasarela gestionada publicará las respuestas de gestión de dispositivos en ``iotdevice-1/type/<Id_tipo>/id/<Id_dispositivo>/response/``.
fr: La passerelle gérée va publier des réponses de gestion des terminaux dans ``iotdevice-1/type/<typeId>/id/<deviceId>/response/``
ko: 관리 게이트웨이는 ``iotdevice-1/type/<typeId>/id/<deviceId>/response/``에서 디바이스 관리 응답을 공개합니다.

source: The managed gateway will publish device management requests on ``iotdevice-1/type/<typeId>/id/<deviceId>/``
es: La pasarela gestionada publicará las solicitudes de gestión de dispositivos en ``iotdevice-1/type/<Id_tipo>/id/<Id_dispositivo>/``.
fr: La passerelle gérée va publier des demandes de gestion des terminaux dans ``iotdevice-1/type/<typeId>/id/<deviceId>/``
ko: 관리 게이트웨이는 ``iotdevice-1/type/<typeId>/id/<deviceId>/``에서 디바이스 관리 요청을 공개합니다.

source: The gateway is able to process device management protocol messages for both itself and on behalf other connected devices by using the relevant <typeId> and <deviceId>.
es: La pasarela puede procesar mensajes de gestión de dispositivos tanto para sí misma como en nombre de otros dispositivos conectados mediante el empleo de los <Id_tipo> e <Id_dispositivo> correspondientes.
fr: La passerelle peut traiter des messages de protocole de gestion des terminaux pour elle-même et pour le compte d'autres terminaux connectés à l'aide des valeurs <typeId> et <deviceId> appropriées.
ko: 게이트웨이는 관련 <typeId> 및 <deviceId>를 사용하여 게이트웨이 자체에 대해, 연결된 다른 디바이스를 대신해 디바이스 관리 프로토콜 메시지를 처리할 수 있습니다.

source: Message Format
es: Formato del mensaje
fr: Format du message
ko: 메시지 형식

source: All messages are sent in JSON format. There are two types of message.
es: Todos los mensajes se envían en formato JSON. Hay dos tipos de mensaje.
fr: Tous les messages sont envoyés au format JSON. Il existe deux types de message.
ko: 모든 메시지는 JSON 형식으로 전송됩니다. 2개 유형의 메시지가 있습니다.

source: Request
es: Solicitud
fr: Demande
ko: 요청

source: Requests are formatted as follows:
es: Debe aplicarse el siguiente formato a las solicitudes:
fr: Les demandes sont formatées de la manière suivante :
ko: 요청은 다음과 같이 형식화됩니다.

source: ``d`` carries any data relevant to the request
es: ``d`` transporta todos los datos relevantes para la solicitud.
fr: ``d`` contient les données relatives à la demande
ko: ``d``는 요청과 관련된 모든 데이터를 운반합니다.

source: ``reqId`` is an identifier of the request, and must be copied into a response. If a response is not required, the field should be omitted.
es: ``reqId`` es un identificador de la solicitud y debe copiarse en una respuesta. Si no se necesita ninguna respuesta, este campo debe omitirse.
fr: ``reqId`` est l'identificateur de la demande et doit être copié dans la réponse. Si aucune réponse n'est requise, la zone doit être omise.
ko: ``reqId``는 요청 ID이며, 응답에 복사되어야 합니다. 응답이 필요하지 않은 경우 필드를 생략해야 합니다.

source: Response
es: Respuesta
fr: Réponse
ko: 응답

source: Responses are formatted as follows:
es: Debe aplicarse el siguiente formato a las respuestas:
fr: Les réponses sont formatées de la manière suivante :
ko: 응답은 다음과 같이 형식화됩니다.

source: "rc" is a result code of the original request.
es: "rc" es un código de resultado de la solicitud original.
fr: "rc" est le code de résultat de la demande d'origine.
ko: "rc"는 원래 요청의 결과 코드입니다.

source: ``message`` is an optional element with a text description of the response code.
es: ``message`` es un elemento opcional con una descripción de texto del código de respuesta.
fr: ``message`` est un élément facultatif contenant la description textuelle du code de réponse.
ko: ``message``는 응답 코드에 대한 텍스트 설명이 포함된 선택적 요소입니다.

source: ``d`` is an optional data element accompanying the response.
es: ``d`` es un elemento de datos opcional que acompaña a la respuesta.
fr: ``d`` est un élément de données facultatif accompagnant la réponse.
ko: ``d``는 응답을 동반하는 선택적 데이터 요소입니다.

source: ``reqId`` is the request ID of the original request. This is used to correlate responses with requests, and the device needs to ensure that all request IDs are unique. When responding to IoT Platform requests, the correct ``reqId`` value must be sent in the response.
es: ``reqId`` es el ID de solicitud de la solicitud original. Se utiliza para correlacionar las respuestas con las solicitudes y el dispositivo debe asegurarse de que todos los ID de solicitud sean exclusivos. Cuando se responde a las solicitudes de IoT Platform, en la respuesta debe enviarse el valor ``reqId`` correcto.
fr: ``reqId`` est l'ID de demande de la demande d'origine. Il est utilisé pour corréler les réponses aux demandes et le terminal doit s'assurer que tous les ID de demande sont uniques. Dans le cas d'une réponse à des demandes IoT Platform, la valeur ``reqId`` correcte doit être envoyée dans la réponse.
ko: ``reqId``는 원래 요청의 요청 ID입니다. 응답을 요청과 상관시키는 데 사용되고 디바이스에서는 모든 요청 ID가 고유해야 합니다. IoT Platform 요청에 응답하는 경우 올바른 ``reqId`` 값이 응답으로 전송되어야 합니다.
