Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/mqtt.po
Languages: es, fr, ko

source: MQTT Connectivity for Gateways
es: Conectividad de MQTT para pasarelas
fr: Connectivité MQTT pour les passerelles
ko: 게이트웨이를 위한 MQTT 연결

source: MQTT client connection
es: Conexión de cliente MQTT
fr: Connexion client MQTT
ko: MQTT 클라이언트 연결

source: Every registered organization has a unique endpoint which must be used when connecting MQTT clients for gateways in that organization.
es: Todas las organizaciones registradas tienen un punto final exclusivo que se debe utilizar al conectar clientes MQTT para pasarelas en esa organización.
fr: Chaque organisation enregistrée possède un noeud final unique qui doit être utilisé lors de la connexion des clients MQTT pour les passerelles de cette organisation.
ko: 등록된 모든 조직에는 해당 조직의 게이트웨이에 대해 MQTT 클라이언트를 연결할 때 사용해야 하는 고유 엔드포인트가 있습니다.

source: **org\_id**.messaging.internetofthings.ibmcloud.com
es: **id\_org**.messaging.internetofthings.ibmcloud.com

source: In the IoT Platform dashboard, devices and gateways which are connected directly to the IoT Platform display a status icon indicating that they are connected. The dashboard displays devices which are connected indirectly via a gateway as disconnected as it does not have any knowledge of a devices connectivity to the gateway.
es: En el panel de control IoT Platform, los dispositivos y las pasarelas que se conectan directamente a IoT Platform visualizan un icono de estado que indica que están conectados. El panel de control visualiza dispositivos que se conectan indirectamente a través de una pasarela como desconectados porque no conoce ninguna conectividad de dispositivos a la pasarela.
fr: Dans le tableau de bord IoT Platform, les terminaux et les passerelles qui sont connectés directement à IoT Platform affichent une icône de statut indiquant qu'ils sont connectés. Le tableau de bord affiche les terminaux qui sont connectés indirectement via une passerelle comme déconnectés car il n'a pas connaissance de la connectivité des terminaux à la passerelle.
ko: IoT Platform 대시보드에서 IoT Platform에 직접 연결된 디바이스 및 게이트웨이는 연결됨을 나타내는 상태 아이콘을 표시합니다. 대시보드는 게이트웨이에 대한 디바이스 연결 정보가 없어서 연결이 끊어진 경우 게이트웨이를 통해 간접적으로 연결된 디바이스를 표시합니다.

source: Unencrypted client connection
es: Conexión de cliente no cifrada
fr: Connexion client non chiffrée
ko: 암호화되지 않은 클라이언트 연결

source: Connect on port **1883**
es: Conectar en el puerto **1883**
fr: Connexion sur le port **1883**
ko: 포트 **1883**에서 연결

source: All information your gateway submits is being sent in plain text (including the authentication credentials for your gateway). We recommend the use of an encrypted connection whenever possible.
es: Toda la información que envía la pasarela se envía en texto sin formato (incluidas las credenciales de autenticación de la pasarela). Recomendamos el uso de una conexión cifrada siempre que sea posible.
fr: Toutes les informations soumises par votre passerelle sont envoyées en texte en clair (y compris les données d'authentification pour votre passerelle). Il est recommandé d'utiliser une connexion chiffrée dans la mesure du possible.
ko: 게이트웨이가 제출하는 모든 정보는 일반 텍스트로 전송됩니다(게이트웨이에 대한 인증 신임 정보 포함). 가능할 때마다 암호화된 연결을 사용하는 것이 좋습니다.

source: Encrypted client connection
es: Conexión de cliente cifrada
fr: Connexion client chiffrée
ko: 암호화된 클라이언트 연결

source: Connect on port **8883** or **443** for websockets. In many client libraries you will need to provide the server's public certificate in pem format. The following file contains the entire certificate chain for \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
es: Conéctese al puerto **8883** o **443** en caso de sockets web. En muchas bibliotecas de cliente será necesario proporcionar el certificado público del servidor en formato pem. El archivo siguiente contiene la cadena de certificados entera para \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
fr: Connexion sur le port **8883** ou **443** pour les websockets. Dans la plupart des bibliothèques client, vous devez fournir le certificat public du serveur au format pem. Le fichier suivant contient l'ensemble de la chaîne de certificats de \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
ko: 웹 소켓을 위해 포트 **8883** 또는 **443**에서 연결합니다. 다수의 클라이언트 라이브러리에서 사용자는 pem 형식으로 서버의 공용 인증서를 제공해야 합니다. 다음 파일에는 \*.messaging.internetofthings.ibmcloud.com: messaging.pem에 대한 전체 인증서 체인이 포함되어 있습니다.

source: Some SSL client libraries have been shown to not handle wildcarded domains, in which case, if you can not change libraries, you will need to turn off certificate checking.
es: Se ha mostrado que algunas bibliotecas de cliente SSL no manejan dominios con caracteres comodín, en cuyo caso, si no puede cambiar las bibliotecas, necesitará desactivar la comprobación de certificados.
fr: Certaines bibliothèques client SSL ne traitent pas correctement les domaines associés à des caractères génériques. Dans ce cas, si vous ne pouvez pas changer de bibliothèques, vous devez désactiver la vérification des certificats.
ko: 일부 SSL 클라이언트 라이브러리는 와일드카드 도메인을 처리하지 않는 것으로 표시되었으며 이 경우 라이브러리를 변경할 수 없으면 인증서 확인을 꺼야 합니다.

source: The IoT Platform requires TLS v1.2. We suggest the following cipher suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 or AES128-GCM-SHA256 *(as of Jun 1 2015)*.
es: IoT Platform requiere TLS v1.2. Sugerimos las siguientes suites de cifrado: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 o AES128-GCM-SHA256 *(a partir del 1 de junio de 2015)*.
fr: IoT Platform requiert TLS version 1.2. Il est recommandé d'utiliser les suites de chiffrement suivantes : ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 ou AES128-GCM-SHA256 *(à compter du 1er juin 2015)*.
ko: IoT Platform에는 TLS v1.2가 필요합니다. ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 또는 AES128-GCM-SHA256 암호 스위트를 추천합니다. *(2015년 1월 1일 현재)*

source: MQTT client identifier
es: Identificador de cliente MQTT
fr: Identificateur du client MQTT
ko: MQTT 클라이언트 ID

source: A gateway must authenticate using a client ID in the following format:
es: Una pasarela se debe autenticar mediante un ID de cliente con el formato siguiente:
fr: Une passerelle doit s'authentifier à l'aide d'un ID client au format suivant :
ko: 게이트웨이는 다음 형식의 클라이언트 ID를 사용하여 인증해야 합니다.

source: g:**orgId**:**typeId**:**deviceId**
es: g:**Id_org**:**Id_tipo**:**Id_dispositivo**

source: **g** idenfities your client as a gateway
es: **g** identifica a su cliente como una pasarela.
fr: **g** identifie votre client en tant que passerelle
ko: **g**는 클라이언트를 게이트웨이로 식별합니다.

source: **orgId** is your unique organization ID, assigned when you sign up with the service. It will be a 6 character alphanumeric string.
es: **Id_org** es el ID de organización, asignado al registrarse en el servicio. Será una serie alfanumérica de 6 caracteres.
fr: **orgId** est votre ID organisation unique qui a été affecté lors de votre inscription au service. Il s'agit d'une chaîne alphanumérique de 6 caractères.
ko: **orgId**는 서비스에 등록할 때 지정된 고유한 조직 ID입니다. 이 ID는 6자 영숫자 문자열입니다.

source: **typeId** is intended to be used as an identifier of the type of gateway connecting, it may be useful to think of this as analogous to a model number.
es: **Id_tipo** está concebido para utilizarse como identificador del tipo de pasarela que se conecta; puede resultar útil considerarlo análogo a un número de modelo.
fr: **typeId** doit être utilisé comme identificateur du type de passerelle en cours de connexion. Il peut s'apparenter à un numéro de modèle.
ko: **typeId**는 게이트웨이 연결 유형의 ID로 사용되며, 모델 번호와 유사한 것으로 간주하면 유용할 수 있습니다.

source: **deviceId** must uniquely identify a gateway device across all gateways of a specific type, it may be useful to think of this as analogous to a serial number.
es: **Id_dispositivo** debe identificar de forma exclusiva a una pasarela entre todas las pasarelas de un tipo específico; puede resultar útil considerarlo análogo a un número de serie.
fr: **deviceId** doit identifier de manière unique un terminal de passerelle parmi toutes les passerelles d'un type spécifique. Il peut s'apparenter à un numéro de série.
ko: **deviceId**는 특정 유형의 모든 게이트웨이에서 게이트웨이 디바이스를 고유하게 식별해야 하며, 일련 번호와 비슷한 것으로 간주하면 유용할 수 있습니다.

source: You can use any scheme of your choice when assigning values for ``typeId`` and ``deviceId``, however the following restrictions apply to both:
es: Puede utilizar cualquier esquema de su elección al asignar valores para ``Id_tipo`` e ``Id_dispositivo``; sin embargo, a ambos se les aplican las restricciones siguientes:
fr: Vous pouvez utiliser les schémas de votre choix lorsque vous affectez des valeurs pour ``typeId`` et ``deviceId``. Toutefois, les restrictions suivantes s'appliquent :
ko: ``typeId`` 및 ``deviceId``에 대한 값을 지정할 때 선택한 스킴을 사용할 수 있지만 다음과 같은 제한사항이 둘 다에 적용됩니다.

source: Maximum length of 36 characters
es: Longitud máxima de 36 caracteres
fr: La valeur ne peut pas comporter plus de 36 caractères.
ko: 최대 길이 36자

source: Must comprise only alpha-numeric characters (``a-z``, ``A-Z``, ``0-9``) and the following special characters:
es: Debe constar sólo de caracteres alfanuméricos (``a-z``, ``A-Z``, ``0-9``) y de los siguientes caracteres especiales:
fr: La valeur ne peut comporter que des caractères alphanumériques (``a-z``, ``A-Z``, ``0-9``) et les caractères spéciaux suivants :
ko: 영숫자 문자(``a-z``, ``A-Z``, ``0-9``) 및 다음 특수 문자만 포함해야 함:

source: dash (``-``)
es: guión (``-``)
fr: tiret (``-``)
ko: 대시(``-``)

source: underscore (``_``)
es: subrayado (``_``)
fr: trait de soulignement (``_``)
ko: 밑줄(``_``)

source: dot (``.``)
es: punto (``.``)
fr: point (``.``)
ko: 점(``.``)

source: MQTT authentication
es: Autenticación de MQTT
fr: Authentification MQTT
ko: MQTT 인증

source: Username
es: Nombre de usuario
fr: Nom d'utilisateur
ko: 사용자 이름

source: The service currently only supports token-based authentication for devices, as such there is only one valid username for gateways today.
es: Actualmente, en el caso de los dispositivos, el servicio solo admite la autenticación basada en, por lo que en estos momentos solo hay un nombre de usuario válido para las pasarelas.
fr: A l'heure actuelle, le service prend uniquement en charge l'authentification par jeton pour les terminaux. Il n'y a donc qu'un seul nom d'utilisateur valide pour les passerelles.
ko: 이 서비스는 디바이스에 대한 토큰 기반 인증만 현재 지원하므로 오늘날에는 게이트웨이에 대해 올바른 사용자 이름이 하나만 있습니다.

source: A value of ``use-token-auth`` indicates to the service that the authentication token for the gateway will be passed as the password for the MQTT connection.
es: Un valor de ``use-token-auth`` indica al servicio que la señal de autenticación correspondiente a la pasarela se pasará como la contraseña para la conexión de MQTT.
fr: La valeur ``use-token-auth`` indique au service que le jeton d'authentification de la passerelle est transmis en tant que mot de passe pour la connexion MQTT.
ko: ``use-token-auth``의 값은 게이트웨이에 대한 인증 토큰이 MQTT 연결을 위한 비밀번호로 전달됨을 서비스에 표시합니다.

source: Password
es: Contraseña
fr: Mot de passe
ko: 비밀번호

source: When using token based authentication submit the device authentication token as the password when making your MQTT connection.
es: Cuando utilice la autenticación basada en señal, envíe la señal de autenticación de dispositivo como contraseña al realizar la conexión de MQTT.
fr: Lorsque vous utilisez l'authentification par jeton, soumettez le jeton d'authentification du terminal en tant que mot de passe lors de l'établissement de la connexion MQTT.
ko: 토큰 기반 인증을 사용하는 경우에는 MQTT 연결 작성 시 디바이스 인증 토큰을 비밀번호로 제출하십시오.

source: Publishing events
es: Publicación de sucesos
fr: Publication d'événements
ko: 이벤트 공개

source: A gateway can publish events from itself and on behalf of any device connected via the gateway by using the following topic and substituting in the appropriate ``typeId`` and ``deviceId`` based on the intended origin of the event:
es: Una pasarela puede publicar sucesos en su propio nombre y en el de cualquier dispositivo conectado a través de ella mediante el ``Id_tipo`` y el ``Id_dispositivo`` apropiados, en función del origen pretendido del suceso:
fr: Une passerelle peut publier des événements pour elle-même et pour le compte de tout terminal connecté via la passerelle en utilisant le sujet suivant et en remplaçant les valeurs ``typeId`` et ``deviceId`` appropriées en fonction de l'origine de l'événement :
ko: 게이트웨이는 다음 주제를 사용하되 의도한 이벤트 출처를 기반으로 적합한 ``typeId``와 ``deviceId`로 대체하여 게이트웨이 자체에서 그리고 게이트웨이를 통해 연결된 모든 디바이스를 대신해 이벤트를 공개할 수 있습니다.

source: iot-2/type/\ **typeId**/id/\ **deviceId**/evt/\ **eventId**/fmt/\ **formatString**
es: iot-2/type/\ **Id_tipo**/id/\ **Id_dispositivo**/evt/\ **Id_suceso**/fmt/\ **Serie_formato**

source: Example
es: Ejemplo
fr: Exemple
ko: 예제

source: Gateway 1
es: Pasarela 1
fr: Passerelle 1
ko: 게이트웨이 1

source: mygateway
es: mi_pasarela
fr: mapasserelle

source: gateway1
es: pasarela1
fr: passerelle1

source: Device 1
es: Dispositivo 1
fr: Terminal 1
ko: 디바이스 1

source: mydevice
es: mi_dispositivo
fr: monterminal

source: device1
es: dispositivo1
fr: terminal1

source: Gateway 1 can publish its own status events: ``iot-2/type/mygateway/id/gateway1/evt/status/fmt/json``
es: La pasarela 1 puede publicar sus propios sucesos de estado: ``iot-2/type/mi_pasarela/id/pasarela1/evt/status/fmt/json``
fr: La passerelle 1 peut publier ses propres événements de statut : ``iot-2/type/mapasserelle/id/passerelle1/evt/status/fmt/json``
ko: 게이트웨이 1은 자체 상태 이벤트를 공개할 수 있습니다. ``iot-2/type/mygateway/id/gateway1/evt/status/fmt/json``

source: Gateway 1 can publish status events on behalf of Device 1: ``iot-2/type/mydevice/id/device1/evt/status/fmt/json``
es: La pasarela 1 puede publicar sucesos de estado en nombre del dispositivo 1: ``iot-2/type/mi_dispositivo/id/dispositivo1/evt/status/fmt/json``
fr: La passerelle 1 peut publier des événements de statut pour le compte du terminal 1 : ``iot-2/type/monterminal/id/terminal1/evt/status/fmt/json``
ko: 게이트웨이 1은 디바이스 1을 대신해 상태 이벤트를 공개할 수 있습니다. ``iot-2/type/mydevice/id/device1/evt/status/fmt/json``

source: The message payload is limited to a maximum of 131072 bytes. Messages larger than this will be rejected.
es: La carga útil del mensaje está limitada a un máximo de 131072 bytes. Los mensajes más largos se rechazarán.
fr: La taille du contenu du message ne peut pas être supérieure à 131072 octets. Les messages dont la taille est plus grande sont rejetés.
ko: 메시지 페이로드는 최대 131072바이트로 제한됩니다. 따라서 이를 초과하는 메시지는 거부됩니다.

source: Subscribing to commands
es: Suscripción a mandatos
fr: Abonnement à des commandes
ko: 명령 구독

source: A gateway can subscribe to commands directed at the gateway itself and to any device connected via the gateway by using the following topic and substituting in the appropriate ``typeId`` and ``deviceId``:
es: Una pasarela puede suscribirse a mandatos dirigidos a la propia pasarela y a cualquier dispositivo conectado mediante la pasarela si emplea el siguiente tema y se sustituyen los ``Id_tipo`` e ``Id_dispositivo`` correspondientes:
fr: Une passerelle peut s'abonner aux commandes qui lui sont envoyées ainsi qu'aux commandes qui sont envoyées à tout terminal connecté via la passerelle en utilisant le sujet suivant et en indiquant les valeurs appropriées pour ``typeId`` et ``deviceId`` :
ko: 게이트웨이는 다음 주제를 사용하되 적합한 ``typeId``와 ``deviceId`로 대체하여 게이트웨이 자체 및 게이트웨이를 통해 연결된 모든 디바이스에 전달되는 명령을 구독합니다.

source: iot-2/type/\ **typeId**/id/\ **deviceId**/cmd/\ **commandId**/fmt/\ **formatString**
es: iot-2/type/\ **Id_tipo**/id/\ **Id_dispositivo**/cmd/\ **Id_mandato**/fmt/\ **serie_formato**

source: The MQTT ``+`` wildcard can be used for ``typeId``, ``deviceId``, ``commandId`` and ``formatString`` to subscribe to multiple command sources.
es: Es posible utilizar el comodín ``+`` de MQTT para ``Id_tipo``, ``Id_dispositivo``, ``Id_mandato`` y ``serie_formato`` para suscribirse a varias fuentes de mandatos.
fr: Le caractère générique MQTT ``+`` peut être utilisé pour ``typeId``, ``deviceId``, ``commandId`` et ``formatString`` pour l'abonnement à plusieurs sources de commande.
ko: MQTT ``+`` 와일드카드를 ``typeId``, ``deviceId``, ``commandId`` 및 ``formatString``에 사용하여 여러 명령 소스를 구독할 수 있습니다.

source: Gateway 1 can subscribe to commands directed at the gateway: ``iot-2/type/mygateway/id/gateway1/cmd/+/fmt/+``
es: La pasarela 1 puede suscribirse a los mandatos dirigidos a la propia pasarela: ``iot-2/type/mi_pasarela/id/pasarela1/cmd/+/fmt/+``
fr: La passerelle 1 peut s'abonner à des commandes qui lui sont envoyées : ``iot-2/type/mapasserelle/id/passerelle1/cmd/+/fmt/+``
ko: 게이트웨이 1은 게이트웨이에 전달되는 명령을 구독할 수 있습니다. ``iot-2/type/mygateway/id/gateway1/cmd/+/fmt/+``

source: Gateway 1 can subscribe to commands sent to Device 1: ``iot-2/type/mydevice/id/device1/cmd/+/fmt/+``
es: La pasarela 1 puede suscribirse a los mandatos enviados al dispositivo 1: ``iot-2/type/mi_dispositivo/id/dispositivo1/cmd/+/fmt/+``
fr: La passerelle 1 peut s'abonner à des commandes envoyées au terminal 1 : ``iot-2/type/monterminal/id/terminal1/cmd/+/fmt/+``
ko: 게이트웨이 1은 디바이스 1으로 전송된 명령을 구독할 수 있습니다. ``iot-2/type/mydevice/id/device1/cmd/+/fmt/+``

source: Gateway 1 can subscribe any command sent to devices of type "mydevice": ``iot-2/type/mydevice/id/+/cmd/+/fmt/+``
es: La pasarela 1 puede suscribirse a cualquier mandato enviado a los dispositivos del tipo "mi_dispositivo": ``iot-2/type/mi_dispositivo/id/+/cmd/+/fmt/+``
fr: La passerelle 1 peut s'abonner à toute commande envoyée aux terminaux de type "monterminal" : ``iot-2/type/monterminal/id/+/cmd/+/fmt/+``
ko: 게이트웨이 1은 "mydevice" 유형의 장치로 전송되는 모든 모든 명령을 구독할 수 있습니다. ``iot-2/type/mydevice/id/+/cmd/+/fmt/+``

source: MQTT persistent sessions (cleansession=false) do not roam for devices which connect to gateways. What this means is that if a device connects to gateway A, then later connects to gateway B, it will not receive any messages that had been published to gateway A for that device while it was disconnected. A gateway owns the MQTT client and subscription, not the devices which are connected to the gateway.
es: Las sesiones persistentes de MQTT (cleansession=false) no configuran la itinerancia para los dispositivos que se conectan a pasarelas. Esto significa que si un dispositivo se conecta a la pasarela A y, posteriormente, se conecta a la pasarela B, no recibirá ningún mensaje que se haya publicado en la pasarela A para dicho dispositivo mientras estaba desconectado. Una pasarela es propietaria del cliente MQTT y de la suscripción, no de los dispositivos que están conectados a la pasarela.
fr: Les sessions persistantes MQTT (cleansession=false) ne recherchent pas les terminaux qui se connectent à des passerelles. Cela signifie que si un terminal se connecte à la passerelle A, puis se connecte ultérieurement à la passerelle B, il ne recevra pas les messages qui ont été publiés pour lui sur la passerelle A alors qu'il était déconnecté. Une passerelle possède l'abonnement et le client MQTT, mais pas les terminaux qui lui sont connectés.
ko: MQTT 지속적 세션(cleansession=false)은 게이트웨이에 연결하는 디바이스에 로밍하지 않습니다. 즉, 디바이스가 게이트웨이 A에 연결된 다음 나중에 게이트웨이 B에 연결되는 경우 연결이 끊어진 동안 해당 디바이스에 대해 게이트웨이 A에 공개된 메시지는 수신되지 않습니다. 게이트웨이는 게이트웨이에 연결된 디바이스가 아닌 MQTT 클라이언트 및 구독을 소유합니다.

source: Gateway auto-registration
es: Registro automático de la pasarela
fr: Enregistrement automatique de la passerelle
ko: 게이트웨이 자동 등록

source: Gateway devices have the ability to automatically register devices which are connected to them. When a gateway publishes a message or subscribes to a topic on behalf of another device, that device will automatically be registered if it does not already exist.
es: Los dispositivos de pasarela tienen la capacidad de registrar dispositivos que estén conectados a ellos. Cuando una pasarela publica un mensaje o se suscribe a un tema en nombre de otro dispositivo, este se registrará de forma automática si no existe ya.
fr: Les terminaux de passerelle peuvent enregistrer automatiquement les terminaux qui leur sont connectés. Lorsqu'une passerelle publie un message ou s'abonne à un sujet pour le compte d'un autre terminal, ce terminal est enregistré automatiquement s'il n'existe pas déjà.
ko: 게이트웨이 디바이스는 연결된 디바이스를 자동으로 등록할 수 있는 기능이 있습니다. 게이트웨이가 메시지를 공개하거나 다른 디바이스를 대신하여 주제를 구독할 때 해당 디바이스가 아직 존재하지 않는 경우 자동으로 등록됩니다.

source: Registration requests from gateway devices are throttled to 128 pending requests at a time. If trying to connect many new devices to a gateway which have not previously been registered, then there may be some delay in the registration of the devices through the gateway.
es: Las solicitudes de registro de los dispositivos de pasarela están limitadas a 128 solicitudes pendientes a la vez. Si se intenta conectar muchos dispositivos nuevos a una pasarela que no se hubieran registrado antes, puede producirse cierto retardo en el registro de dichos dispositivos mediante la pasarela.
fr: Le nombre de demandes d'enregistrement en attente simultanées provenant des terminaux de passerelle ne peut pas être supérieur à 128. Si vous tentez de connecter à une passerelle de nombreux terminaux qui n'ont pas encore été enregistrés, l'enregistrement des terminaux via la passerelle peut être différé.
ko: 게이트웨이 디바이스의 등록 요청은 한 번에 128개의 보류 중인 요청으로 제한됩니다. 많은 새 디바이스를 아직 등록되지 않은 게이트웨이에 연결하려고 시도하면 게이트웨이를 통한 디바이스의 등록에 지연이 있을 수 있습니다.

source: If the gateway fails to automatically register a device, then it will not attempt to register that device again for a short period of time. Any messages or subscriptions from the failed device will be dropped during that time.
es: Si la pasarela no es capaz de registrar de forma automática un dispositivo, no intentará volver a registrar dicho dispositivo durante un breve periodo de tiempo, durante el cual se descartarán todos los mensajes y suscripciones procedentes del dispositivo que no se ha registrado.
fr: Si la passerelle ne parvient pas à enregistrer automatiquement un terminal, elle ne réessaye pas de l'enregistrer pendant un court délai. Les messages ou les abonnements du terminal dont l'enregistrement a échoué sont supprimés pendant cette période.
ko: 게이트웨이가 자동으로 디바이스를 등록하는 데 실패하면 단기간 내에 다시 디바이스를 등록하려고 시도하지 않습니다. 실패한 디바이스의 메시지 또는 구독은 이 시간 동안 모두 삭제됩니다.

source: Gateway notifications
es: Notificaciones de pasarelas
fr: Notifications de la passerelle
ko: 게이트웨이 알림

source: When errors occur during the validation of the publish or subscribe topic, or during automatic registration, a notification will be sent to the gateway device. A gateway can receive these notifications by subscribing to the following topic, substituting in its own ``typeId`` and ``deviceId``:
es: Si se producen errores durante la validación del tema de publicación o suscripción, o durante el registro automático, se enviará una notificación al dispositivo de pasarela. Una pasarela puede recibir estas notificaciones si se suscribe al siguiente tema, sustituyendo ``Id_tipo`` e ``Id_dispositivo`` por los suyos propios:
fr: Lorsque des erreurs surviennent au cours de la validation du sujet de publication ou d'abonnement ou au cours de l'enregistrement automatique, une notification est envoyée au terminal de passerelle. Une passerelle peut recevoir ces notifications en s'abonnant au sujet suivant, avec les valeurs appropriées pour ``typeId`` et ``deviceId`` :
ko: 공개 또는 구독 주제의 유효성 검증 또는 자동 등록 동안 오류가 발생하면 알림이 게이트웨이 디바이스에 전송됩니다. 게이트웨이는 다음 주제를 구독하고 자체 ``typeId`` 및 ``deviceId``로 대체하여 해당 알림을 받을 수 있습니다.

source: iot-2/type/\ **typeId**/id/\ **deviceId**/notify
es: iot-2/type/\ **Id_tipo**/id/\ **Id_dispositivo**/notify

source: Messages received on the notify topic will have the following format:
es: Los mensajes recibido en el tema de notificación tendrán el formato siguiente:
fr: Le format des messages reçus dans le sujet de notification est le suivant :
ko: 알림 주제에서 수신한 메시지의 형식이 다음과 같습니다.
