Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/getting_started/register/index.po
Languages: es, fr, ko

source: Register
es: Registro
fr: Inscrivez-vous
ko: 등록

source: Registering for an account on the Watson IoT platform and connecting your first device is simple and will take less than 10 minutes to complete.
es: El registro de una cuenta en Watson IoT Platform y la conexión del primer dispositivo es simple y tomará menos de 10 minutos en completarse.
fr: L'inscription pour un compte Watson IoT Platform et la connexion de votre premier terminal sont des opérations simples qui prennent moins de dix minutes.
ko: Watson IoT Platform에 계정을 등록하고 첫 번째 디바이스를 연결하는 작업은 간단하므로 10분 내로 완료할 수 있습니다.

source: Create a Bluemix Account
es: Crear una cuenta de Bluemix
fr: Créez un compte Bluemix
ko: Bluemix 계정 작성

source: First you will need to `register for a Bluemix account <https://console.ng.bluemix.net/registration/>`_. Once you have verified your e-mail address you should find yourself looking at an empty dashboard:
es: Primero necesitará `registrase en una cuenta de Bluemix <https://console.ng.bluemix.net/registration/>`_. Una vez que haya verificado la dirección de correo electrónico, deberá ver un panel de control vacío:
fr: Tout d'abord, vous devez `vous inscrire pour obtenir un compte Bluemix <https://console.ng.bluemix.net/registration/>`_. Après avoir vérifié votre adresse électronique, vous devriez voir un tableau de bord vide :
ko: 먼저 `Bluemix 계정을 등록 <https://console.ng.bluemix.net/registration/>`_해야 합니다. 이메일 주소를 확인하면 빈 대시보드가 표시됩니다.

source: Choose your Region
es: Elija la región
fr: Choisissez votre région
ko: 지역 선택

source: Now, before you go any further you need to consider data soveriegnty and make a decision as to which of the available regions you want to register your service instance with. Currently the Watson IoT platform is available in two regions:
es: Ahora, antes de seguir, necesita tener en cuenta la soberanía de los datos y decidir en cuál de las regiones disponibles desea registrar la instancia de servicio. Actualmente Watson IoT Platform está disponible en dos regiones:
fr: A présent, avant de continuer, vous devez considérer la souveraineté des données et choisir parmi les régions disponibles celles dans lesquelles vous voulez enregistrer votre instance de service. Actuellement, Watson IoT Platform est disponible dans deux régions :
ko: 추가 작업을 수행하기 전에 데이터 주권(Data Sovereignty)을 고려하여 서비스 인스턴스를 등록할 수 있는 지역을 결정해야 합니다. 현재 Watson IoT Platform은 두 지역에 제공됩니다.

source: United Kingom
es: Reino Unido
fr: Royaume-Uni
ko: 영국

source: United States
es: EE.UU.
fr: Etats-Unis
ko: 미국

source: Data sovereignty is the concept that information which has been converted and stored in binary digital form is subject to the laws of the country in which it is located.
es: La soberanía de datos es el concepto por el que la información que se ha convertido y almacenado en formato digital binario está sujeta a la legislación del país en el que está ubicada.
fr: Selon le concept de souveraineté des données, les informations qui ont été converties et stockées au format numérique binaire sont assujetties aux lois du pays dans lequel elles se trouvent.
ko: 데이터 주권이란 2진 디지털 형식으로 변환되어 저장된 정보가 소재 국가의 법률 적용을 받는다는 개념입니다.

source: The region your Watson IoT platform instance will be provisioned in will be determined by the Bluemix region you are using. You can switch Bluemix regions via the controls in the top right corner of the Bluemix dashboard. You can also determine which region are currently have selected by the URL in your browser:
es: La región en la que se proporcionará la instancia de Watson IoT Platform la determinará la región de Bluemix que esté utilizando. Puede conmutar entre regiones de Bluemix mediante los controles de la esquina superior derecha del panel de control de Bluemix. También puede determinar qué región ha seleccionado actualmente el URL en el navegador:
fr: La région dans laquelle votre instance Watson IoT Platform sera mise à disposition est déterminée par la région Bluemix que vous utilisez. Vous pouvez changer de région Bluemix à l'aide des commandes situées dans le coin supérieur droit du tableau de bord Bluemix. Vous pouvez également déterminer quelles sont les régions actuellement sélectionnées en fonction de l'adresse URL dans votre navigateur :
ko: Watson IoT Platform 인스턴스가 프로비저닝될 지역은 사용 중인 Bluemix 지역에 따라 결정됩니다. Bluemix 지역은 Bluemix 대시보드의 오른쪽 위에 있는 컨트롤을 통해 전환할 수 있습니다. 브라우저의 URL에 현재 어떤 지역이 선택되어 있는지 판별할 수도 있습니다.

source: United Kingdom: console.\ **eu-gb**\ .bluemix.net
es: Reino Unido: console.\ **eu-gb**\ .bluemix.net
fr: Royaume-Uni : console.\ **eu-gb**\ .bluemix.net
ko: 영국: console.\ **eu-gb**\ .bluemix.net

source: United States: console.\ **ng**\ .bluemix.net
es: EE.UU.: console.\ **ng**\ .bluemix.net
fr: Etats-Unis : console.\ **ng**\ .bluemix.net
ko: 미국: console.\ **ng**\ .bluemix.net

source: Provision a Watson IoT platform Service Instance
es: Proporcione una instancia de servicio de Watson IoT Platform
fr: Mettez à disposition une instance de service Watson IoT Platform
ko: Watson IoT Platform 서비스 인스턴스 프로비저닝

source: From anywhere in the Bluemix dashboard click **catalog** in the top navigation, this will take you to a list of all services available on Bluemix.
es: Desde cualquier lugar del panel de control de Bluemix, pulse **catalog** en la navegación superior. Esto le llevará a una lista de todos los servicios disponibles en Bluemix.
fr: A partir de n'importe quel emplacement dans le tableau de bord Bluemix, cliquez sur **catalogue** dans la fenêtre de navigation supérieure pour afficher la liste de tous les services disponibles dans Bluemix.
ko: Bluemix 대시보드의 아무 위치에서 위쪽 탐색에 있는 **카탈로그**를 클릭하면 Bluemix에서 사용 가능한 모든 서비스 목록이 표시됩니다.

source: Type ``Internet of Things`` into the search box at the top of the page to filter out all the other services.
es: Escriba ``Internet of Things`` en el recuadro de búsqueda en la parte superior de la página para filtrar todos los demás servicios.
fr: Entrez ``Internet des objets`` dans la boîte de recherche en haut de la page afin d'exclure tous les autres services.
ko: 페이지 위쪽에 있는 검색 상자에 ``Internet of Things``를 입력하여 다른 모든 서비스를 필터링하여 제거하십시오.

source: Click ``View More`` on the **Watson IoT platform** service tile.
es: Pulse ``Ver más`` en el mosaico de servicio de **Watson IoT Platform**.
fr: Cliquez sur ``Afficher plus`` dans la vignette du service **Watson IoT platform**.
ko: **Watson IoT Platform** 서비스 타일에 있는 ``계속 보기``를 클릭하십시오.

source: Optionally give your service instance a name (or simply accept the generated name)
es: Opcionalmente proporcione un nombre a la instancia de servicio (o simplemente acepte el nombre generado)
fr: Si vous le souhaitez, attribuez un nom à votre instance de service (ou acceptez simplement le nom généré)
ko: 선택적으로 서비스 인스턴스에 이름을 제공(또는 생성된 이름을 단순히 승인)

source: Click ``Create``
es: Pulse ``Crear``
fr: Cliquez sur ``Créer``
ko: ``작성``을 클릭하십시오.

source: After a short delay you will find yourself the proud owner of an organization on the IBM Watson IoT platform.
es: Tras un corto retardo, se convertirá en el propietario de una organización en IBM Watson IoT Platform.
fr: Vous allez devenir rapidement le fier propriétaire d'une organisation dans IBM Watson IoT Platform.
ko: 잠시 후 IBM Watson IoT Platform에서 자신이 조직 소유자임을 확인할 수 있습니다.

source: Additional Setup and Experimentation
es: Configuración y experimentación adicionales
fr: Configuration supplémentaire et expérimentation
ko: 추가 설정 및 테스트

source: Click the ``Launch Dashboard`` button when viewing your new service instance within Bluemix, this will take you to your Watson IoT platform Dashboard.
es: Pulse el botón ``Iniciar panel de control`` al ver la nueva instancia de servicio en Bluemix; esto le llevará al panel de control de Watson IoT Platform.
fr: Cliquez sur le bouton ``Lancer le tableau de bord`` lorsque vous affichez votre nouvelle instance de service dans Bluemix pour accéder à votre tableau de bord Watson IoT Platform.
ko: Bluemix 내에서 새 서비스 인스턴스를 볼 때 ``대시보드 실행``단추를 클릭하면 Watson IoT Platform 대시보드로 이동합니다.

source: Configure Access
es: Configurar acceso
fr: Configurez l'accès
ko: 액세스 구성

source: You are currently accessing the dashboard through a 24 hour access token generated by Bluemix when you clicked ``Launch Dashboard``, when this expires you will need to return to Bluemix and relaunch the dashboard. I think we can all agree it's preferable not to have to do this, so let's promote you to a permanent member of the organization.
es: Actualmente está accediendo al panel de control mediante una señal de acceso de 24 horas generada por Bluemix al pulsar ``Iniciar panel de control``; cuando esta caduque necesitará volver a Bluemix y volver a iniciar el panel de control. Seguramente estaremos todos de acuerdo en que es preferible no tener que realizar esta tarea, de modo que vamos a promocionarle a miembro permanente de la organización.
fr: Vous accédez actuellement au tableau de bord à l'aide d'un jeton d'accès de 24 heures qui a été généré par Bluemix lorsque vous avez cliqué sur ``Lancer le tableau de bord``. Une fois que ce jeton sera arrivé à expiration, vous devrez revenir dans Bluemix et relancer le tableau de bord. Il est clairement préférable de ne pas avoir à effectuer cette opération ; par conséquent, nous allons vous promouvoir membre permanent de l'organisation.
ko: ``대시보드 실행`을 클릭할 때 Bluemix에서 생성하는 24시간 액세스 토큰을 통해 현재 대시보드에 액세스하고 있고, 이 토큰이 만료되면 Bluemix로 돌아가서 대시보드를 다시 실행해야 합니다. 그러나 사용자는 이 작업을 수행하지 않는 것을 모두 선호하므로 자신을 조직의 영구 구성원으로 승격시키십시오.

source: In the navigation menu select ``Access`` and then ``Guests``, you should see the e-mail address you signed up to Bluemix with in there and the expiration date for your session. Click the ``Promote`` button to set yourself up as a permanent member of the organization, your ID will disappear from the list, and can now be found under ``Access > Members``.
es: En el menú de navegación, seleccione ``Acceder`` y, a continuación, ``Invitados``; allí verá la dirección de correo electrónico con la que ha iniciado la sesión en Bluemix y la fecha de caducidad de la sesión. Pulse el botón ``Promocionar`` para configurarse como miembro permanente de la organización. El ID desaparecerá de la lista y entonces se podrá encontrar en ``Acceder > Miembros``.
fr: Dans le menu de navigation, sélectionnez ``Accès``, puis ``Invités``. L'adresse électronique avec laquelle vous vous êtes inscrit à Bluemix s'affiche, ainsi que la date d'expiration de votre session. Cliquez sur le bouton de promotion pour devenir membre permanent de l'organisation. Votre ID ne figure plus dans la liste et se trouve désormais sous ``Accès > Membres``.
ko: 탐색 메뉴에서 ``액세스``를 클릭한 다음 ``게스트``를 클릭하면 Bluemix에 등록할 때 사용한 이메일 주소와 세션 만료 날짜가 표시됩니다. ``승격`` 단추를 클릭하면 자신이 조직의 영구 구성원으로 등록되므로, 자신의 ID가 목록에서 사라지고 ``액세스 > 구성원`` 아래에 표시됩니다.

source: Connect an Application
es: Conectar una aplicación
fr: Connectez une application
ko: 애플리케이션 연결

source: Applications require an ``API key`` to connect to the service. Let's set one up. Navigate to ``Access > API Keys`` and click ``Generate API Key``. Take a note of your ``API Key`` and ``Authentication Token`` - you will need them shortly.
es: Las aplicaciones necesitan una ``clave de API`` para conectarse al servicio. Vamos a configurar una. Vaya a ``Acceder > Claves de API`` y pulse ``Generar clave de API``. Tome nota de la ``Clave de API`` y ``Señal de autenticación`` - las necesitará en breve.
fr: Les applications nécessitent une ``clé d'API`` pour se connecter au service. Définissons-en une. Accédez à ``Accès > Clés d'API`` et cliquez sur ``Générer une clé d'API``. Notez votre ``clé d'API`` et votre ``jeton d'authentification`` car vous en aurez besoin dans peu de temps.
ko: 서비스에 연결하려면 애플리케이션에 ``API 키``가 필요합니다. API 키를 설정하겠습니다. ``액세스 > API 키``로 이동한 다음 ``API 키 생성``을 클릭하십시오. ``API 키``및 ``인증 토큰``이 즉시 필요하므로 메모해 두십시오.

source: Now we have an API key we want to run an application, the simpler the better.
es: Ahora que tenemos una clave de API, queremos ejecutar una aplicación de la manera más simple posible.
fr: Maintenant que vous disposez d'une clé d'API, vous allez exécuter une application, la plus simple possible.
ko: API 키를 생성했으므로 애플리케이션을 실행하려고 하고, 단순할수록 좋습니다.

source: The Watson IoT platform has client library support for multiple languages, but for the purpose of this getting started tutorial we're going to stick with Python. If you don't already have `Python <https://www.python.org/downloads/>`_ installed now is the time to do so.
es: Watson IoT Platform tiene soporte de biblioteca de cliente para varios lenguajes, pero para esta guía de aprendizaje de cómo empezar, utilizaremos solo Python. Si aún no tiene instalado `Python <https://www.python.org/downloads/>`_ , ahora es el momento de hacerlo.
fr: Watson IoT Platform prend en charge des bibliothèques client pour plusieurs langues, mais dans ce tutoriel d'initiation, vous allez utiliser Python. Si `Python <https://www.python.org/downloads/>`_ n'est pas encore installé, installez-le maintenant.
ko: Watson IoT Platform에서 여러 언어에 대한 클라이언트 라이브러리 지원을 제공하지만, 본 시작하기 학습서의 목적상 Python을 사용하려고 합니다. Python <https://www.python.org/downloads/>`_이 아직 설치되어 있지 않다면 설치하십시오.

source: Install the latest version of the Watson IoT platform python client library using pip
es: Instale la versión más reciente de la biblioteca de cliente de Python de Watson IoT Platform utilizando pip
fr: Installez la version la plus récente de la bibliothèque client Python de Watson IoT Platform avec pip
ko: pip를 사용하여 Watson IoT Platform Python 클라이언트 라이브러리의 최신 버전을 설치하십시오.

source: Now, create a really simple application that will connect using the API key you just created:
es: Ahora, cree una aplicación realmente simple que se conectará utilizando la clave de API que acaba de crear:
fr: A présent, créez une application vraiment simple qui se connectera avec la clé d'API que vous venez de créer :
ko: 이제 방금 작성한 API 키를 사용하여 연결할 아주 단순한 애플리케이션을 작성하십시오.

source: When you launch the application you will see nothing overly exciting
es: Al iniciar la aplicación, no verá nada excesivamente interesante
fr: Lorsque vous lancez l'application, vous ne verrez rien de très spécial
ko: 애플리케이션을 실행할 때 아주 흥미로운 사항은 없습니다.

source: Connect a Device
es: Conectar un dispositivo
fr: Connectez un terminal
ko: 디바이스 연결

source: Before we can register a device we have to define a device type. A ``device type`` is intended to represent a group of devices that are identical, it can be useful to think of the ``device type`` as analogous to a model in the traditional model:serial identification scheme. Leave you application running to return to your Watson IoT platform Dashboard and navigate to ``Devices > Device Types``, click ``Create Type`` and enter ``python-sample`` as the name, all other fields are optional, so we're just going to skip past the rest of the options for the device type for now.
es: Antes de poder registrar un dispositivo, tenemos que definir un tipo de dispositivo. Un ``tipo de dispositivo`` está destinado a representar un grupo de dispositivos que son idénticos; puede ser útil considerar el ``tipo de dispositivo`` como análogo a un modelo del esquema tradicional de modelo:identificación serie. Deje que la aplicación se ejecute para volver al panel de control de Watson IoT Platform y vaya a ``Dispositivos > Tipos de dispositivo``, pulse ``Crear tipo`` y entre ``python-sample`` como nombre; todos los demás campos son opcionales, de modo que, de momento, simplemente vamos a saltarnos el resto de las opciones para el tipo de dispositivo.
fr: Pour pouvoir enregistrer un terminal, vous devez définir un type de terminal. Un ``type de terminal`` représente un groupe de terminaux identiques et peut s'apparenter à un modèle dans le schéma modèle traditionnel:identification de série. Laissez votre application s'exécuter pour revenir à votre tableau de bord Watson IoT Platform et accédez à ``Terminaux > Types de terminaux``, cliquez sur ``Créer un type``, puis entrez le nom ``python-sample``. Les autres zones sont facultatives ; nous allons donc les ignorer pour le moment.
ko: 디바이스를 등록하기 전에 디바이스 유형을 정의해야 합니다. ``디바이스 유형``은 동일한 디바이스 그룹을 나타내며, ``디바이스 유형``을 기존의 모델:일련번호 식별 스킴의 모델과 유사한 용어로 간주하면 유용할 수 있습니다. 애플리케이션이 실행 중인 상태에서 Watson IoT Platform 대시보드로 돌아와 ``디바이스 > 디바이스 유형``으로 이동한 다음 ``유형 작성``을 클릭하고 이름으로 ``python-sample``을 입력하십시오. 그 외의 모든 필드는 선택사항이므로, 우선은 디바이스 유형에 대한 나머지 옵션을 건너뛰려고 합니다.

source: Now it's time to register a device of this type, navigate to ``Devices > Browse`` and click ``Add Device``, select the ``python-sample`` device type that we just created and click ``Next``. On the second panel enter a device ID of "MyFirstDevice" and click ``Next`` to continue through the guided creation process until you reach the ``Add`` button.
es: Ahora es el momento de registrar un dispositivo de este tipo: navegue a ``Dispositivos > Examinar`` y pulse ``Añadir dispositivo``, seleccione el tipo de dispositivo ``python-sample`` que acabamos de crear y pulse ``Siguiente``. En el segundo panel, entre un ID de dispositivo de "MyFirstDevice" y pulse ``Siguiente`` para continuar el proceso de creación guiado hasta que llegue al botón ``Añadir``.
fr: A présent, il est temps d'enregistrer un terminal de ce type. Accédez à ``Terminaux > Parcourir`` et cliquez sur ``Ajouter un terminal``, sélectionnez le type de terminal ``python-sample`` que vous venez de créer, puis cliquez sur ``Suivant``. Dans le deuxième panneau, entrez l'ID terminal "MonPremierTerminal" et cliquez sur ``Suivant`` pour poursuivre le processus de création guidée jusqu'à ce que vous atteigniez le bouton ``Ajouter``.
ko: 이제 이 유형의 디바이스를 등록할 차례입니다. ``디바이스 > 찾아보기`로 이동하여 ``디바이스 추가``를 클릭하고 방금 작성한 ``python-sample`` 디바이스 유형을 선택한 후 ``다음``을 클릭하십시오. 두 번째 패널에서 디바이스 ID로 "MyFirstDevice"를 입력한 후 ``다음``을 클릭하여 ``추가`` 단추가 표시될 때까지 안내되는 작성 프로세스를 계속 진행하십시오.

source: Once you click ``Add`` your device is registered and you will be presented with a generated ``authentication token`` for that device.
es: Una vez que haya pulsado ``Añadir``, el dispositivo se registrará y se le presentará una ``señal de autenticación`` generada para ese dispositivo.
fr: Lorsque vous cliquez sur ``Ajouter``, votre terminal est enregistré et un ``jeton d'authentification`` est généré pour le terminal.
ko: ``추가``를 클릭하면 해당 디바이스가 등록되고 해당 디바이스에 대해 생성된 ``인증 토큰``이 표시됩니다.

source: We're now going to take that authentication token and write a totally minimal device client in python.
es: Ahora vamos a tomar esa señal de autenticación y escribir un cliente de dispositivo mínimo totalmente en python.
fr: A présent, vous allez prendre ce jeton d'authentification et écrire un client de terminal minimal entier en langage python.
ko: 이제 해당 인증 토큰을 가져와서 Python에서 극도로 작은 디바이스 클라이언트를 작성하려고 합니다.

source: When executed the device code will generate 10 events .. code::
es: Cuando se ejecute, el código de dispositivo generará 10 sucesos .. código::
fr: Lors de son exécution, le code du terminal génère dix événements .. code: :
ko: 실행하면 디바이스 코드가 10개의 이벤트를 생성합니다. 코드::

source: Returning to the terminal where your application is running you will be able to see the application is recieving and processing the events submitted by your device in real time.
es: Al volver al terminal donde se ejecuta la aplicación, podrá ver que la aplicación está recibiendo y procesando los sucesos enviados por el dispositivo en tiempo real.
fr: Si vous revenez sur le terminal sur lequel votre application s'exécute, vous constatez que l'application reçoit et traite les événements soumis par votre terminal en temps réel.
ko: 애플리케이션이 실행 중인 터미널로 돌아오면 애플리케이션이 디바이스를 통해 제출된 이벤트를 실시간으로 수신하여 처리하고 있음을 확인할 수 있습니다.

source: Finally, if you return to the Watson IoT platform dashboard and scroll down to ``Device Events`` you will be able to see all the events that you just sent.
es: Finalmente, si vuelve al panel de control de Watson IoT Platform y se desplaza hacia abajo hasta ``Sucesos de dispositivo``, podrá ver todos los sucesos que acaba de enviar.
fr: Enfin, si vous revenez dans le tableau de bord Watson IoT Platform et faites défiler la page jusqu'à la section des événements de terminal, vous pouvez afficher tous les événements que vous venez d'envoyer.
ko: 최종으로 Watson IoT Platform 대시보드로 돌아와서 ``디바이스 이벤트``로 스크롤하면 방금 전송한 이벤트를 모두 확인할 수 있습니다.

source: You can also examine the content of any of the events by selecting an event from the table.
es: También puede examinar el contenido de cualquiera de los sucesos seleccionando un suceso en la tabla.
fr: Vous pouvez également examiner le contenu d'un événement en le sélectionnant dans le tableau.
ko: 또한 테이블에서 이벤트를 선택하여 이벤트의 컨텐츠를 확인할 수도 있습니다.
