Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/mqtt.po
Languages: es, fr, ko

source: The IoT Platform service extends the MQTT 3.1.1 specification to provide support for shared subscriptions. Shared subscription can provide simple load balancing functionality for applications. A shared subscription might be needed if a back-end enterprise application can not keep up with the number of messages being published to a specific topic space. For example if many devices were publishing messages that are being processed by a single application. It might be helpful to leverage the load balancing capability of a shared subscription. IoT Platform shared subscription support is limited to non-durable subscriptions only.
es: El servicio de IoT Platform amplía la especificación de MQTT 3.1.1 para proporcionar soporte para suscripciones compartidas. La suscripción compartida puede proporcionar funcionalidad de equilibrio de carga simple para las aplicaciones. Es posible que se necesite una suscripción compartida si una aplicación empresarial de fondo no puede estar al día con el número de mensajes que se publican en un espacio de tema específico. Por ejemplo si muchos dispositivos estaban publicando mensajes procesados por una única aplicación. Puede ser útil aprovechar la capacidad de equilibrio de carga de una suscripción compartida. El soporte de suscripción compartida de IoT Platform está limitado solo a suscripciones no duraderas.
fr: Le service IoT Platform étend la spécification MQTT 3.1.1 pour prendre en charge les abonnements partagés. L'abonnement partagé peut fournir des fonctionnalités d'équilibrage de charge simples pour les applications. Un abonnement partagé peut être nécessaire si une application d'entreprise dorsale ne parvient pas à faire face au volume de messages publiés dans un espace de sujet spécifique. C'est le cas par exemple lorsque de nombreux terminaux publient des messages qui sont traités par une même application. Il peut être alors utile de tirer parti de la fonction d'équilibrage de charge d'un abonnement partagé. La prise en charge des abonnements partagés d'IoT Platform est limitée aux abonnements non durables.
ko: IoT Platform 서비스는 MQTT 3.1.1 스펙을 확장하여 공유 구독에 대한 지원을 제공합니다. 공유된 구독에서는 애플리케이션에 대해 단순한 로드 밸런싱 기능을 제공할 수 있습니다. 백엔드 엔터프라이즈 애플리케이션이 특정 주제 공간에 공개 중인 메시지의 수를 추적할 수 없는 경우 공유된 구독이 필요할 수 있습니다. 예를 들어, 다수의 디바이스가 단일 애플리케이션에서 처리 중인 메시지를 공개 중인 경우가 있습니다. 공유된 구독의 로드 밸런싱 기능을 활용하는 데 유용할 수 있습니다. IoT Platform 공유 구독 지원은 비지속 구독으로만 제한됩니다.

source: A simple example of an auto-scaling application:
es: Ejemplo simple de una aplicación de escalado automático:
fr: Exemple simple d'application évolutive :
ko: Auto Scaling 애플리케이션의 단순 예제:

source: client 1 connects as A:abc123:myApplication and subscribes to all device events client 1 will receive 100% of the device events published
es: El cliente 1 se conecta como A:abc123:myApplication y se suscribe a todos los sucesos; el cliente 1 recibirá el 100% de los sucesos de dispositivo publicados
fr: Le client 1 se connecte avec l'ID A:abc123:myApplication et s'abonne à tous les événements du terminal. Il recevra donc 100 % des événements du terminal publiés.
ko: 클라이언트 1은 A:abc123:myApplication으로 연결하고 모든 디바이스 이벤트를 구독합니다. 클라이언트 1이 공개된 디바이스 이벤트를 100% 수신합니다.

source: client 2 connects as A:abc123:myApplication and subscribes to all device events now, client 1 and client 2 will share all of the events published between them. that is the load is now shared between client 1 and client 2.
es: El cliente 2 se conecta como A:abc123:myApplication y se suscribe a todos los sucesos de dispositivo ahora, el cliente 1 y el cliente 2 compartirán todos los sucesos publicados entre ellos. Es decir, la carga se comparte ahora entre el cliente 1 y el cliente 2.
fr: Le client 2 se connecte avec l'ID A:abc123:myApplication et s'abonne à tous les événements du terminal. Le client 1 et le client 2 se partagent désormais tous les événements publiés. Cela signifie que la charge est maintenant partagée entre le client 1 et le client 2.
ko: 클라이언트 2는 A:abc123:myApplication으로 연결하고 현재 모든 디바이스 이벤트를 구독합니다. 클라이언트 1 및 클라이언트 2가 사이에 공개된 모든 이벤트를 공유합니다. 즉, 로드가 클라이언트 1 및 클라이언트 2 사이에 현재 공유되어 있습니다.

source: client 3 connects as A:abc123:myApplication and subscribes to all device events now, instance 1, 2 and 3 will process the events shared amongst all three instances
es: El cliente 3 se conecta como A:abc123:myApplication y se suscribe a todos los sucesos de dispositivo; la instancia 1, 2 y 3 procesará los sucesos compartidos entre las tres instancias
fr: Le client 3 se connecte avec l'ID A:abc123:myApplication et s'abonne à tous les événements du terminal. Les instances 1, 2 et 3 traiteront désormais les événements partagés entre les trois instances.
ko: 클라이언트 3은 A:abc123:myApplication으로 연결하고 현재 모든 디바이스 이벤트를 구독합니다. 인스턴스 1, 2 및 3이 3개의 인스턴스 모두에서 공유되는 이벤트를 처리합니다.

source: clients 2 and 3 unsubscribe from all device events now, although instance 2 and 3 are still connected to the service, instance 1 will be receiving all device events published
es: Los clientes 2 y 3 anularán la suscripción de todos los sucesos; aunque la instancia 2 y 3 sigan conectadas al servicio, la instancia 1 seguirá recibiendo todos los sucesos de dispositivo publicados
fr: Les clients 2 et 3 se désabonnent de tous les événements du terminal. Bien que les instances 2 et 3 soient toujours connectées au service, l'instance 1 reçoit désormais tous les événements du terminal publiés.
ko: 인스턴스 2 및 3이 계속 서비스에 연결된 경우에도 클라이언트 2 및 3이 현재 모든 디바이스 이벤트에서 구독 해제합니다. 인스턴스 1은 공개된 모든 디바이스 이벤트를 수신합니다.

source: **org\_id** is your unique 6 character organization ID, assigned when you sign up with the service
fr: **org\_id** est un ID d'organisation unique de 6 caractères attribué lors de votre inscription au service.
ko: **org\_id**는 서비스에 등록할 때 지정된 고유한 여섯 문자의 조직 ID입니다.

source: **app\_id** is a user-defined unique string identifier for this client and must comprise only alpha-numeric characters (a-z, A-Z, 0-9) and the following special characters: dash (-), underscore (\_), dot (.)
fr: **app\_id** est un identificateur de chaîne unique défini par l'utilisateur pour ce client qui ne peut être composé que de caractères alphanumériques (a à z, A à Z, 0 à 9) et des caractères spéciaux suivants : le trait d'union (-), le trait de soulignement (\_) et le point (.)
ko: **app\_id**는 이 클라이언트에 대해 사용자 정의 고유 문자열 ID이며 영숫자 문자(a-z, A-Z, 0-9) 및 특수 문자(대시(-), 밑줄(\_), 점(.))만 포함해야 합니다.

source: **app\_id** has a maximum length of 36 characters
fr: **app\_id** ne peut pas comporter plus de 36 caractères
ko: **app\_id**의 최대 길이는 36자입니다.

source: The message payload is limited to a maximum of 131072 bytes. Messages larger than this will be rejected.
fr: La taille du contenu du message ne peut pas être supérieure à 131072 octets. Les messages dont la taille est plus grande sont rejetés.
ko: 메시지 페이로드는 최대 131072바이트로 제한됩니다. 따라서 이를 초과하는 메시지는 거부됩니다.
