Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/mqtt.po
Languages: es, fr, ko

source: MQTT Connectivity for Applications
es: Conectividad de MQTT para aplicaciones
fr: Connectivité MQTT des applications
ko: 애플리케이션을 위한 MQTT 연결

source: Client connection
es: Conexión de cliente
fr: Connexion client
ko: 클라이언트 연결

source: Every registered organization has a unique endpoint which must be used when connecting MQTT clients for applications in that organization.
es: Cada organización registrada tiene un punto final exclusivo que se debe utilizar al conectar clientes MQTT para aplicaciones en esa organización.
fr: Chaque organisation enregistrée possède un noeud final unique qui doit être utilisé lors de la connexion des clients MQTT pour les applications de cette organisation.
ko: 등록된 모든 조직에는 해당 조직의 애플리케이션에 대해 MQTT 클라이언트를 연결할 때 사용해야 하는 고유 엔드포인트가 있습니다.

source: **org\_id**.messaging.internetofthings.ibmcloud.com
es: **id\_org**.messaging.internetofthings.ibmcloud.com

source: Unencrypted client connection
es: Conexión de cliente no cifrada
fr: Connexion client non chiffrée
ko: 암호화되지 않은 클라이언트 연결

source: Connect on port **1883**
es: Conectar en el puerto **1883**
fr: Connexion sur le port **1883**
ko: 포트 **1883**에서 연결

source: All information your application submits is being sent in plain text (including the API key and authentication token). We recommend the use of an encrypted connection whenever possible.
es: Toda la información que la aplicación envía se está enviando en texto sin formato (incluyendo la clave de API y la señal de autenticación). Recomendamos el uso de una conexión cifrada siempre que sea posible.
fr: Toutes les informations soumises par votre application sont envoyées en texte en clair (y compris la clé d'API et le jeton d'authentification). Il est recommandé d'utiliser une connexion chiffrée dans la mesure du possible.
ko: 애플리케이션이 제출하는 모든 정보는 일반 텍스트로 전송됩니다(API 키 및 인증 토큰 포함). 가능할 때마다 암호화된 연결을 사용하는 것이 좋습니다.

source: Encrypted client connection
es: Conexión de cliente cifrada
fr: Connexion client chiffrée
ko: 암호화된 클라이언트 연결

source: Connect on port **8883** or **443** for websockets.
es: Conectarse en el puerto **8883** o **443** para sockets web.
fr: Connexion sur le port **8883** ou **443** pour les websockets.
ko: 웹 소켓을 위해 포트 **8883** 또는 **443**에서 연결합니다.

source: In many client libraries you will need to provide the server's public certificate in pem format. The following file contains the entire certificate chain for \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
es: En muchas bibliotecas de cliente necesitará proporcionar el certificado público del servidor en formato pem. El archivo siguiente contiene la serie de certificados entera para \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
fr: Dans la plupart des bibliothèques client, vous devez fournir le certificat public du serveur au format pem. Le fichier suivant contient l'ensemble de la chaîne de certificats de \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
ko: 다수의 클라이언트 라이브러리에서 사용자는 pem 형식으로 서버의 공용 인증서를 제공해야 합니다. 다음 파일에는 \*.messaging.internetofthings.ibmcloud.com: messaging.pem에 대한 전체 인증서 체인이 포함되어 있습니다.

source: Some SSL client libraries have been shown to not handle wildcarded domains, in which case, if you can not change libraries, you will need to turn off certificate checking.
es: Se ha mostrado que algunas bibliotecas de cliente SSL no manejan dominios con caracteres comodín, en cuyo caso, si no puede cambiar las bibliotecas, necesitará desactivar la comprobación de certificados.
fr: Certaines bibliothèques client SSL ne traitent pas correctement les domaines associés à des caractères génériques. Dans ce cas, si vous ne pouvez pas changer de bibliothèques, vous devez désactiver la vérification des certificats.
ko: 일부 SSL 클라이언트 라이브러리는 와일드카드 도메인을 처리하지 않는 것으로 표시되었으며 이 경우 라이브러리를 변경할 수 없으면 인증서 확인을 꺼야 합니다.

source: The IoT Platform requires TLS v1.2. We suggest the following cipher suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 or AES128-GCM-SHA256 *(as of Jun 1 2015)*.
es: IoT Platform requiere TLS v1.2. Sugerimos las siguientes suites de cifrado: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 o AES128-GCM-SHA256 *(a partir del 1 de junio de 2015)*.
fr: IoT Platform requiert TLS version 1.2. Il est recommandé d'utiliser les suites de chiffrement suivantes : ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 ou AES128-GCM-SHA256 *(à compter du 1er juin 2015)*.
ko: IoT Platform에는 TLS v1.2가 필요합니다. ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 또는 AES128-GCM-SHA256 암호 스위트를 추천합니다. *(2015년 1월 1일 현재)*

source: MQTT client identifier
es: Identificador de cliente MQTT
fr: Identificateur du client MQTT
ko: MQTT 클라이언트 ID

source: An application must authenticate using a client ID in the following format:
es: Una aplicación se debe autenticar utilizando un ID de cliente en el formato siguiente:
fr: Une application doit s'authentifier à l'aide d'un ID client au format suivant :
ko: 애플리케이션은 다음 형식의 클라이언트 ID를 사용하여 인증해야 합니다.

source: a:**org\_id**:**app_id**
es: a:**id\_org**:**id_aplic**

source: **a** indicates the client is an application
es: **a** indica que el cliente es una aplicación
fr: **a** indique que le client est une application
ko: **a**는 클라이언트가 애플리케이션임을 표시함

source: **org\_id** is your unique organization ID, assigned when you sign up with the service. It will be a 6 character alphanumeric string.
es: **id\_org** es el ID de la organización, asignado al registrarse en el servicio. Será una serie alfanumérica de 6 caracteres.
fr: **org\_id** est l'ID d'organisation unique attribué lors de votre inscription au service. Il s'agit d'une chaîne alphanumérique de 6 caractères.
ko: **org\_id**는 서비스에 등록할 때 지정된 고유 조직 ID입니다. 이 ID는 6자 영숫자 문자열입니다.

source: **app\_id** is a user-defined unique string identifier for this client.
es: **id\_aplic** es un identificador de serie exclusivo definido por el usuario para este cliente.
fr: **app\_id** est un identificateur unique de type chaîne, défini par l'utilisateur pour ce client.
ko: **app\_id**는 이 클라이언트에 대해 사용자 정의 고유 문자열 ID입니다.

source: We do not impose any rules on the **app\_id** component of the client ID
es: No imponemos ninguna regla en el componente **id\_aplic** del ID de cliente

source: When connecting to the Quickstart service no authentication is required
es: Al conectarse al servicio Quickstart, no se necesita autenticación
fr: Lors de la connexion au service Quickstart, aucune authentification n'est nécessaire.
ko: Quickstart 서비스에 연결하는 경우에는 인증이 필요하지 않음

source: An application does not need to be registered before it can connect
es: Una aplicación no necesita estar registrada para poderse conectar
fr: Il est inutile d'enregistrer une application pour lui permettre de se connecter.
ko: 애플리케이션을 연결하기 위해 먼저 애플리케이션을 등록하지 않아도 됨

source: Only one MQTT client can connect using any given client ID. As soon as a second client in your organization connects using an **app\_id** that you have already connected the first client will be disconnected.
es: Solo un cliente MQTT puede conectarse mediante un ID de cliente dado. Tan pronto como un segundo cliente de la organización se conecte utilizando un **id\_aplic** que ya se ha conectado, se desconectará el primero cliente.
fr: Un seul client MQTT peut se connecter en utilisant un ID client donné. Dès qu'un second client de l'organisation se connecte à l'aide d'un ID **app\_id** déjà utilisé pour une connexion, le premier client est déconnecté.
ko: 지정된 클라이언트 ID를 사용하여 하나의 MQTT 클라이언트만 연결할 수 있습니다. 사용자가 이미 연결한 **app\_id**를 사용하여 조직의 두 번째 클라이언트가 연결되는 즉시 첫 번째 클라이언트의 연결이 끊깁니다.

source: MQTT authentication
es: Autenticación de MQTT
fr: Authentification MQTT
ko: MQTT 인증

source: Applications require an API Key to connect into an organization. When an API Key is registered a token will be generated that must be used with that API key.
es: Las aplicaciones necesitan una clave de API para conectarse a una organización. Cuando se registre una clave de API, se generará una señal que se deberá utilizar con esa clave de API.
fr: Les applications requièrent une clé d'API pour se connecter à une organisation. Lorsqu'une clé d'API est enregistrée, la procédure génère un jeton qui doit être utilisé avec cette clé d'API.
ko: 애플리케이션이 조직에 연결하려면 API 키가 필요합니다. API 키가 등록되면 해당 API 키와 함께 사용해야 하는 토큰이 생성됩니다.

source: The API key will look something like this: a-**org\_id**-a84ps90Ajs
es: La clave de API tendrá un aspecto similar a lo siguiente: a-**id\_org**-a84ps90Ajs
fr: La clé d'API prend la forme suivante : a-**org\_id**-a84ps90Ajs
ko: 이 API 키의 모양은 a-**org\_id**-a84ps90Ajs와 비슷합니다.

source: The token will look something like this: MP$08VKz!8rXwnR-Q*
es: La señal tendrá este aspecto: MP$08VKz!8rXwnR-Q*
fr: Le jeton prend la forme suivante : MP$08VKz!8rXwnR-Q*
ko: 이 토큰의 모양은 MP$08VKz!8rXwnR-Q*와 비슷합니다.

source: When making an MQTT connection using an API key the following applies:
es: Al realizar una conexión MQTT utilizando una clave de API, se aplica lo siguiente:
fr: Lorsque vous établissez une connexion MQTT à l'aide d'une clé d'API, les éléments suivants s'appliquent :
ko: API 키를 사용하여 MQTT 연결을 작성하는 경우 다음이 적용됩니다.

source: MQTT client ID: a:**org\id**:**app\_id**
es: ID de cliente MQTT: a:**id\org**:**id\_aplic**
fr: ID client MQTT : a:**org\id**:**app\_id**
ko: MQTT 클라이언트 ID: a:**org\id**:**app\_id**

source: MQTT username must be the API key: a-**org\_id**-a84ps90Ajs
es: El nombre de usuario de MQTT debe ser la clave de API: a-**id\_org**-a84ps90Ajs
fr: Le nom d'utilisateur MQTT doit être la clé d'API : a-**org\_id**-a84ps90Ajs
ko: MQTT 사용자 이름은 API 키여야 합니다(a-**org\_id**-a84ps90Ajs).

source: MQTT password must be the authentication token: MP$08VKz!8rXwnR-Q*
es: La contraseña de MQTT debe ser la señal de autenticación: MP$08VKz!8rXwnR-Q*
fr: Le mot de passe MQTT doit être le jeton d'authentification : MP$08VKz!8rXwnR-Q*
ko: MQTT 비밀번호는 인증 토큰이어야 합니다(MP$08VKz!8rXwnR-Q*).

source: Publishing device events
es: Publicación de sucesos de dispositivo
fr: Publication des événements d'un terminal
ko: 디바이스 이벤트 공개

source: An application can publish events as if they came from any registered device.
es: Una aplicación puede publicar sucesos como si procedieran de cualquier dispositivo registrado.
fr: Une application peut publier des événements comme s'ils provenaient d'un terminal enregistré.
ko: 애플리케이션은 이벤트가 등록된 디바이스에서 제공된 것처럼 이벤트를 공개할 수 있습니다.

source: Publish to topic iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
es: Publicar en tema iot-2/type/**tipo\_dispositivo**/id/**id\_dispositivo**/evt/**id\_suceso**/fmt/**serie\_formato**
fr: Publication dans le sujet iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
ko: 주제 iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**에 공개

source: You may have a number of devices that are already generating bespoke data that you wish to send to the IoT Platform. One way to get that data into the service would be to write an application that processes the data and publishes it to the IoT Platform.
es: Es posible que tenga varios dispositivos que ya están generando datos bespoke que desea enviar a IoT Platform. Una manera de obtener esos datos será escribir una aplicación que procese los datos y los publique en la IoT Platform.
fr: Il est possible qu'un certain nombre de vos terminaux génèrent déjà des données personnalisées que vous souhaitez envoyer à IoT Platform. Pour transmettre ces données au service, vous pouvez créer une application qui traite les données et les publie dans IoT Platform.
ko: IoT Platform에 전송할 맞춤형 데이터를 이미 생성 중인 다수의 디바이스가 있을 수 있습니다. 해당 데이터를 서비스로 가져오는 한 가지 방법은 해당 데이터를 처리하는 애플리케이션을 작성하여 IoT Platform에 공개하는 것입니다.

source: Publishing device commands
es: Publicación de mandatos de dispositivo
fr: Publication des commandes d'un terminal
ko: 디바이스 명령 공개

source: An application can publish a command to any registered device.
es: Una aplicación puede publicar un mandato en cualquier dispositivo registrado.
fr: Une application peut publier une commande sur n'importe quel terminal enregistré.
ko: 애플리케이션은 모든 등록된 디바이스에 명령을 공개할 수 있습니다.

source: Publish to topic iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
es: Publicar en tema iot-2/type/**tipo\_dispositivo**/id/**id\_dispositivo**/cmd/**id\_mandato**/fmt/**serie\_formato**
fr: Publication dans le sujet iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
ko: 주제 iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**에 공개

source: Subscribing to device events
es: Suscripción a sucesos de dispositivo
fr: Abonnement aux événements d'un terminal
ko: 디바이스 이벤트 구독

source: An application can subscribe to events from one or more devices.
es: Una aplicación se puede suscribir a sucesos de uno o varios dispositivos.
fr: Une application peut s'abonner aux événements d'un ou de plusieurs terminaux.
ko: 애플리케이션은 하나 이상의 디바이스로부터의 이벤트를 구독할 수 있습니다.

source: Subscribe to topic iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
es: Suscribirse a tema iot-2/type/**tipo\_dispositivo**/id/**id\_dispositivo**/evt/**id\_suceso**/fmt/**serie\_formato**
fr: Abonnement au sujet iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
ko: 주제 iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string** 구독

source: The MQTT "any" wildcard character (+) may be used for any of the following components if you want to subscribe to more than one type of event, or events from more than a single device.
es: Se puede utilizar el carácter comodín de MQTT "any" (+) para cualquiera de los componentes siguientes si desea suscribirse a más de un tipo de suceso o sucesos de más de un dispositivo único.
fr: Le caractère générique MQTT "any" (+) peut être utilisé pour l'un des composants suivants si vous souhaitez vous abonner à plusieurs types d'événement ou aux événements de plusieurs terminaux.
ko: 둘 이상의 이벤트 유형을 구독하거나 둘 이상의 디바이스로부터의 이벤트를 구독하려는 경우 다음의 컴포넌트에 대해 MQTT "임의의" 와일드카드 문자(+)를 사용할 수 있습니다.

source: device\_type
es: tipo\_dispositivo

source: device\_id
es: id\_dispositivo

source: event\_id
es: id\_suceso

source: format\_string
es: serie\_formato

source: Subscribing to device commands
es: Suscripción a mandatos de dispositivo
fr: Abonnement aux commandes d'un terminal
ko: 디바이스 명령 구독

source: An application can subscribe to commands being sent to one or more devices.
es: Una aplicación se puede suscribir a los mandatos que se están enviando a uno o varios dispositivos.
fr: Une application peut s'abonner aux commandes envoyées à un ou plusieurs terminaux.
ko: 애플리케이션은 하나 이상의 디바이스에 전송 중인 명령을 구독할 수 있습니다.

source: Subscribe to topic iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
es: Subscribirse a tema iot-2/type/**tipo\_dispositivo**/id/**id\_dispositivo**/cmd/**id\_mandato**/fmt/**serie\_formato**
fr: Abonnement au sujet iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
ko: 주제 iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string** 구독

source: cmd\_id
es: id\_mandato

source: Subscribing to device status messages
es: Suscripción a mensajes de estado de dispositivo
fr: Abonnement aux messages de statut d'un terminal
ko: 디바이스 상태 메시지 구독

source: An application can subscribe to monitor status of one or more devices.
es: Una aplicación se puede suscribir al estado de supervisión de uno o varios dispositivos.
fr: Une application peut s'abonner pour surveiller le statut d'un ou de plusieurs terminaux.
ko: 애플리케이션은 하나 이상의 디바이스의 모니터 상태를 구독할 수 있습니다.

source: Subscribe to topic iot-2/type/**device\_type**/id/**device\_id**/mon
es: Suscribirse a tema iot-2/type/**tipo\_dispositivo**/id/**id\_dispositivo**/mon
fr: Abonnement au sujet iot-2/type/**device\_type**/id/**device\_id**/mon
ko: 주제 iot-2/type/**device\_type**/id/**device\_id**/mon 구독

source: The MQTT "any" wildcard character (+) may be used for any of the following components if you want to subscribe to updates from more than one device.
es: Se puede utilizar el carácter comodín de MQTT "any" (+) para cualquiera de los componentes siguientes si desea suscribirse a las actualizaciones de más de un dispositivo.
fr: Le caractère générique MQTT "any" (+) peut être utilisé pour l'un des composants suivants si vous souhaitez vous abonner aux mises à jour de plusieurs terminaux.
ko: 둘 이상의 디바이스로부터의 업데이트를 구독하려는 경우 다음의 컴포넌트에 대해 MQTT "임의의" 와일드카드 문자(+)를 사용할 수 있습니다.

source: Subscribing to application status messages
es: Suscripción a mensajes de estado de aplicación
fr: Abonnement aux messages de statut d'une application
ko: 애플리케이션 상태 메시지 구독

source: An application can subscribe to monitor status of one or more applications.
es: Una aplicación se puede suscribir al estado de supervisión de una o varias aplicaciones.
fr: Une application peut s'abonner pour surveiller le statut d'une ou de plusieurs applications.
ko: 애플리케이션은 하나 이상의 애플리케이션의 모니터 상태를 구독할 수 있습니다.

source: Subscribe to topic iot-2/app/**app\_id**/mon
es: Subscribirse a tema iot-2/app/**id\_aplic**/mon
fr: Abonnement au sujet iot-2/app/**app\_id**/mon
ko: 주제 iot-2/app/**app\_id**/mon 구독

source: The MQTT "any" wildcard character (+) may be used for **app\_id** if you want to subscribe for updates for all applications.
es: Se puede utilizar el carácter comodín de MQTT "any" (+) para **id\_aplic** si desea suscribirse a las actualizaciones de todas las aplicaciones.
fr: Le caractère générique MQTT "any" (+) peut être utilisé pour **app\_id** si vous souhaitez vous abonner aux mises à jour de toutes les applications.
ko: 모든 애플리케이션에 대한 업데이트를 위해 구독하려는 경우 **app\_id**에 대해 MQTT "임의의" 와일드카드 문자(+)를 사용할 수 있습니다.

source: Quickstart restrictions
es: Restricciones de Quickstart
fr: Restrictions liées à Quickstart
ko: Quickstart 제한사항

source: If you are writing application code that wants to support use with Quickstart you must take into account the following features present in the registered service that are not supported in Quickstart:
es: Si está escribiendo código de aplicación que desea soportar el uso con Quickstart, debe tener en cuenta las siguientes características presentes en el servicio registrado que no se soportan en Quickstart:
fr: Si vous créez un code d'application que vous souhaitez utiliser avec Quickstart, vous devez prendre en considération les fonctions suivantes qui sont disponibles dans le service enregistré mais qui ne sont pas prises en charge dans Quickstart :
ko: Quickstart와 함께 사용하도록 지원할 애플리케이션 코드를 작성하는 경우에는 Quickstart에서 지원되지 않는 등록된 서비스에 있는 다음과 같은 기능을 고려해야 합니다.

source: Publishing commands
es: Publicación de mandatos
fr: Publication de commandes
ko: 명령 공개

source: Subscribing to commands
es: Suscripción a mandatos
fr: Abonnement à des commandes
ko: 명령 구독

source: Use of the MQTT "any" wildcard character (+) for the following topic components:
es: Uso del carácter comodín de MQTT "any" (+) para los siguientes componentes de tema:
fr: Utilisez le caractère générique MQTT "any" (+) pour les composants de sujet suivants :
ko: 다음의 주제 컴포넌트에 대해 MQTT "임의의" 와일드카드 문자(+) 사용:

source: app\_id
es: id\_aplic

source: MQTT connection over SSL
es: Conexión de MQTT sobre SSL
fr: Connexion MQTT sur SSL
ko: SSL을 통한 MQTT 연결

source: Scalable Applications
es: Aplicaciones escalables
fr: Applications évolutives
ko: 확장 가능 애플리케이션

source: You can build scalable applications which will load balance messages across multiple instances of your application by making a few changes to how your application connects to the IoT Platform. Applications taking advantage of this feature must only attempt to make non-durable subscriptions. A bit of experimentation may be needed to understand how many clients are needed for the optimum balance in load.
es: Puede crear aplicaciones escalables que cargarán mensajes de equilibrio de carga en varias instancias de la aplicación realizando unos pocos cambios en el modo en que la aplicación se conecta a IoT Platform. Las aplicaciones que utilizan esta característica solo deben intentar realizar suscripciones no duraderas. Es posible que sea necesario experimentar un poco para conocer cuántos clientes se necesitan para obtener el equilibrio óptimo en la carga.
fr: Vous pouvez créer des applications évolutives qui équilibrent la charge des messages entre plusieurs instances de votre application en modifiant légèrement la manière dont votre application se connecte à IoT Platform. Les applications qui utilisent cette fonction doivent essayer uniquement de créer des abonnements non durables. Une phase d'expérimentation peut être nécessaire pour déterminer le nombre de clients requis pour effectuer un équilibrage de charge optimal.
ko: 애플리케이션이 IoT Platform에 연결하는 방법을 약간 변경하여 애플리케이션의 여러 인스턴스에 걸쳐 메시지를 로드 밸런싱하는 확장 가능 애플리케이션을 빌드할 수 있습니다. 이 기능을 이용하는 애플리케이션은 비지속 구독 작성만을 시도해야 합니다. 로드에서 최적의 밸런스에 필요한 클라이언트 수를 파악하는 데 약간의 실험이 필요할 수 있습니다.

source: Supply a client id of the form **A**:**org\_id**:**app\_id**
es: Proporcione un id de cliente con el formato **A**:**org\_id**:**app\_id**
fr: Indiquez un ID client sous la forme **A**:**org\_id**:**app\_id**
ko: **A**:**org\_id**:**app\_id** 양식의 클라이언트 ID 제공

source: **A** indicates the client is a scalable application
es: **A** indica que el cliente es una aplicación escalable
fr: **A** indique que le client est une application évolutive
ko: **A**는 클라이언트가 확장 가능 애플리케이션임을 표시함

source: Create a non-durable subscription
es: Crear suscripciones no duraderas
fr: Créez un abonnement non durable
ko: 비지속 구독 작성

source: Only non-durable subscriptions are supported for scalable applications. Please note that the client id must begin with a capital 'A' in order to designated as a scalable application by the IoT Platform. Multiple clients that are part of the scalable application should use the exact same client id.
es: Solo se admiten suscripciones no duraderas para aplicaciones escalables. Tenga en cuenta que el ID de cliente debe empezar con una 'A' mayúscula para que IoT Platform la designe como una aplicación escalable. Varios clientes que formen parte de la aplicación escalable deben utilizar el mismo ID de cliente exacto.
fr: Seuls les abonnements non durables sont pris en charge pour les applications évolutives. Notez que l'ID client doit commencer par la lettre majuscule 'A' pour permettre à IoT Platform de l'identifier en tant qu'application évolutive. Les différents clients qui font partie de l'application évolutive doivent utiliser exactement le même ID client.
ko: 비지속 구독만 확장 가능 애플리케이션에 지원됩니다. IoT Platform에서 확장 가능 애플리케이션으로 지정하려면 클라이언트 ID가 대문자 'A'로 시작해야 합니다. 확장 가능 애플리케이션의 파트인 여러 클라이언트가 정확히 동일한 클라이언트 ID를 사용해야 합니다.

source: How It Works
es: Cómo funciona
fr: Fonctionnement
ko: 작동 방식
