Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/getting_started/concepts.po
Languages: es, fr

source: Concepts
es: Conceptos

source: Organizations
es: Organizaciones
fr: Organisations

source: When you register with the Watson IoT platform you are given an organization ID, this is a unique 6 character identifier for your account.
es: Cuando un usuario se registra en Watson IoT Platform, se le proporciona un ID de organización, que es un identificador exclusivo de 6 caracteres para su cuenta.
fr: Lorsque vous vous enregistrez auprès de Watson IoT Platform, un ID organisation vous est attribué. Il s'agit d'un identificateur unique de 6 caractères correspondant à votre compte.

source: **Organizations** ensure your data is only accessible from your devices and applications. Once registered, devices and API keys are bound to a single organization. When an application connects to the service using an API key it registers with the organization that "owns" the API key.
es: Las **organizaciones** garantizan que sus datos solo son accesibles desde sus dispositivos y aplicaciones. Una vez registrados, los dispositivos y las claves de API se vinculan a una sola organización. Cuando una aplicación se conecta al servicio utilizando una clave de API, se registra en la organización que es "propietaria" de la clave de API.
fr: Les **organisations** permettent de s'assurer que vos données sont accessibles uniquement à partir de vos terminaux et de vos applications. Une fois l'enregistrement terminé, les terminaux et les clés d'API sont liés à une seule organisation. Lorsqu'une application se connecte au service à l'aide d'une clé d'API, elle s'enregistre dans l'organisation "propriétaire" de la clé d'API.

source: For your security it is impossible for cross-organization communication within the Watson IoT platform eco-system, intentional or otherwise. The only way to transmit data between two organizations it to explicitly create two applications, one within each organization, that communicate with each other to act as a relay between the organizations.
es: Por motivos de seguridad, la comunicación entre distintas organizaciones resulta imposible dentro del ecosistema de Watson IoT Platform, tanto intencionada como de otro tipo. El único modo de transmitir datos entre dos organizaciones es crear explícitamente dos aplicaciones, una en cada organización, que se comuniquen entre ellas para actuar como retransmisor entre dichas organizaciones.
fr: Pour des raisons de sécurité, les communications, intentionnelles ou non, entre les organisations sont impossibles au sein de l'écosystème Watson IoT Platform. Le seul moyen de transmettre des données entre deux organisations consiste à créer explicitement deux applications (une dans chaque organisation) qui communiquent l'une avec l'autre pour assurer une fonction de relais entre les organisations.

source: Devices
es: Dispositivos
fr: Terminaux

source: A device can be anything that has a connection to the internet and has data it wants to get into the cloud.
es: Un dispositivo puede ser cualquier objeto que tenga una conexión a Internet y tenga datos que desea poner en la nube.
fr: Un terminal peut être n'importe quel objet connecté à Internet dont les données doivent être envoyées au cloud.

source: A device is not able to directly interact with other devices.
es: Un dispositivo no puede interactuar directamente con otros dispositivos.
fr: Un terminal ne peut pas interagir directement avec d'autres terminaux.

source: Devices are able to accept commands from applications.
es: Los dispositivos pueden aceptar mandatos de las aplicaciones.
fr: Les terminaux peuvent accepter les commandes provenant d'applications.

source: Devices uniquely identify themselves to the Watson IoT platform with an authentication token that will only be accepted for that device.
es: Los dispositivos se identifican de forma exclusiva a sí mismos en Watson IoT Platform con una señal de autenticación que solo se aceptará para dicho dispositivo.
fr: Les terminaux s'identifient de manière unique dans Watson IoT Platform à l'aide d'un jeton d'authentification qui est accepté uniquement pour ce terminal.

source: Devices must be registered before they can connect to the Watson IoT platform.
es: Los dispositivos deben registrarse para poderse conectar a Watson IoT Platform.
fr: Vous devez enregistrer les terminaux pour qu'ils puissent se connecter à Watson IoT Platform.

source: Managed and Unmanaged Devices
es: Dispositivos gestionados y no gestionados
fr: Terminaux gérés et non gérés

source: **Managed devices** are defined as devices which contain a management agent. A management agent is a set of logic which allows the device to interact with the Watson IoT platform Device Management service via the Device Management protocol. Managed devices can perform device management operations including location updates, firmware download and updates, and reboot and factory reset.
es: Los **Dispositivos gestionados** se definen como dispositivos que contienen un agente de gestión. Un agente de gestión es un conjunto de lógica que permite al dispositivo interactuar con el servicio de gestión de dispositivos de Watson IoT Platform a través del protocolo de gestión de dispositivos. Los dispositivos gestionados pueden realizar operaciones de gestión de dispositivos como actualizaciones de ubicaciones, descarga y actualizaciones de firmware y rearranque y restablecimiento de fábrica.
fr: Les **terminaux gérés** sont des terminaux qui incluent un agent de gestion. Un agent de gestion est un bloc de logique qui permet au terminal d'interagir avec le service de gestion des terminaux de Watson IoT Platform via le protocole de gestion des terminaux. Les terminaux gérés peuvent effectuer des opérations de gestion des terminaux, y compris la mise à jour d'un emplacement, le téléchargement et la mise à jour du microprogramme et le réamorçage et la réinitialisation des paramètres d'usine.

source: An **unmanaged device** is a device without a management agent. An unmanaged device can still connect to the Watson IoT platform and send and receive events and commands. However, it cannot send any device management requests, or perform any of the device management operations.
es: Un **dispositivo no gestionado** es un dispositivo sin agente de gestión. Los dispositivos no gestionados se pueden conectar a Watson IoT Platform y enviar y recibir sucesos y mandatos. No obstante, no pueden enviar solicitudes de gestión de dispositivos ni llevar a cabo operaciones de gestión de dispositivos.
fr: Un **terminal non géré** est un terminal sans agent de gestion. Il peut tout de même se connecter à Watson IoT Platform et envoyer et recevoir des événements et des commandes. En revanche, il ne peut pas envoyer de demandes de gestion des terminaux ni effectuer des opérations de gestion des terminaux.

source: Applications
es: Aplicaciones

source: An application is anything that has a connection to the internet and wants to interact with data from devices and/or control the behaviour of those devices in some manner.
es: Una aplicación es cualquier cosa que tiene una conexión a Internet y desea interactuar con datos de dispositivos y/o controlar el comportamiento de esos dispositivos de alguna manera.
fr: Une application représente tout objet connecté à Internet qui souhaite interagir avec des données provenant de terminaux et/ou contrôler le comportement de ces terminaux.

source: Applications identify themselves to the Watson IoT platform with an API key and a unique application ID.
es: Las aplicaciones se identifican a sí mismas ante Watson IoT Platform mediante una clave de API y un ID de aplicación exclusivo.
fr: Les applications s'identifient dans Watson IoT Platform à l'aide d'une clé d'API et d'un ID d'application unique.

source: Applications do not need to be registered before they can connect to the Watson IoT platform, however they must present a valid API key that has previously been registered.
es: Las aplicaciones no necesitan registrarse para poderse conectar a Watson IoT Platform; sin embargo, deben presentar una clave de API válida que se haya registrado anteriormente.
fr: Il est inutile d'enregistrer les applications pour leur permettre de se connecter à Watson IoT Platform. Toutefois, les applications doivent présenter une clé d'API valide qui a été préalablement enregistrée.

source: Gateway Devices
es: Dispositivos de pasarela
fr: Terminaux de passerelle

source: Gateway support is currently available as part of a limited beta. Future updates may include changes incompatible with the current version of this feature. Try it out and `let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
es: En la actualidad, y como parte de una versión beta limitada, las pasarelas están admitidas. Las actualizaciones futuras podrían incluir cambios incompatibles con la versión actual de esta característica. Pruébela y `denos su opinión <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
fr: La prise en charge des passerelles est actuellement disponible dans le cadre d'une version bêta limitée. Il se peut que de futures mises à jour incluent des modifications incompatibles avec la version actuelle de cette fonction. Essayez-la et `faites-nous part de vos commentaires sur la page <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_

source: Gateways are a specialized class of Device. They have the combined capabilities of an Application and a Device allowing them to serve as access points providing connectivity to the service for other devices without the ability to directly connect.
es: Las pasarelas son una clase de dispositivo especializada con las prestaciones combinadas de una aplicación y un dispositivo. Esto les permite servir como puntos de acceso y proporcionar conectividad al servicio para otros dispositivos que carezcan de la capacidad de conectarse de manera directa.
fr: Les passerelles constituent une classe spécialisée de terminal. Elles possèdent les capacités combinées d'une application ainsi que d'un terminal, ce qui leur permet de servir de point d'accès fournissant la connectivité au service pour d'autres terminaux qui ne peuvent pas s'y connecter directement.

source: Gateway devices can register new devices and can send and receive data on behalf of devices connected to them.
es: Los dispositivos de pasarela pueden registrar nuevos dispositivos y pueden enviar y recibir en nombre de los dispositivos que tengan conectados.
fr: Les terminaux de passerelle peuvent enregistrer de nouveaux terminaux et envoyer et recevoir des données pour le compte des terminaux qui leur sont connectés.

source: Gateway Devices must be registered before they can connect to the service
es: Los dispositivos de pasarela deben registrarse para poderse conectar al servicio.
fr: Vous devez enregistrer les terminaux de passerelle pour qu'ils puissent se connecter au service.

source: Events
es: Sucesos
fr: Evénements

source: Events are the mechanism by which **devices** publish data to the Watson IoT platform. The device controls the content of the event and assigns a name for each event it sends.
es: Los sucesos son el mecanismo mediante el cual los **dispositivos** publican datos en Watson IoT Platform. El dispositivo controla el contenido del suceso y asigna un nombre a cada suceso que envía.
fr: Les événements constituent le mécanisme par lequel les **terminaux** publient des données dans Watson IoT Platform. Le terminal contrôle le contenu de l'événement et affecte un nom à chaque événement qu'il envoie.

source: When an event is received by the Watson IoT platform from a device the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
es: Cuando Watson IoT Platform recibe un suceso, se utilizan las credenciales de la conexión en la que se ha recibido dicho suceso para determinar desde qué dispositivo se ha enviado el suceso. Con esta arquitectura, es imposible que un dispositivo pueda suplantar a otro.
fr: Lorsqu'un événement est reçu par Watson IoT Platform depuis un terminal, les données d'identification de la connexion sur laquelle l'événement a été reçu sont utilisées pour identifier le terminal depuis lequel l'événement a été envoyé. Avec cette architecture, il est impossible pour un terminal de simuler les droits d'accès d'un autre terminal.

source: **Devices** are unable to receive events, regardless of whether they are its own events or those of another device.
es: Los **dispositivos** no pueden recibir sucesos, independientemente de que sean sus propios sucesos o los de otro dispositivo.
fr: Les **terminaux** ne peuvent pas recevoir d'événements, qu'il s'agisse de leurs propres événements ou de ceux d'un autre terminal.

source: **Applications** are able to process events from devices in real time. When an application receives an event it has visibility of the source of the event and the data contained in that event. Applications can be configured to subscribe to all events from all devices, a subset of events, a subset of devices or a combination of these events.
es: Las **aplicaciones** pueden procesar en tiempo real los sucesos de los dispositivos. Cuando una aplicación recibe un suceso, tiene visibilidad del origen del suceso y de los datos contenidos en ese suceso. Las aplicaciones se pueden suscribir a todos los sucesos de todos los dispositivos, a un subconjunto de sucesos, un subconjunto de dispositivos o una combinación de estos sucesos.
fr: Les **applications** peuvent traiter en temps réel les événements provenant des terminaux. Lorsqu'une application reçoit un événement, elle peut identifier sa source et les données qu'il contient. Des applications peuvent être configurées pour s'abonner à tous les événements de tous les terminaux, à un sous-ensemble d'événements, à un sous-ensembles de terminaux ou à une combinaison de ces événements.

source: Historical Event Storage
es: Almacenamiento de sucesos históricos
fr: Stockage des événements d'historique

source: Historical event storage allows users to store the data from devices added to their Watson IoT platform organization. Historical event storage activity and duration can be controlled from the settings panel in the Watson IoT platform dashboard.
es: El almacenamiento de sucesos históricos permite a los usuarios almacenar datos procedentes de los dispositivos añadidos a su organización de Watson IoT Platform. La actividad y la duración del almacenamiento de sucesos históricos puede controlarse desde el panel de valores situado en el panel de control de Watson IoT Platform.
fr: Le stockage des événements d'historique permet aux utilisateurs de stocker les données des terminaux ajoutés à leur organisation Watson IoT Platform. Les opérations et la durée de stockage des événements d'historique peuvent être contrôlées via le panneau de paramètres du tableau de bord Watson IoT Platform.

source: When changing settings for historical data storage, keep in mind that storing data for longer periods of time will affect your billing. Also, care should be taken when disabling historical data storage, as upon disabling data storage for your organization, all stored data will be deleted, and cannot be recovered.
es: Cuando cambie los valores de almacenamiento de datos históricos, recuerde que el almacenamiento de datos durante periodos de tiempo más prolongados afectará a la facturación. También debe tener cuidado cuando inhabilite el almacenamiento de datos históricos, ya que si inhabilita el almacenamiento de datos referentes a su organización, se suprimirán todos los datos almacenados y no podrán recuperarse.
fr: Lorsque vous modifiez les paramètres de stockage des données d'historique, gardez à l'esprit que le stockage prolongé de données a une incidence sur le montant facturé. De plus, la désactivation du stockage des données d'historique doit être effectuée avec précaution car cette opération entraîne la suppression définitive de toutes les données stockées pour votre organisation.

source: Historical event storage uses an MQTT Quality of Service level of 0 (delivery at most once), so some data may be lost.
es: El almacenamiento de sucesos históricos utiliza un nivel de calidad de servicio MQTT de 0 (entrega como máximo una vez), por lo que algunos datos pueden perderse.
fr: Le stockage des événements d'historique utilise le niveau de qualité de service MQTT (distribution une fois tout au plus), ce qui signifie que certaines données peuvent être perdues.

source: Commands
es: Mandatos
fr: Commandes

source: **Commands** are the mechanism by which **applications** can communicate with **devices**. Only applications can send commands, which must be issued to specific devices.
es: Los **mandatos** son el mecanismo mediante el cual las **aplicaciones** se pueden comunicar con los **dispositivos**. Solo las aplicaciones pueden enviar mandatos, que se deben emitir en dispositivos específicos.
fr: Les **commandes** représentent le mécanisme par lequel les **applications** peuvent communiquer avec des **terminaux**. Seules les applications peuvent envoyer des commandes, qui doivent être transmises à des terminaux spécifiques.

source: The device must determine which action to take on receipt of any given command, and even controls which commands it will subscribe to in the first place. It is possible to design your device to listen for any command, or to simply subscribe to a set of specific commands.
es: El dispositivo debe determinar qué acción se debe realizar al recibir cualquier mandato proporcionado e incluso controla a qué mandatos se suscribirá en primer lugar. Es posible diseñar que el dispositivo escuche cualquier mandato o simplemente se suscriba a un conjunto de mandatos específicos.
fr: Le terminal doit déterminer l'action à effectuer lors de la réception d'une commande spécifique. Il détermine également les commandes auxquelles il doit s'abonner. Vous pouvez configurer le terminal afin qu'il écoute toutes les commandes ou qu'il s'abonne uniquement à un ensemble de commandes spécifiques.
