Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/getting_started/features.po
Languages: es, fr, ko

source: Feature Overview
es: Visión general de característica
fr: Présentation de la fonction
ko: 기능 개요

source: Device Registry
es: Registro de dispositivo
fr: Registre des terminaux
ko: 디바이스 레지스트리

source: Manage your inventory, configure security, and store metadata for millions of unique devices. Define device types to represent individual device models and apply default metadata to all devices of that type.
es: Gestione el inventario, configure la seguridad y almacene metadatos para millones de dispositivos exclusivos. Defina tipos de dispositivo para representar modelos de dispositivo individuales y aplique los metadatos predeterminados a todos los dispositivos de ese tipo.
fr: Gérez votre stock, configurez la sécurité et stockez des métadonnées pour des millions de terminaux uniques. Définissez des types de terminaux afin de représenter des modèles de terminal individuels et d'appliquer des métadonnées par défaut à tous les terminaux de ce type.
ko: 수백 개의 고유한 디바이스에 대해 인벤토리를 관리하고, 보안을 구성하며, 메타데이터를 저장할 수 있습니다. 개별 디바이스 모델을 나타내는 디바이스 유형을 정의하고 해당 유형의 모든 디바이스에 기본 메타데이터를 적용하십시오.

source: Connectivity
es: Conectividad
fr: Connectivité
ko: 연결

source: Securely connect your devices, gateways and applications directly to the Watson IoT platform via MQTT. See the section on MQTT in the :ref:`reference material <ref-mqtt>` to learn more about the advantages of using this protocol. Model the data from your device as events and control the flow of events into your applications.
es: Conecte de forma segura los dispositivos, las pasarelas y las aplicaciones directamente a Watson IoT Platform a través de MQTT. Consulte la sección sobre MQTT en el :ref:`material de referencia <ref-mqtt>` para obtener más información sobre las ventajas del uso de este protocolo. Modele los datos del dispositivo como sucesos y controle el flujo de sucesos en las aplicaciones.
fr: Connectez vos terminaux, vos passerelles et vos applications en toute sécurité directement à Watson IoT Platform via MQTT. Consultez la section relative à MQTT dans :ref:`reference material <ref-mqtt>` pour en savoir plus sur les avantages que présente l'utilisation de ce protocole. Modélisez les données depuis votre terminal sous forme d'événements et contrôlez le flot d'événements dans vos applications.
ko: MQTT를 통해 Watson IoT Platform에 직접 디바이스, 게이트웨이 및 애플리케이션을 안전하게 연결합니다. 이 프로토콜 사용의 이점에 대한 자세한 정보는 :ref:`참조 자료 <ref-mqtt>`에서 MQTT 절을 참조하십시오. 디바이스의 데이터를 이벤트로 모델링하고 애플리케이션에 대한 이벤트 플로우를 제어하십시오.

source: Gateway Support
es: Soporte de pasarela
fr: Prise en charge de la passerelle
ko: 게이트웨이 지원

source: In many cases where a direct connection can not be made between the service and a device, the Watson IoT platform allows gateway devices to connect that can provide indirect connectivity for multiple devices.
es: En muchos casos, si no se puede establecer una conexión directa entre el servicio y un dispositivo, Watson IoT Platform permite conectar dispositivos de pasarela que pueden proporcionar conectividad indirecta para varios dispositivos.
fr: Souvent, lorsqu'il n'est pas possible d'établir une connexion directe entre le service et un terminal, Watson IoT Platform permet la connexion de terminaux de passerelle afin de fournir une connectivité indirecte pour plusieurs terminaux.
ko: 서비스와 디바이스 간 직접 연결이 불가능한 많은 경우에 Watson IoT Platform에서는 여러 디바이스에 대한 간접 연결을 제공할 수 있는 게이트웨이 디바이스를 연결하도록 허용합니다.

source: Device Management
es: Gestión de dispositivos
fr: Gestion des terminaux
ko: 디바이스 관리

source: Optionally, allow the Watson IoT platform to manage the lifecycle of your devices by implementing support for the Watson IoT platform's device management protocol in your devices. The means by which the device connects to the service does not affect the device management protocol, which functions the same for directly connected, indirectly connected, and gateway devices.
es: Opcionalmente, permita que Watson IoT Platform gestione el ciclo de vida de los dispositivos implementando soporte para el protocolo de gestión de dispositivos de Watson IoT Platform en los dispositivos. Los medios mediante los cuales el dispositivo se conecta al servicio no afectan al protocolo de gestión de dispositivos, que funciona igual para dispositivos de pasarela conectados directamente y conectados indirectamente.
fr: Si vous le souhaitez, autorisez Watson IoT Platform à gérer le cycle de vie de vos terminaux en implémentant la prise en charge du protocole de gestion des terminaux de Watson IoT Platform dans vos terminaux. Le moyen par lequel le terminal se connecte au service n'a pas d'impact sur le protocole de gestion des terminaux, qui fonctionne de la même manière pour les terminaux connectés directement, les terminaux connectés indirectement et les terminaux de passerelle.
ko: 선택적으로, Watson IoT Platform에서는 Watson IoT Platform의 디바이스 관리 프로토콜에 대한 지원을 디바이스에 구현하여 디바이스의 라이프사이클을 관리할 수 있습니다. 디바이스가 서비스에 연결되는 방식은 디바이스 관리 프로토콜에 영향을 미치지 않으므로, 이 프로토콜은 직접 연결 디바이스, 간접 연결 디바이스 및 게이트웨이 디바이스에 대해 동일하게 작동합니다.

source: External Service Integration
es: Integración de servicio externo
fr: Intégration de service externe
ko: 외부 서비스 통합

source: The Watson IoT platform supports integration with external services to bring data and operations supported by other online services into the platform, allowing your application and device developers to seemlessly interact with those services without ever leaving the comfort of the Watson IoT platform APIs.
es: Watson IoT Platform soporta la integración con los servicios externos para incorporar datos y operaciones soportados por otros servicios en línea a la plataforma, permitiendo que los desarrolladores de aplicaciones y dispositivos interactúen sin interrupciones con esos servicios sin salir nunca de la comodidad de las API de Watson IoT Platform.
fr: Watson IoT Platform prend en charge l'intégration à des services externes afin d'apporter des données et des opérations prises en charge par d'autres services en ligne dans la plateforme, ce qui permet à votre application et aux développeurs de terminaux d'interagir en toute transparence avec ces services sans jamais renoncer au confort des API Watson IoT Platform.
ko: Watson IoT Platform은 다른 온라인 서비스에서 지원하는 데이터와 오퍼레이션을 플랫폼으로 가져올 수 있도록 외부 서비스와의 통합을 지원하므로, 애플리케이션 및 디바이스 개발자는 익숙한 Watson IoT platform API를 그대로 사용하면서 이러한 서비스와 원활하게 상호작용할 수 있습니다.

source: This feature is currently available as part of a limited beta. Future updates may include changes incompatible with the current version of this feature. Try it out and `let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
es: Esta característica está disponible actualmente como parte de una versión beta limitada. Las actualizaciones futuras podrían incluir cambios incompatibles con la versión actual de esta característica. Pruébela y `denos su opinión <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
fr: Cette fonction est actuellement disponible dans le cadre d'une version bêta limitée. Il se peut que de futures mises à jour incluent des modifications incompatibles avec la version actuelle de cette fonction. Essayez-la et `faites-nous part de vos commentaires sur la page <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
ko: 이 기능은 현재 제한된 베타의 일부로 제공됩니다. 추가 업데이트에는 이 기능의 현재 버전과 호환되지 않는 변경사항이 포함될 수 있습니다. 이 기능을 사용해 본 후 `의견을 알려주십시오 <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_.

source: Historian
es: Historiador
fr: Historique
ko: 히스토리언

source: Configure the Watson IoT platform to store a record of the events your devices generate.
es: Configure Watson IoT Platform para almacenar un registro de los sucesos que los dispositivos generan.
fr: Configurez Watson IoT Platform pour stocker un enregistrement des événements générés par vos terminaux.
ko: 디바이스가 생성하는 이벤트 레코드를 저장하도록 Watson IoT Platform을 구성하십시오.

source: **Message format restrictions apply to the Historian**
es: **Las restricciones de formato de mensaje se aplican al historiador**
fr: **Des restrictions de format de message s'appliquent à l'historique**
ko: **히스토리언에 적용되는 메시지 형식 제한사항**

source: The historian feature only supports JSON messages meeting specific critera:
es: La característica de historiador solo soporta mensajes JSON que cumplen criterios específicos:
fr: La fonction d'historique ne prend en charge que les messages JSON satisfaisant certains critères :
ko: 히스토리언 기능은 특정 기준을 충족하는 JSON 메시지만 지원합니다.

source: The message must be a valid JSON object (not an array) with only two top level elements: ``d`` and ``ts``
es: El mensaje debe ser un objeto (no una matriz) JSON válido con solo dos elementos de nivel superior: ``d`` y ``ts``
fr: Le message doit être un objet JSON valide (et non un tableau) incluant uniquement deux éléments de niveau supérieur : ``d`` et ``ts``
ko: 메시지는 두 개의 최상위 레벨 요소(``d`` 및 ``ts``)만 포함하는 올바른 JSON 오브젝트(배열 아님)여야 합니다.

source: The message must be UTF-8 encoded
es: El mensaje debe estar codificado en UTF-8
fr: Le message doit utiliser le codage UTF-8
ko: 메시지는 UTF-8 인코딩되어 있어야 함

source: The message must be less than 4kb
es: El mensaje debe tener menos de 4 kb.
fr: La taille du message doit être inférieure à 4 ko
ko: 메시지는 4KB 미만이어야 함

source: **Data**
es: **Datos**
fr: **Données**
ko: **데이터**

source: The **d** element is where you include all data for the event (or command) being transmitted in the message.
es: El elemento **d** es el lugar donde se incluyen todos los datos para el suceso (o mandato) que se está transmitiendo en el mensaje.
fr: **d** est l'élément où vous placez toutes les données de l'événement (ou de la commande) transmises dans le message.
ko: **d** 요소는 메시지에서 전송 중인 이벤트(또는 명령)에 대한 모든 데이터를 포함하는 위치입니다.

source: This element is required for your message to meet the Watson IoT platform message specification.
es: Este elemento es necesario para que el mensaje cumpla con la especificación de mensajes de Watson IoT Platform.
fr: Cet élément est requis pour que votre message satisfasse la spécification de message Watson IoT Platform.
ko: 이 요소는 메시지가 Watson IoT Platform 메시지 스펙을 충족시키는 데 필요합니다.

source: This must always be a JSON object (not an array)
es: Este debe ser siempre un objeto JSON (no una matriz)
fr: Il doit toujours s'agir d'un objet JSON (non d'un tableau)
ko: 이는 항상 JSON 오브젝트(배열 아님)여야 함

source: In the case where you wish to send no data the **d** element should still be present, but contain an empty object.
es: En caso de que no desee enviar datos, el elemento **d** debe estar presente de todas formas, pero debe contener un objeto vacío.
fr: Si vous ne souhaitez pas envoyer de données, l'élément **d** doit toujours être indiqué mais il doit contenir un objet vide.
ko: 데이터를 전송하지 않으려는 경우에는 **d** 요소가 여전히 존재해야 하지만 비어 있는 오브젝트를 포함해야 합니다.

source: **Timestamp**
es: **Indicación de fecha y hora**
fr: **Horodatage**
ko: **시간소인**

source: The **ts** element allows you to associate a timestamp with the event (or command). This is an optional element, if included its value should be a valid ISO8601 timestamp.
es: El elemento **ts** le permite asociar una indicación de fecha y hora con el suceso (o mandato). Este es un elemento opcional; si se incluye, el valor debe ser una indicación de fecha y hora ISO8601 válida.
fr: L'élément **ts** permet d'associer un horodatage à l'événement (ou à la commande). Il s'agit d'un élément facultatif. S'il est inclus, sa valeur doit être un horodatage ISO8601 valide.
ko: **ts** 요소를 사용하면 시간소인을 이벤트(또는 명령)와 연관시킬 수 있습니다. 이 요소는 선택적 요소로서, 포함된 경우 값이 올바른 ISO8601 시간소인이어야 합니다.

source: **Example**
es: **Ejemplo**
fr: **Exemple**
ko: **예**

source: Last Event Cache
es: Memoria caché de últimos sucesos
fr: Dernier cache d'événement
ko: 마지막 이벤트 캐시

source: The API can now return the last recorded value of an event-id for a specific device, or the last recorded value for each event-id reported by a specific device. The last event cache only applies to values sent in the last 30 days.
es: Ahora la API puede devolver el último valor registrado de un event-id correspondiente a un dispositivo específico o el último valor registrado correspondiente a cada event-id notificado por un dispositivo específico. La memoria caché de últimos sucesos sólo se aplica a valores enviados durante los últimos 30 días.
fr: Désormais, l'API peut renvoyer la dernière valeur enregistrée d'un ID d'événement pour un terminal spécifique ou la dernière valeur enregistrée pour chaque ID d'événement signalé par un terminal spécifique. Le dernier cache d'événement ne s'applique qu'aux valeurs envoyées au cours des 30 derniers jours.
ko: 이제 API가 특정 디바이스에 대해 event-id의 마지막으로 기록된 값 또는 특정 디바이스에서 보고하는 각 event-id에 대해 마지막으로 기록된 값을 리턴할 수 있습니다. 마지막 이벤트 캐시는 최근 30일 동안 전송된 값에만 적용됩니다.

source: To request the most recent value for a specific event-id, use the following API request. This request will return the last recorded value for the event-id "power".
es: Para solicitar el valor más reciente de un event-id específico, utilice la siguiente solicitud de la API. Esta solicitud devolverá el último valor registrado del event-id "power".
fr: Pour obtenir la valeur la plus récente d'un ID d'événement spécifique, utilisez la demande d'API ci-après. Elle renvoie la dernière valeur enregistrée pour l'ID d'événement "power".
ko: 특정 event-id에 대한 가장 최신 값을 요청하려면 다음 API 요청을 사용하십시오. 이 요청은 event-id "power"에 대해 마지막으로 기록된 값을 리턴합니다.

source: The response is returned as JSON in the following format:
es: La respuesta se devuelve como JSON en el formato siguiente:
fr: La réponse est renvoyée en tant qu'objet JSON au format suivant :
ko: 응답은 다음 형식의 JSON으로 리턴됩니다.

source: Alternatively, to request the most recent value for each event-id reported by this device, use the following API request.
es: Como alternativa, para solicitar el valor más reciente correspondiente a cada event-id notificado por este dispositivo, utilice la siguiente solicitud de la API.
fr: Sinon, pour obtenir la valeur la plus récente pour chaque ID d'événement signalé par ce terminal, utilisez la demande d'API ci-après.
ko: 또는 이 디바이스에서 보고하는 각 event-id에 대한 가장 최신 값을 요청하려면 다음 API 요청을 사용하십시오.

source: The response will include all event-id's sent by the device. In this instance, it returns values for the "power" and "temperature" events.
es: La respuesta incluirá todos los event-id enviados por el dispositivo. En esta instancia, devuelve los valores de los sucesos "power" y "temperature".
fr: La réponse inclut tous les ID d'événement envoyés par le terminal. Dans cet exemple, elle renvoie les valeurs des événements "power" et "temperature".
ko: 응답에는 디바이스에서 전송하는 모든 event-id가 포함됩니다. 이 경우, "power" 및 "temperature" 이벤트에 대한 값을 리턴합니다.
