Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/extensions/index.po
Languages: es, fr, ko

source: External Service Integrations
es: Integraciones de servicios externos
fr: Intégrations de service externe
ko: 외부 서비스 통합

source: Overview
es: Descripción general
fr: Présentation
ko: 개요

source: External service integration allows you to bind metadata or function supported by another service to your Watson IoT account.
es: La integración de servicios externos permite enlazar metadatos o funciones admitidas por otro servicio con su cuenta de Watson IoT.
fr: L'intégration de service externe permet de lier des métadonnées ou une fonction qu'un autre service prend en charge à votre compte Watson IoT.
ko: 외부 서비스 통합을 사용하여 다른 서비스에서 지원하는 메타데이터 또는 함수를 Watson IoT 계정에 바인드할 수 있습니다.

source: Jasper is an administration and management platform for SIM devices. Jasper has been integrated into the IBM Watson IoT platform dashboard, making it possible to administer Jasper devices through your Watson IoT platform organization dashboard.
es: Jasper es una plataforma de administración y gestión de dispositivos SIM. Jasper se ha integrado en el panel de control de la IBM Watson IoT Platform, lo que permite administrar dispositivos Jasper a través del panel de control de la organización de Watson IoT Platform.
fr: Jasper est une plateforme de gestion et d'administration des terminaux SIM. Il a été intégré au tableau de bord d'IBM Watson IoT Platform pour permettre l'administration de terminaux Jasper via le tableau de bord de votre organisation Watson IoT Platform.
ko: Jasper는 SIM 디바이스의 관리 플랫폼입니다. Jasper가 IBM Watson IoT Platform 대시보드로 통합되어 Watson IoT Platform 조직 대시보드를 통해 Jasper 디바이스를 관리할 수 있게 되었습니다.

source: Jasper integration is currently available as part of a limited beta. Future updates may include changes incompatible with the current version of this feature.
es: En la actualidad, la integración de Jasper está disponible como parte de una versión beta limitada. Las actualizaciones futuras podrían incluir cambios incompatibles con la versión actual de esta característica.
fr: L'intégration Jasper est actuellement disponible dans le cadre d'une version bêta limitée. Il se peut que de futures mises à jour incluent des modifications incompatibles avec la version actuelle de cette fonction.
ko: Jasper 통합은 현재 제한된 베타의 일부로 제공됩니다. 추가 업데이트에는 이 기능의 현재 버전과 호환되지 않는 변경사항이 포함될 수 있습니다.

source: Supported Operations
es: Operaciones admitidas
fr: Opérations prises en charge
ko: 지원되는 오퍼레이션

source: The built-in Jasper integration provided by our platform provides support for the following Jasper operations:
es: La integración de Jasper incorporada que proporciona nuestra plataforma brinda soporte para las siguientes operaciones de Jasper:
fr: L'intégration Jasper intégrée mise à disposition par notre plateforme fournit la prise en charge des opérations Jasper suivantes :
ko: 당사의 플랫폼에서 기본 제공하는 Jasper 통합은 다음과 같은 Jasper 오퍼레이션에 대한 지원을 제공합니다.

source: View overall Jasper data
es: Ver datos de Jasper generales
fr: Afficher les données Jasper globales
ko: 전체 Jasper 데이터 보기

source: Shows: Status, Rate Plan, month-to-date data usage, month-to-date SMS usage, month-to-date voice usage, overage limits, date added, and date modified.
es: Muestra el estado, el plan de tarifas, el uso de datos mensual hasta la fecha, el uso de SMS mensual hasta la fecha, el uso de voz mensual hasta la fecha, los límites por exceso de datos, la fecha de añadido y la fecha de modificación.
fr: Affiche le statut, le plan tarifaire, l'utilisation mensuelle des données à ce jour, l'utilisation mensuelle des SMS à ce jour, l'utilisation mensuelle de la voix à ce jour, les limites de dépassement, les dates d'ajout et les dates de modification.
ko: 표시: 상태, 등급 플랜, 당월 합계 데이터 사용, 당월 합계 SMS 사용, 당월 합계 음성 사용, 초과 한계, 추가된 날짜 및 수정된 날짜

source: Change SIM activation state.
es: Cambiar el estado de activación de SIM
fr: Modifier l'état d'activation d'un terminal SIM
ko: SIM 활성화 상태를 변경하십시오.

source: Select from: Inventory, Activation Ready, Activated, Deactivated, and Retired.
es: Puede seleccionar entre Inventario, Preparado para la activación, Activado, Desactivado y Retirado.
fr: Sélectionnez : Inventory, Activation Ready, Activated, Deactivated et Retired.
ko: 선택 소스: 인벤토리, 활성화 준비, 활성화됨, 비활성화됨 및 폐기됨

source: View SIM Usage
es: Ver uso de SIM
fr: Afficher l'utilisation du terminal SIM
ko: SIM 사용량 보기

source: Shows: Cycle start date, billable and total data, billable and total SMS, billable and total voice.
es: Muestra la fecha de inicio de ciclo, los datos totales y facturables, los SMS totales y facturables y la voz total y facturable.
fr: Affiche la date de début du cycle, les données facturables et le total des données, les SMS facturables et le total des SMS, la voix facturable et le total pour la voix.
ko: 표시: 주기 시작 날짜, 청구 가능 및 총계 데이터, 청구 가능 및 총계 SMS, 청구 가능 및 총계 음성

source: The cycle start date can be set using a YYYY-MM-DD format.
es: La fecha de inicio del ciclo puede establecerse con un formato AAAA-MM-DD.
fr: La date de début du cycle peut être définie au format AAAA-MM-JJ.
ko: 주기 시작 날짜는 YYYY-MM-DD 형식으로 설정할 수 있습니다.

source: Send SMS to SIM
es: Enviar SMS a SIM
fr: Envoyer un SMS à un terminal SIM
ko: SIM에 SMS 전송

source: Change rate plan
es: Cambiar el plan de tarifas
fr: Modifier le plan tarifaire
ko: 등급 플랜 변경

source: These operations can be accessed in the device drilldown of a Jasper connected device after the configuration steps below are completed.
es: Puede acceder a estas operaciones en el menú Obtener detalles de dispositivo de un dispositivo conectado de Jasper, una vez realizados los pasos de configuración siguientes.
fr: Ces opérations sont accessibles dans le menu d'exploration d'un terminal connecté via Jasper, après l'exécution des étapes de configuration ci-dessous.
ko: 아래의 구성 단계가 완료된 후 Jasper 연결 디바이스의 디바이스 드릴다운에서 이러한 오퍼레이션에 액세스할 수 있습니다.

source: Configuration
es: Configuración
ko: 구성

source: In order to connect your Watson IoT Platform platform organization with your Jasper account, there are two stages of configuration which must first be performed. The first stage of configuration is Organization Configuration.
es: Para poder conectar la organización de la plataforma Watson IoT Platform a su cuenta de Jasper, antes debe ejecutar dos etapas de configuración. La primera etapa de configuración es Configuración de organización.
fr: Pour connecter votre organisation Watson IoT Platform à votre compte Jasper, vous devez d'abord effectuer deux étapes de configuration. La première étape de configuration est la configuration de l'organisation.
ko: Watson IoT Platform 조직을 Jasper 계정과 연결하기 위해 우선 수행해야 하는 두 가지 구성 단계가 있습니다. 구성의 첫 번째 단계는 조직 구성입니다.

source: Extension Enablement
es: Habilitación de las extensiones
fr: Activation de l'extension
ko: 확장 지원

source: To enable Jasper integrtion with your Watson IoT organization follow these steps:
es: Para habilitar la integración de Jasper en su organización de Watson IoT, siga estos pasos:
fr: Pour activer l'intégration Jasper à votre organisation Watson IoT, procédez comme suit :
ko: Watson IoT 조직과 Jasper 통합을 지원하려면 다음 단계를 수행하십시오.

source: When in your Watson IoT platform dashboard, click the wrench icon on the right to open the Configuration Settings.
es: En el panel de control de Watson IoT Platform, pulse el icono de la llave inglesa de la derecha para abrir los valores de configuración.
fr: Lorsque vous vous trouvez dans le tableau de bord Watson IoT Platform, cliquez sur l'icône en forme de clé à molette dans la partie droite pour afficher les paramètres de configuration.
ko: Watson IoT Platform 대시보드에서 오른쪽의 렌치 아이콘을 클릭하여 구성 설정을 여십시오.

source: Scroll down the to the Extensions section, and set Jasper to 'On'.
es: Desplácese hacia abajo hasta la sección Extensiones y establezca Jasper en 'Activado'.
fr: Faites défiler la page jusqu'à la section Extensions, puis associez l'option Jasper à la valeur 'Activé'.
ko: 확장기능 섹션으로 화면 이동하여 Jasper를 'On'으로 설정하십시오.

source: Enter your Jasper username, password, license key, and API endpoint.
es: Especifique su nombre de usuario de Jasper, la contraseña, la clave de licencia y el punto final de API.
fr: Entrez votre nom d'utilisateur, votre mot de passe, votre clé de licence et votre noeud final d'API Jasper.
ko: Jasper 사용자 이름, 비밀번호, 라이센스 키 및 API 엔드포인트를 입력하십시오.

source: Device Configuration
es: Configuración del dispositivo
fr: Configuration d'un terminal
ko: 디바이스 구성

source: Devices which are connected to both your Watson IoT platform organization and your Jasper account can be configured to display data from Jasper in the Watson IoT platform dashboard. Jasper configuration cannot be applied as part of the Add Device process, only already connected devices can be configured with Jasper. To configure your Jasper-connected devices, follow these steps:
es: Los dispositivos que se conectan tanto a la organización de Watson IoT Platform como a la cuenta de Jasper pueden configurarse para mostrar datos de Jasper en el panel de control de Watson IoT Platform. La configuración de Jasper no puede aplicarse como parte del proceso Añadir dispositivo; solo pueden configurarse con Jasper dispositivos ya conectados. Para configurar los dispositivos conectados con Jasper, siga estos pasos:
fr: Les terminaux connectés à votre organisation Watson IoT Platform et à votre compte Jasper peuvent être configurés pour afficher les données de Jasper dans le tableau de bord Watson IoT Platform. La configuration de Jasper ne peut pas être appliquée lors d'une procédure d'ajout d'un terminal ; seuls les terminaux déjà connectés peuvent être configurés avec Jasper. Pour configurer des terminaux connectés via Jasper, procédez comme suit :
ko: Watson IoT Platform 조직 및 Jasper 계정에 모두 연결되는 디바이스를 구성하여 Jasper의 데이터를 Watson IoT Platform 대시보드에 표시할 수 있습니다. Jasper 구성은 디바이스 추가 프로세스의 파트로 적용될 수 없고, 이미 연결된 디바이스만 Jasper로 구성될 수 있습니다. Jasper 연결 디바이스를 구성하려면 다음 단계를 따르십시오.

source: In the devices tab of your Watson IoT platform dashboard, find the Jasper-connected device to be configured.
es: En la pestaña Dispositivos del panel de control de Watson IoT Platform, busque el dispositivo conectado con Jasper que se desea configurar.
fr: Dans l'onglet des terminaux du tableau de bord Watson IoT Platform, recherchez le terminal connecté via Jasper que vous souhaitez configurer.
ko: Watson IoT Platform 대시보드의 디바이스 탭에서 구성할 Jasper 연결 디바이스를 찾으십시오.

source: Select the device to open the Device Drilldown view.
es: Seleccione el dispositivo para abrir la vista Obtener detalles de dispositivo.
fr: Sélectionnez le terminal pour ouvrir la vue Exploration du terminal.
ko: 디바이스 드릴다운 보기를 열 디바이스를 선택하십시오.

source: Scroll down to the 'Extension Configuration section. The extension configuration must be entered as JSON in the following format:
es: Desplácese a la sección Configuración de extensiones. La configuración de extensión debe especificarse como JSON con el siguiente formato:
fr: Faites défiler la section Configuration d'une extension. La configuration d'une extension doit être indiquée sous la forme d'un objet JSON dans le format suivant :
ko: 확장기능 구성 섹션으로 화면 이동하십시오. 확장기능 구성은 다음 형식에서 JSON으로 입력되어야 합니다.

source: When this has been entered, click 'Confirm changes' to save the configuration.
es: Una vez especificado, pulse 'Confirmar cambios' para guardar la configuración.
fr: Une fois ces données entrées, cliquez sur 'Confirmer les modifications' pour sauvegarder la configuration.
ko: 이를 입력하면 '변경사항 확인'을 클릭하여 구성을 저장하십시오.

source: If the Organization configuration has been completed correctly, the Extensions section should now appear below the Extensions Configuration section in the Device Drilldown.
es: Si la Configuración de organización se ha realizado satisfactoriamente, la sección Extensiones debe aparecer ahora debajo de la sección Configuración de extensiones en el menú Obtener detalles de dispositivo.
fr: Si la configuration de l'organisation a été effectuée correctement, la section Extensions doit maintenant apparaître sous la section Configuration d'une extension de la vue Exploration du terminal.
ko: 조직 구성이 올바르게 완료된 경우 이제 확장기능 섹션이 디바이스 드릴다운에서 확장기능 구성 섹션 아래에 나타나야 합니다.
