Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/device_mgmt/Extra_Examples.po
Languages: de, es, ja, ko, pt_br

source: Examples
de: Beispiele
es: Ejemplos
ja: 例
ko: 예제
pt_br: Exemplos

source: These examples illustrate the API and the behaviour of the device management agent.
de: In den folgenden Beispiele werden die API und das Verhalten des Einheitenmanagementagenten beschrieben.
es: Estos ejemplos ilustran la API y el comportamiento del agente de gestión de dispositivos.
ja: これらの例は API について、およびデバイス管理エージェントの動作について示しています。
ko: 다음 예제에서 API 및 디바이스 관리 에이전트의 동작에 대해 설명합니다.
pt_br: Estes exemplos ilustram a API e o comportamento do agente de gerenciamento de dispositivo.

source: Device Location
de: Einheitenposition
es: Ubicación del dispositivo
ja: デバイスのロケーション
ko: 디바이스 위치
pt_br: Local do Dispositivo

source: An administrator wants to update the location for a device in the Internet of Things Foundation, perhaps using information from a mobile device. A device would use an equivalent mechanismbased on MQTT.
de: Ein Administrator möchte die Position für eine Einheit in Internet of Things Foundation aktualisieren, vielleicht anhand von Informationen auf einem Mobilgerät. Von einer Einheit würde ein funktional entsprechendes Verfahren auf MQTT-Basis verwendet werden.
es: Un administrador desea actualizar la ubicación de un dispositivo en Internet of Things Foundation, quizás utilizando información desde un dispositivo móvil. Un dispositivo debe utilizar un mecanismos equivalente basado en MQTT.
ja: 管理者が Internet of Things Foundation で例えばモバイル・デバイスの情報を使用して、あるデバイスのロケーションを更新します。デバイスは MQTT に基づく同等のメカニズムを使用しています。
ko: 관리자가 모바일 디바이스에서 정보를 사용하는 등의 방법으로 Internet of Things Foundation에서 디바이스의 위치를 업데이트하려고 합니다. 디바이스는 MQTT에 기반한 동등한 메커니즘을 사용합니다.
pt_br: Um administrador deseja atualizar o local de um dispositivo no Internet of Things Foundation, possivelmente usando informações de um dispositivo móvel. Um dispositivo utilizaria um mecanismo equivalente baseado em MQTT.

source: Example Request:
de: Beispielanforderung:
es: Ejemplo de solicitud:
ja: リクエストの例:
ko: 예제 요청:
pt_br: Exemplo de Solicitação:

source: Request Body
de: Anforderungs-Body
es: Cuerpo de solicitud
ja: リクエストの Body
ko: 요청 본문
pt_br: Corpo da Solicitação

source: Device Reboot
de: Neustart einer Einheit
es: Reinicio de dispositivo
ja: デバイスのリブート
ko: 디바이스 다시 부팅
pt_br: Reinicialização do Dispositivo

source: An administrator wants to reboot a device from the device dashboard. This is a long-running asyncronous process.
de: Ein Administrator möchte für eine Einheit im Einheiten-Dashboard einen Neustart durchführen. Hierbei handelt es sich um einen lange laufenden asynchronen Prozess.
es: Un administrador desea reiniciar un dispositivo desde el panel de instrumentos. Se trata de un proceso asíncrono de ejecución larga.
ja: 管理者がデバイス・ダッシュボードからデバイスをリブートします。これは、長時間かかる非同期プロセスです。
ko: 관리자가 디바이스 대시보드에서 디바이스를 다시 부팅하려고 합니다. 이는 장기 실행 중인 비동기 프로세스입니다.
pt_br: Um administrador deseja reinicializar um dispositivo a partir do painel do dispositivo. Este é um processo assíncrono de longa execução.

source: Request body
de: Anforderungs-Body
es: Cuerpo de la solicitud
ja: リクエストの本文
ko: 요청 본문
pt_br: Corpo da solicitação

source: Sequence:
de: Sequenz:
es: Secuencia:
ja: シーケンス:
ko: 시퀀스:
pt_br: Sequência:

source: REST API is issued to the Internet of Things device management server.
de: Die REST-API wird an den Einheitenmanagementserver von Internet of Things Foundation ausgegeben.
es: la API REST se envía al servidor de gestión de dispositivos de Internet of Things.
ja: REST API が Internet of Things デバイス管理サーバーに対して発行されます。
ko: REST API가 Internet of Things 디바이스 관리 서버에 실행됩니다.
pt_br: A API REST é emitida para o servidor de gerenciamento de dispositivo do Internet of Things.

source: The Internet of Things Foundation published a command to reboot the device.
de: Von Internet of Things Foundation wird ein Befehl für einen Neustart der Einheit publiziert.
es: Internet of Things Foundation publica un mandato para reiniciar el dispositivo.
ja: Internet of Things Foundation が、デバイスをリブートするコマンドを発行しました。
ko: Internet of Things Foundation이 디바이스 다시 부팅 명령을 공개했습니다.
pt_br: O Internet of Things Foundation publicou um comando para reinicializar o dispositivo.

source: REST API returns. A management request document is created which can be queried to keep track of the progress of the request.
de: Die REST-API wird zurückgegeben. Ein Managementanforderungsdokument wird erstellt, das abgefragt werden kann, um den Fortschritt der Anforderung zu verfolgen.
es: La API REST envía una devolución. Se crea un documento de solicitud de gestión que se puede consultar para realizar un seguimiento del progreso de la solicitud.
ja: REST API が戻されます。リクエストの進行状況を追跡するために照会できる管理リクエスト文書が作成されます。
ko: REST API가 리턴됩니다. 요청의 진행상태를 추적하는 데 조회할 수 있는 관리 요청 문서가 작성됩니다.
pt_br: A API REST é retornada. É criado um documento de solicitação de gerenciamento, que pode ser consultado para acompanhar o progresso da solicitação.

source: When the device is connectd, it receives the command and reboots.
de: Wenn die Einheit verbunden ist, wird von ihr der Befehl empfangen und ein Neustart durchgeführt.
es: Cuando el dispositivo se conecta, recibe el mandato y se reinicia.
ja: デバイスが接続されている場合、デバイスはコマンドを受け取ってリブートします。
ko: 디바이스가 연결되면 명령을 수신하고 다시 부팅됩니다.
pt_br: Quando o dispositivo estiver conectado, ele receberá o comando e será reinicializado.

source: When the device restarts, it updates its device management registration.
de: Wenn von der Einheit ein Neustart durchgeführt wird, wird ihre Registrierung des Einheitenmanagements aktualisiert.
es: Cuando el dispositivo se reinicia, actualiza su registro de gestión de dispositivos.
ja: デバイスは再始動すると、そのデバイス管理登録を更新します。
ko: 디바이스가 다시 시작되면 디바이스 관리 등록을 업데이트합니다.
pt_br: Ao ser reinicializado, o dispositivo atualiza seu registro de gerenciamento de dispositivo.

source: Firmware update
es: Actualización de firmware
ja: ファームウェア更新
ko: 펌웨어 업데이트
pt_br: Atualização de firmware

source: An administrator wants to initiate a firmware update on a device from the device dashboard. This is a long-running, asynchronous process. There are two separate steps here, downloading and updating.
de: Ein Administrator möchte für eine Einheit im Einheiten-Dashboard ein Firmware-Update einleiten. Hierbei handelt es sich um einen lange laufenden asynchronen Prozess. Er besteht aus zwei getrennten Schritten, dem Herunterladen und dem Aktualisieren.
es: Un administrador desea iniciar una actualización de firmware en un dispositivo en el panel de instrumentos. Se trata de un proceso asíncrono de ejecución larga. Aquí hay dos pasos separados: descarga y actualización.
ja: 管理者がデバイス・ダッシュボードからデバイスのファームウェア更新を開始します。これは、長時間かかる非同期プロセスです。ここでは、ダウンロードと更新という 2 つの別個の手順が必要になります。
ko: 관리자가 디바이스 대시보드에서 디바이스에 대해 펌웨어 업데이트를 시작하려고 합니다. 이는 장기 실행 중인 비동기 프로세스입니다. 여기에 별도의 2가지 단계인 다운로드 및 업데이트가 있습니다.
pt_br: Um administrador deseja iniciar uma atualização de firmware em um dispositivo a partir do painel do dispositivo. Este é um processo assíncrono de longa execução. Aqui, há duas etapas separadas, o download e a atualização.

source: Request 1:
de: Anforderung 1:
es: Solicitud 1:
ja: リクエスト 1:
ko: 요청 1:
pt_br: Solicitação 1:

source: Request Body:
de: Anforderungs-Body:
es: Cuerpo de la solicitud:
ja: リクエストの本文:
ko: 요청 본문:
pt_br: Corpo da Solicitação:

source: REST API is issued to the Internet of Things Foundation.
de: Die REST-API wird an Internet of Things Foundation ausgegeben.
es: la API REST se envía a Internet of Things Foundation.
ja: REST API が Internet of Things Foundation に発行されます。
ko: REST API가 Internet of Things Foundation에 실행됩니다.
pt_br: A API REST é emitida para o Internet of Things Foundation.

source: The Internet of Things Foundation published an update to the mgmt.firmware section of the device's metadata containing the package URL. An observation request is scheduled for the status of the firmware update.
de: Von Internet of Things Foundation wird eine Aktualisierung für den Abschnitt 'mgmt.firmware' der Einheitenmetadaten publiziert, in der die Paket-URL enthalten ist. Eine Beobachtungsanforderung wird für den Status des Firmware-Updates geplant.
es: Internet of Things Foundation publica una actualización de la sección mgmt.firmware de los metadatos del dispositivo que contiene el URL del paquete. Se planifica una solicitud de observación del estado de actualización del firmware.
ja: Internet of Things Foundation が、パッケージ URL を含むデバイスのメタデータの mgmt.firmware セクションの更新を発行しました。ファームウェア更新のステータスに対する監視リクエストがスケジュールされます。
ko: Internet of Things Foundation이 패키지 URL이 포함된 디바이스 메타데이터의 mgmt.firmware 섹션에 대한 업데이트를 공개했습니다. 관찰 요청이 펌웨어 업데이트의 상태에 대해 스케줄링됩니다.
pt_br: O Internet of Things Foundation publicou uma atualização na seção mgmt.firmware dos metadados do dispositivo, contendo a URL do pacote. Uma solicitação de observação é planejada para o status da atualização de firmware.

source: A command is published to the device to download the firmware package.
de: Für die Einheit ist ein Befehl zum Herunterladen des Firmwarepakets geplant.
es: Se publica un mandato en el dispositivo para descargar el paquete de firmware.
ja: ファームウェア・パッケージをダウンロードするコマンドがデバイスに発行されます。
ko: 펌웨어 패키지를 다운로드하도록 디바이스에 명령이 공개됩니다.
pt_br: Um comando é publicado no dispositivo para fazer download do pacote de firmware.

source: The Internet of Things Foundation updates the firmware section of the device's metadata, replacing the existing data.
de: Von Internet of Things Foundation wird der Firmwareabschnitt der Einheitenmetadaten aktualisiert; die vorhandenen Daten werden ersetzt.
es: Internet of Things Foundation actualiza la sección de firmware de los metadatos del dispositivo sustituyendo los datos existentes.
ja: Internet of Things Foundation がデバイスのメタデータのファームウェア・セクションを更新して、既存のデータを置き換えます。
ko: Internet of Things Foundation이 디바이스 메타데이터의 펌웨어 섹션을 업데이트하여, 기존 데이터를 바꿉니다.
pt_br: O Internet of Things Foundation atualiza a seção de firmware dos metadados do dispositivo, substituindo os dados existentes.

source: When the device is connected, it receives the update to the mgmt.firmware section of its metadata containing the package URL, the observation request and the command.
de: Wenn die Einheit verbunden ist, wird von ihr eine Aktualisierung im Abschnitt 'mgmt.firmware' der Metadaten empfangen, in der die Paket-URL, die Beobachtungsanforderung und der Befehl enthalten sind.
es: Cuando se conecta el dispositivo, recibe la actualización en la sección mgmt.firmware de sus metadatos que contiene el URL del paquete, la solicitud de observación y el mandato.
ja: デバイスが接続されている場合、デバイスは、パッケージ URL を含むメタデータの mgmt.firmware セクションの更新、監視リクエスト、およびコマンドを受け取ります。
ko: 디바이스가 연결되면 페키지 URL, 관찰 요청 및 명령이 포함된 메타데이터의 mgmt.firmware 섹션에 대한 업데이트를 수신합니다.
pt_br: Quando o dispositivo estiver conectado, ele receberá a atualização para a seção mgmt.firmware de seus metadados, contendo a URL do pacote, a solicitação de observação e o comando.

source: The device sets its firmware status to 1 (Downloading) and initiates the download.
de: Von der Einheit wird der Firmware-Status auf 1 (Download läuft) gesetzt und der Download wird eingeleitet.
es: El dispositivo establece su estado de firmware en 1 (Descargar) e inicia la descarga.
ja: デバイスはファームウェア・ステータスを 1 (ダウンロード中) に設定してダウンロードを開始します。
ko: 디바이스가 펌웨어 상태를 1(다운로드 중)로 설정하고 다운로드를 시작합니다.
pt_br: O dispositivo configura seu status de firmware como 1 (Fazendo o Download) e inicia o download.

source: When the firmware is downloaded, the device changes the firmware status to 2 (Downloaded) and sends a notification to the Internet of Things Foundation.
de: Wenn die die Firmware heruntergeladen ist, wird der Firmware-Status von der Einheit auf 2 (Heruntergeladen) gesetzt und eine Benachrichtigung an Internet of Things Foundation gesendet.
es: Cuando se descarga el firmware, el dispositivo cambia su estado de firmware a 2 (Descargado) y envía una notificación a Internet of Things Foundation.
ja: ファームウェアがダウンロードされると、デバイスはファームウェア・ステータスを 2 (ダウンロード済み) に変更し、Internet of Things Foundation に通知を送ります。
ko: 펌웨어가 다운로드되면 디바이스가 펌웨어 상태를 2(다운로드됨)로 변경하고 Internet of Things Foundation에 알림을 보냅니다.
pt_br: Quando o firmware é transferido por download, o dispositivo altera o status do firmware para 2 (Transferido por Download) e envia uma notificação para o Internet of Things Foundation.

source: The Internet of Things Foundation updates the firmware section of the device's metadata.
de: Von Internet of Things Foundation wird der Firmware-Abschnitt der Einheitenmetadaten aktualisiert.
es: Internet of Things Foundation actualiza la sección de firmware de los metadatos del dispositivo.
ja: Internet of Things Foundation がデバイスのメタデータのファームウェア・セクションを更新します。
ko: Internet of Things Foundation이 디바이스 메타데이터의 펌웨어 섹션을 업데이트합니다.
pt_br: O Internet of Things Foundation atualiza a seção de firmware dos metadados do dispositivo.

source: Request 2:
de: Anforderung 2:
es: Solicitud 2:
ja: リクエスト 2:
ko: 요청 2:
pt_br: Solicitação 2:

source: The command is published to update the device firmware to the downloaded package.
de: Der Befehl wird zum Aktualisieren der Einheitenfirmware für das heruntergeladene Paket publiziert.
es: El mandato se publica para actualizar el firmware del dispositivo en el paquete descargado.
ja: デバイス・ファームウェアをダウンロード済みパッケージに更新するコマンドが発行されます。
ko: 다운로드된 패키지로 디바이스 펌웨어를 업데이트하도록 명령이 공개됩니다.
pt_br: O comando é publicado para atualizar o firmware do dispositivo para o pacote transferido por download.

source: The firmware section of the device's metadata is updated.
de: Der Firmware-Abschnitt der Einheitenmetadaten wird aktualisiert.
es: Se actualiza la sección de firmware de los metadatos del dispositivo.
ja: デバイスのメタデータのファームウェア・セクションが更新されます。
ko: 디바이스 메타데이터의 펌웨어 섹션이 업데이트됩니다.
pt_br: A seção de firmware dos metadados do dispositivo é atualizada.

source: The REST API returns and a management request document is created which can be queried to keep track of the progress of the request.
de: Die REST-API wird zurückgegeben und ein Managementanforderungsdokument wird erstellt, das abgefragt werden kann, um den Fortschritt der Anforderung zu verfolgen.
es: La API REST envía una devolución y se crea un documento de solicitud de gestión que se puede consultar para realizar un seguimiento del progreso de la solicitud.
ja: REST API が戻され、リクエストの進行状況を追跡するために照会できる管理リクエスト文書が作成されます。
ko: REST API가 리턴되고 요청의 진행상태를 추적하도록 조회할 수 있는 관리 요청 문서가 작성됩니다.
pt_br: A API REST retorna e cria-se um documento de solicitação de gerenciamento, que pode ser consultado para acompanhar o progresso da solicitação.

source: When the device is connected, it receives the command and begins the firmware update.
de: Wenn die Einheit verbunden ist, wird von ihr der Befehl empfangen und mit der Aktualisierung der Firmware begonnen.
es: Cuando se conecta el dispositivo, recibe el mandato y comienza la actualización de firmware.
ja: デバイスが接続されている場合、デバイスはコマンドを受け取ってファームウェア更新を開始します。
ko: 디바이스가 연결되면 명령을 수신하고 펌웨어 업데이트를 시작합니다.
pt_br: Quando o dispositivo estiver conectado, ele receberá o comando e iniciará a atualização de firmware.

source: Assuming the firmware update was successful, the device changes the firmware update status to 0 (Success) and sends a notification to the Internet of Things Foundation.
de: Sofern das Firmware-Update erfolgreich war, wird der Status für die Firmware-Aktualisierung von der Einheit auf 0 (Erfolgreich) gesetzt und eine Benachrichtigung an Internet of Things Foundation gesendet.
es: Suponiendo que la actualización de firmware sea correcta, el dispositivo cambia el estado de actualización de firmware a 0 (Satisfactorio) y envía una notificación a Internet of Things Foundation.
ja: ファームウェア更新が成功した場合、デバイスはファームウェア更新ステータスを 0 (成功) に変更し、Internet of Things Foundation に通知を送ります。
ko: 펌웨어 업데이트에 성공하면, 디바이스가 펌웨어 업데이트 상태를 0(성공)으로 변경하고 Internet of Things Foundation에 알림을 보냅니다.
pt_br: Supondo que a atualização de firmware seja bem-sucedida, o dispositivo altera o status da atualização de firmware para 0 (Êxito) e envia uma notificação para o Internet of Things Foundation.
