Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/api.po
Languages: es, fr, ko

source: HTTP API for Devices
es: API HTTP para dispositivos
fr: API HTTP pour terminaux
ko: 디바이스용 HTTP API

source: This feature is currently available as part of a limited beta. Future updates may include changes incompatible with the current version of this feature. Try it out and `let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
es: Esta característica está disponible actualmente como parte de una versión beta limitada. Las actualizaciones futuras podrían incluir cambios incompatibles con la versión actual de esta característica. Pruébela y `denos su opinión <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
fr: Cette fonction est actuellement disponible dans le cadre d'une version bêta limitée. Il se peut que de futures mises à jour incluent des modifications incompatibles avec la version actuelle de cette fonction. Essayez-la et `faites-nous part de vos commentaires sur la page <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
ko: 이 기능은 현재 제한된 베타의 일부로 제공됩니다. 추가 업데이트에는 이 기능의 현재 버전과 호환되지 않는 변경사항이 포함될 수 있습니다. 이 기능을 사용해 본 후 `의견을 알려주십시오 <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_.

source: Publish an event
es: Publicar un suceso
fr: Publier un événement
ko: 이벤트 공개

source: As an alternative to MQTT it is possible for devices to submit events to the IoT Platform over an HTTP API. Devices may submit a ``POST`` request to: ``https://${orgid}.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
es: Como alternativa a MQTT es posible que los dispositivos envíen sucesos a IoT Platform a través de una API HTTP. Los dispositivos pueden enviar una solicitud ``POST`` a: ``https://${orgid}.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
ko: MQTT 대신, 디바이스가 HTTP API를 통해 IoT Platform에 이벤트를 제출할 수 있습니다. 디바이스는 ``POST`` 요청을 ``https://${orgid}.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``에 제출할 수 있습니다.

source: For full details, see the relevant `API documentation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__. The request body (event payload) can have any content, however, MQTT message payload guidelines should be followed.
es: Para obtener detalles completos, consulte la `documentación de la API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__ correspondiente. El cuerpo de solicitud (carga útil de suceso) puede tener cualquier contenido; no obstante, deben seguirse las directrices de carga útil de mensajes MQTT.
fr: Pour tous les détails, voir la `documentation de l'API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__. Le corps de la demande (contenu de l'événement) peut correspondre à n'importe quel contenu. Toutefois, les règles applicables au contenu des messages MQTT doivent être respectées.
ko: 세부사항은 관련 `API 문서 <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__의 내용을 참조하십시오. 요청 본문(이벤트 페이로드)에 컨텐츠가 있을 수 있지만 MQTT 메시지 페이로드 가이드라인이 앞서야 합니다.

source: When connecting a device or application to Quickstart you should use the following URL instead: ``http://quickstart.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
es: Al conectar un dispositivo o una aplicación a Quickstart, en lugar de ello deberá utilizar el siguiente URL: ``http://quickstart.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``.
ko: 디바이스 또는 애플리케이션을 Quickstart에 연결할 때 다음 URL을 대신 사용해야 합니다. ``http://quickstart.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``

source: HTTP messaging only covers the ability to submit device events currently. Device management and command control require MQTT connectivity in your device.
es: Actualmente la mensajería HTTP solo cubre la posibilidad de enviar sucesos de dispositivo. La gestión de dispositivos y el control de mandatos necesitan conectividad MQTT en el dispositivo.
fr: Actuellement, la messagerie HTTP permet uniquement de soumettre des événements de terminal. La gestion des terminaux et le contrôle des commandes requièrent la connectivité MQTT sur votre terminal.
ko: HTTP 메시징으로는 디바이스 이벤트를 현재 제출할 수만 있습니다. 디바이스 관리 및 명령 제어를 위해서는 디바이스에 MQTT 연결이 필요합니다.

source: Authentication
es: Autenticación
fr: Authentification
ko: 인증

source: Requests must include an authorization header. Basic authentication the only method supported. Applications are authenticated by API keys, when an application makes any request to the IoT Platform API it must present an API as it's credentials:
es: Las solicitudes deben incluir una cabecera de autorización. La autenticación básica es el único método soportado. Las claves de API autentican las aplicaciones; cuando una aplicación realiza cualquier solicitud a la API de IoT Platform, debe presentar una API como sus credenciales:
fr: Les demandes doivent inclure un en-tête d'autorisation. L'authentification de base est la seule méthode prise en charge. Les applications sont authentifiées par des clés d'API. Lorsqu'une application envoie une demande à une API IoT Platform, elle doit présenter une API comme données d'identification :
ko: 요청에는 권한 헤더가 포함되어야 합니다. 유일한 메소드가 지원한 기본 인증입니다. 애플리케이션은 API 키를 통해 인증되며, 애플리케이션이 IoT Platform API를 요청할 때 API를 신임 정보로 제공해야 합니다.

source: password = Authentication token
es: password = Señal de autenticación
fr: mot de passe = jeton d'authentification

source: A ``Content-Type`` request header must be provided with the request. The following table shows the supported types and how they are mapped to the IoT Platform internal formats.
es: Se debe proporcionar una cabecera de solicitud ``Content-Type`` con la solicitud. La tabla siguiente muestra los tipos soportados y cómo estos se correlacionan con los formatos internos de IoT Platform.
fr: Un en-tête de demande ``Content-Type`` doit être fourni par la demande. Le tableau ci-dessous répertorie les types pris en charge et la façon dont ils sont mappés aux formats internes d'IoT Platform.
ko: ``Content-Type`` 요청 헤더는 요청과 함께 제공해야 합니다. 다음 표는 지원되는 유형 및 이러한 유형이 어떻게 IoT Platform 내부 형식에 맵핑되는지를 보여줍니다.

source: Content-Type Header
es: Cabecera de tipo de contenido
fr: En-tête Content-Type
ko: Content-Type 헤더

source: IoT Platform Format
es: Formato de IoT Platform
fr: Format IoT Platform
ko: IoT Platform 형식

source: text/plain
es: texto/sin formato
ko: 텍스트/일반

source: text
es: texto
fr: texte
ko: 텍스트

source: application/json
es: aplicación/json
ko: 애플리케이션/json

source: application/xml
es: aplicación/xml
ko: 애플리케이션/xml

source: application/octet-stream
es: aplicación/serie octal
ko: 애플리케이션/옥텟-스트림

source: Quality of Service
es: Calidad de servicio
fr: Qualité de service
ko: 서비스 품질(QoS)

source: The HTTP(S) protocol provides "at most once" best effort delivery, analagous to the QoS0 quality of service provided by the MQTT protocol. When using QoS0, or the HTTP(S) equivalent, to deliver event messages, the device or application must implement retry logic to guarantee delivery.
es: El protocolo HTTP(S) proporciona una entrega de mejor esfuerzo "Como máximo una vez", análoga a la calidad de servicio QoS0 proporcionada por el protocolo MQTT. Cuando se utiliza QoS0 o el equivalente HTTP(S) para entregar mensajes de suceso, la aplicación o el dispositivo debe implementar la lógica de reintentos para garantizar la entrega.
fr: Le protocole HTTP(S) assure une distribution "une fois tout au plus", qui est comparable à la qualité de service QoS0 fournie par le protocole MQTT. Lorsque vous utilisez QoS0, ou le niveau équivalent disponible avec le protocole HTTP(S), pour distribuer les messages d'événement, le terminal ou l'application doit mettre en oeuvre une logique de relance pour assurer la distribution.
ko: HTTP(S) 프로토콜은 MQTT 프로토콜에서 제공된 QoS0 서비스 품질(QoS)과 유사하게 "최대 한 번" 최선형 전송을 제공합니다. 이벤트 메시지를 전달하는 데 QoS0 또는 HTTP(S) 등가물을 사용하는 경우 디바이스 또는 애플리케이션은 전달 보장하도록 재시도 논리를 구현해야 합니다.

source: For more information on the MQTT protocol and Quality of Service levels, please see `MQTT for the IoT Platform <../reference/mqtt/index.html>`__ documentation.
es: Para obtener más información sobre el protocolo MQTT y los niveles de calidad de servicio, consulte la documentación de `MQTT para IoT Platform <../reference/mqtt/index.html>`__.
fr: Pour plus d'informations sur le protocole MQTT et les niveaux de qualité de service, voir la documentation relative à `MQTT pour IoT Platform <../reference/mqtt/index.html>`__.
ko: MQTT 프로토콜 및 서비스 품질(QoS) 레벨에 대한 자세한 정보는 `MQTT for the IoT Platform <../reference/mqtt/index.html>`__ 문서를 참조하십시오.

source: bin
ko: 바이너리

source: As an alternative to MQTT it is possible for devices to submit events to the IoT Platform over an HTTP API. Devices may submit a ``POST`` request to: ``https://${orgid}.internetofthings.ibmcloud.com>/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
fr: Les terminaux peuvent soumettre des événements à IoT Platform par le biais d'une API HTTP au lieu de MQTT. Ils peuvent soumettre une demande ``POST`` à : ``https://${orgid}.internetofthings.ibmcloud.com>/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``

source: When connecting a device or application to Quickstart you should use the following URL instead: ``http://quickstart.internetofthings.ibmcloud.com>/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
fr: Lors de la connexion d'un terminal ou d'une application à Quickstart, utilisez l'adresse URL suivante à la place : ``http://quickstart.internetofthings.ibmcloud.com>/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``

source: username = "use-token-auth"
fr: nom d'utilisateur = "use-token-auth"
