Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/mqtt.po
Languages: es

source: MQTT Connectivity for Devices
es: Conectividad de MQTT para dispositivos

source: Client connection
es: Conexión de cliente

source: Every registered organization has a unique endpoint which must be used when connecting MQTT clients for devices in that organization.
es: Todas las organizaciones registradas tienen un punto final exclusivo que se debe utilizar al conectar clientes MQTT para dispositivos en esa organización.

source: **org\_id**.messaging.internetofthings.ibmcloud.com
es: **id\_org**.messaging.internetofthings.ibmcloud.com

source: Unencrypted client connection
es: Conexión de cliente no cifrada

source: Connect on port **1883**
es: Conectar en el puerto **1883**

source: All information your device submits is being sent in plain text (including the authentication credentials for your device). We recommend the use of an encrypted connection whenever possible.
es: Toda la información que envía el dispositivo se envía en texto sin formato (incluidas las credenciales de autenticación de la pasarela). Recomendamos el uso de una conexión cifrada siempre que sea posible.

source: Encrypted client connection
es: Conexión de cliente cifrada

source: Connect on port **8883** or **443** for websockets.
es: Conectarse en el puerto **8883** o **443** para sockets web.

source: In many client libraries you will need to provide the server's public certificate in pem format. The following file contains the entire certificate chain for \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
es: En muchas bibliotecas de cliente será necesario proporcionar el certificado público del servidor en formato pem. El archivo siguiente contiene la cadena de certificados entera para \*.messaging.internetofthings.ibmcloud.com: messaging.pem_

source: Some SSL client libraries have been shown to not handle wildcarded domains, in which case, if you can not change libraries, you will need to turn off certificate checking.
es: Se ha mostrado que algunas bibliotecas de cliente SSL no manejan dominios con caracteres comodín, en cuyo caso, si no puede cambiar las bibliotecas, necesitará desactivar la comprobación de certificados.

source: The IoT Platform requires TLS v1.2. We suggest the following cipher suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 or AES128-GCM-SHA256 *(as of Jun 1 2015)*.
es: IoT Platform requiere TLS v1.2. Sugerimos las siguientes suites de cifrado: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 o AES128-GCM-SHA256 *(a partir del 1 de junio de 2015)*.

source: **Device Support in Quickstart**
es: **Soporte de dispositivos en Quickstart**

source: When connecting to the Quickstart service no authentication (or registration) is required, and ``orgId`` must be set to ``quickstart``
es: Al conectarse al servicio Quickstart, no se necesita ninguna autenticación (ni registro) y ``orgId`` debe definirse como ``quickstart``.

source: The Quickstart service does not currently support MQTT Quality of Service (QoS) levels greater than 0. This is the fastest and offers no confirmation of receipt. If you are writing device code for use with Quickstart you must also take into account the following features present in the registered service that are not supported in Quickstart:
es: El servicio Quickstart actualmente no soporta niveles de calidad de servicio (QoS) MQTT superiores a 0. Este nivel es el más rápido y no ofrece confirmación de la recepción. Si está escribiendo código de dispositivo que desea soportar el uso con Quickstart, debe tener en cuenta las siguientes características presentes en el servicio registrado que no se soportan en Quickstart:

source: Subscribing to commands
es: Suscripción a mandatos

source: Device management protocol
es: Protocolo de gestión de dispositivos

source: Clean or durable sessions
es: Sesiones limpias o duraderas

source: Also, messages sent from devices at a rate greater than 1 per second may be discarded.
es: Asimismo, los mensajes enviados desde dispositivos a una velocidad superior a 1 por segundo pueden descartarse.

source: MQTT client identifier
es: Identificador de cliente MQTT

source: A Device must authenticate using a client ID in the following format:
es: Un dispositivo se debe autenticar utilizando un ID de cliente en el formato siguiente:

source: d:**org\_id**:**device_type**:**device\_id**
es: d:**id\_org**:**tipo_dispositivo**:**id\_dispositivo**

source: **d** idenfities your client as a device
es: **d** identifica el cliente como un dispositivo

source: **org\_id** is your unique organization ID, assigned when you sign up with the service. It will be a 6 character alphanumeric string.
es: **org\_id** es el ID de organización exclusivo que se asigna al registrarse en el servicio. Será una serie alfanumérica de 6 caracteres.

source: **type\_id** is intended to be used as an identifier of the type of device connecting, it may be useful to think of this as analogous to a model number.
es: **tipo\_id** está destinado a utilizar como identificador del tipo de dispositivo que se conecta; puede ser útil considerarlo como análogo a un número de modelo.

source: **device\_id** must uniquely identify a device across all devices of a specific device\_type, it may be useful to think of this as analogous to a serial number.
es: **id\_dispositivo** debe identificar de forma exclusiva un dispositivo entre todos los dispositivos de un tipo\_dispositivo específico; puede ser útil considerarlo como análogo a un número de serie.

source: You can use any scheme of your choice when assigning values for ``type_id`` and ``device_id``, however the following restrictions apply to both:
es: Puede utilizar cualquier esquema de su elección al asignar valores para ``id_tipo`` e ``id_dispositivo``; sin embargo, se aplican las restricciones siguientes a ambos:

source: Maximum length of 36 characters
es: Longitud máxima de 36 caracteres

source: Must comprise only alpha-numeric characters (``a-z``, ``A-Z``, ``0-9``) and the following special characters:
es: Deben constar solo de caracteres alfanuméricos (``a-z``, ``A-Z``, ``0-9``) y de los siguientes caracteres especiales:

source: dash (``-``)
es: guion (``-``)

source: underscore (``_``)
es: subrayado (``_``)

source: dot (``.``)
es: punto (``.``)

source: MQTT authentication
es: Autenticación de MQTT

source: Username
es: Nombre de usuario

source: The service currently only supports token-based authentication for devices, as such there is only one valid username for devices today.
es: Actualmente el servicio solo soporta la autenticación basada en señal para dispositivos, por lo que actualmente solo hay un nombre de usuario válido para los dispositivos.

source: A value of ``use-token-auth`` indicates to the service that the authentication token for the device will be passed as the password for the MQTT connection.
es: Un valor de ``use-token-auth`` indica al servicio que la señal de autenticación para el dispositivo se pasará como la contraseña para la conexión de MQTT.

source: Password
es: Contraseña

source: When using token based authentication submit the device authentication token as the password when making your MQTT connection.
es: Cuando utilice la autenticación basada en señal, envíe la señal de autenticación de dispositivo como contraseña al realizar la conexión de MQTT.

source: Publishing events
es: Publicación de sucesos

source: Devices can only publish to the event topic of the form iot-2/evt/\ **event\_id**/fmt/**format\_string**
es: Los dispositivos solo pueden publicar en el tema del suceso con el formato iot-2/evt/\ **id\_suceso**/fmt/**serie\_formato**.

source: **event\_id** is the ID of the event, for example "status". The event ID can be any string permitted by MQTT. Subscriber applications must use this string in their subscription topic to receive the events published on this topic if wildcards are not used.
es: **id\_suceso** es el ID del suceso; por ejemplo, "status". El ID del suceso puede ser cualquier serie permitida por MQTT. Las aplicaciones de suscriptor deben utilizar esta serie en su tema de suscripción para recibir los sucesos publicados en dicho tema si no se emplean comodines.

source: **format\_string** is the format of the event payload, for example "json". The format can be any string permitted by MQTT. Subscriber applications must use this string in their subscription topic to receive events published on this topic if wildcards are not used. If the format is not "json", then messages will not be stored in the Historian.
es: **serie\_formato** es el formato de la carga útil del suceso; por ejemplo, "json". El formato puede ser cualquier serie permitida por MQTT. Las aplicaciones de suscriptor deben utilizar esta serie en su tema de suscripción para recibir los sucesos publicados en dicho tema si no se emplean comodines. Si el formato no es "json", los mensaje no se almacenarán en Historiador.

source: The message payload is limited to a maximum of 131072 bytes. Messages larger than this will be rejected.
es: La carga útil del mensaje está limitada a un máximo de 131072 bytes. Los mensajes más largos se rechazarán.

source: Devices can only subscribe to command topics of the form iot-2/cmd/\ **command\_id**/fmt/**format\_string**. They cannot subscribe to other devices' events and will only receive commands published specifically to the device itself.
es: Los dispositivos solo pueden suscribirse a temas de mandatos con el formato iot-2/cmd/\ **id\_mandato**/fmt/**serie\_formato**. No pueden suscribirse a sucesos de otros dispositivos y solo recibirán mandatos publicados específicamente para el propio dispositivo.

source: **command\_id** is the ID of the command, for example "update". The command ID can be any string permitted by MQTT. A device must use this string in its subscription topic in order to receive commands published on this topic if wildcards are not used.
es: **id\_mandato** es el ID del mandato; por ejemplo, "update". El ID del mandato puede ser cualquier serie permitida por MQTT. Un dispositivo debe utilizar esta serie en su tema de suscripción para recibir los mandatos publicados en dicho tema si no se emplean comodines.

source: **format\_string** is the format of the command payload, for example "json". The format can be any string permitted by MQTT. A device must use this string in its subscription topic in order to receive commands published on this topic if wildcards are not used.
es: **serie\_formato** es el formato de la carga útil del mandato; por ejemplo, "json". El formato puede ser cualquier serie permitida por MQTT. Un dispositivo debe utilizar esta serie en su tema de suscripción para recibir los mandatos publicados en dicho tema si no se emplean comodines.

source: Managed Devices
es: Dispositivos gestionados

source: Support for device lifecycle management is optional, the device management protocol used by IoTF utilises the same MQTT connection that your device already uses for events and command control.
es: El soporte de la gestión del ciclo de vida de los dispositivos es opcional; el protocolo de gestión de dispositivos utilizado por IoTF emplea la misma conexión MQTT que su dispositivo usa ya para los sucesos y el control de mandatos.

source: Quality of Service Levels and Clean Session
es: Niveles de calidad de servicio y limpieza de sesiones

source: Managed devices can publish messages with Quality of Service (QoS) level of 0 or 1. If QoS 1 is used, messages from the device will be queued if necessary. Messages from the device must not be retained messages.
es: Los dispositivos gestionados pueden publicar mensajes con el nivel de calidad de servicio (QoS) de 0 o 1. Si se utiliza QoS 1, los mensajes del dispositivo se pondrán en cola si es necesario. Los mensajes del dispositivo no debe ser mensajes retenidos.

source: The IoT Platform publishes requests with a QoS level of 1 to support queuing of messages. In order to queue messages sent while a managed device is not connected, the device should use ``cleansession=false``.
es: IoT Platform publica solicitudes con un nivel de QoS 1 para permitir que los mensajes se pongan en cola. Para poner en cola mensajes mientras un dispositivo gestionado no está conectado, este debe utilizar ``cleansession=false``.

source: If your managed device uses a durable subscription (cleansession=false) you need to be aware that device management commands sent to your device while it is offline will be reported as failed operations if the device does not reconnect to the service before the request times out, however when the device later connects those requests will be actioned by the device.
es: Si el dispositivo gestionado utiliza una suscripción duradera (cleansession=false), es necesario saber qué mandatos de gestión de dispositivos enviados al dispositivo mientras este se encuentre fuera de línea se comunicarán como operaciones erróneas si el dispositivo no se reconecta al servicio antes de que se agote el tiempo de la solicitud; sin embargo, cuando el dispositivo se conecte posteriormente, efectuará las acciones requeridas por dichas solicitudes.

source: When handling request failures it is important to take this into account if you are using durable subscriptions for your managed devices.
es: Al gestionar los errores de las solicitudes, es importante tener esto en cuenta si se utilizan suscripciones duraderas para los dispositivos gestionados.

source: Topics
es: Temas

source: A managed device is required to subscribe to the following topic to handle requests and responses from the IoT Platform:
es: Se necesita un dispositivo gestionado para suscribirse al siguiente tema con el fin de gestionar solicitudes y respuestas procedentes de IoT Platform:

source: A managed device will publish to topics specific to the type of management request being performed:
es: Un dispositivo gestionado publicará en temas específicos del tipo de solicitud de gestión que se relice:

source: The managed device will publish device management responses on ``iotdevice-1/response``
es: El dispositivo gestionado publicará las respuestas de gestión de dispositivos en ``iotdevice-1/response``.

source: For other topics a managed device may publish to, refer to `Device Management Protocol <device_mgmt/index.html>`__ and `Device Management Requests <device_mgmt/requests.html>`__.
es: Para otros temas en los que pueda publicar un dispositivo gestionado, consulte `Protocolo de gestión de dispositivos <device_mgmt/index.html>`__ y `Solicitudes de gestión de dispositivos <device_mgmt/requests.html>`__.

source: Message Format
es: Formato del mensaje

source: All messages are sent in JSON format. There are two types of messages.
es: Todos los mensajes se envían en formato JSON. Hay dos tipos de mensajes.

source: Request
es: Solicitud

source: Requests are formatted as follows:
es: Debe aplicarse el siguiente formato a las solicitudes:

source: ``d`` carries any data relevant to the request
es: ``d`` transporta todos los datos relevantes para la solicitud.

source: ``reqId`` is an identifier of the request, and must be copied into a response. If a response is not required, the field should be omitted.
es: ``reqId`` es un identificador de la solicitud y debe copiarse en una respuesta. Si no se necesita ninguna respuesta, este campo debe omitirse.

source: Response
es: Respuesta

source: Responses are formatted as follows:
es: Debe aplicarse el siguiente formato a las respuestas:

source: "rc" is a result code of the original request.
es: "rc" es un código de resultado de la solicitud original.

source: ``message`` is an optional element with a text description of the response code.
es: ``message`` es un elemento opcional con una descripción de texto del código de respuesta.

source: ``d`` is an optional data element accompanying the response.
es: ``d`` es un elemento de datos opcional que acompaña a la respuesta.

source: ``reqId`` is the request ID of the original request. This is used to correlate responses with requests, and the device needs to ensure that all request IDs are unique. When responding to IoT Platform requests, the correct ``reqId`` value must be sent in the response.
es: ``reqId`` es el ID de solicitud de la solicitud original. Se utiliza para correlacionar las respuestas con las solicitudes y el dispositivo debe asegurarse de que todos los ID de solicitud sean exclusivos. Cuando se responde a las solicitudes de IoT Platform, en la respuesta debe enviarse el valor ``reqId`` correcto.

source: For more details on particular request and response messages, refer to `Device Management Protocol <device_mgmt/index.html>`__ and `Device Management Requests <device_mgmt/requests.html>`__.
es: Para obtener más detalles sobre mensajes de solicitud y respuesta concretos, consulte `Protocolo de gestión de dispositivos <device_mgmt/index.html>`__ y `Solicitudes de gestión de dispositivos <device_mgmt/requests.html>`__.
