Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/messaging/HTTPSDevice.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: HTTP(S) Connectivity for Devices
de: HTTP(S)-Konnektivität für Geräte
es: Conectividad de HTTP(S) para dispositivos
fr: Connectivité HTTP(S) pour les terminaux
it: Connettività HTTP(S) per i dispositivi
ja: デバイスの HTTP(S) 接続
ko: 디바이스용 HTTP(S) 연결
pt_br: Conectividade HTTP(S) para Dispositivos
zh_cn: 设备的 HTTP(S) 连接
zh_tw: 裝置的 HTTP(S) 連線功能

source: The HTTP(S) messaging protocol can be used by devices and applications to interact with the IBM Internet of Things Foundation. This messaging protocol can be used instead of the `MQTT messaging protocol <../messaging/mqtt.html>`__ and the `optional client libraries <../libraries/programmingguides.html>`__.
de: Das HTTP(S)-Nachrichtenprotokoll kann von Geräten und Anwendungen zur Interaktion mit IBM Internet of Things Foundation verwendet werden. Dieses Nachrichtenprotokoll kann anstelle des `MQTT-Nachrichtenprotokolls <../messaging/mqtt.html>`__ und der `optionalen Clientbibliotheken <../libraries/programmingguides.html>`__ verwendet werden.
es: Los dispositivos y las aplicaciones pueden utilizar el protocolo de mensajería HTTP(S) para interactuar con IBM Internet of Things Foundation. Este protocolo de mensajería puede utilizarse en lugar del `Protocolo de mensajería <../messaging/mqtt.html>`__ y las `bibliotecas de cliente opcionales <../libraries/programmingguides.html>`__.
fr: Le protocole de messagerie HTTP(S) permet à des terminaux et à des applications d'interagir avec IBM Internet of Things Foundation. Il peut être utilisé à la place du `protocole de messagerie MQTT <../messaging/mqtt.html>`__ et des `bibliothèques client facultatives <../libraries/programmingguides.html>`__.
it: Il protocollo di messaggistica HTTP(S) può essere utilizzato da dispositivi e applicazioni per interagire con IBM Internet of Things Foundation. Questo protocollo di messaggistica può essere utilizzato al posto del `protocollo di messaggistica MQTT <../messaging/mqtt.html>`__ e delle `librerie client facoltative <../libraries/programmingguides.html>`__.
ja: IBM Internet of Things Foundation と対話するために、デバイスとアプリケーションが HTTP(S) メッセージ・プロトコルを使用できます。このメッセージ・プロトコルは、`MQTT メッセージ・プロトコル <../messaging/mqtt.html>`__ と `オプションのクライアント・ライブラリー <../libraries/programmingguides.html>`__ の代わりに使用できます。
ko: HTTP(S) 메시징 프로토콜은 IBM Internet of Things Foundation과 상호작용하는 데 디바이스 및 애플리케이션에서 사용될 수 있습니다. 이 메시징 프로토콜은 `MQTT 메시징 프로토콜 <../messaging/mqtt.html>`__ 및 `선택적 클라이언트 라이브러리 <../libraries/programmingguides.html>`__ 대신 사용할 수 있습니다.
pt_br: O protocolo de mensagem HTTP(S) pode ser utilizado por dispositivos e aplicativos para interagir com o IBM Internet of Things Foundation. Esse protocolo de mensagens pode ser utilizado no lugar do `protocolo de mensagem MQTT <../messaging/mqtt.html>`__ e as `bibliotecas do cliente opcional <../libraries/programmingguides.html>`__.
zh_cn: 设备和应用程序可以使用 HTTP(S) 消息传递协议与 IBM Internet of Things Foundation 交互。此消息传递协议可代替 `MQTT 消息传递协议 <../messaging/mqtt.html>`__ 和 `可选客户机库 <../libraries/programmingguides.html>`__ 使用。
zh_tw: 裝置和應用程式可使用 HTTP(S) 傳訊通訊協定與 IBM Internet of Things Foundation 互動。此傳訊通訊協定可代替 `MQTT 傳訊通訊協定<../messaging/mqtt.html>`__和`選用的用戶端程式庫<../libraries/programmingguides.html>`__。

source: All devices can use HTTP(S) messaging to communicate with the Internet of Things Foundation with no additional installation.
de: Alle Geräte können die HTTP(S)-Nachrichtenübertragung für die Kommunikation mit Internet of Things Foundation nutzen, ohne dass eine zusätzliche Installation erforderlich ist.
es: Todos los dispositivos pueden utilizar la mensajería HTTP(S) para comunicarse con Internet of Things Foundation sin ninguna instalación adicional.
fr: Tous les terminaux peuvent utiliser le protocole HTTP(S) pour communiquer avec Internet of Things Foundation sans nécessiter d'opérations d'installation supplémentaires.
it: Tutti i dispositivi possono utilizzare la messaggistica HTTP(S) per comunicare con Internet of Things Foundation senza installazioni aggiuntive.
ja: すべてのデバイスで HTTP(S) メッセージングを使用して、追加のインストールなしで Internet of Things Foundation と通信できます。
ko: 모든 디바이스는 HTTP(S) 메시징을 사용하여 추가 설치 없이 Internet of Things Foundation과 통신할 수 있습니다.
pt_br: Todos os dispositivos podem utilizar mensagens HTTP(S) para comunicação com o Internet of Things Foundation sem necessidade de instalação adicional.
zh_cn: 所有设备都可以使用 HTTP(S) 消息传递与 Internet of Things Foundation 通信，无需其他安装。
zh_tw: 所有裝置皆可直接使用 HTTP(S) 傳訊與 Internet of Things Foundation 通訊，無需額外安裝。

source: The HTTP(S) protocol can be used with devices and applications to send event messages to the Internet of Things Foundation. For details, please see:
de: Das HTTP(S)-Protokoll kann von Geräten und Anwendungen verwendet werden, um Ereignisnachrichten an Internet of Things Foundation zu senden. Details hierzu finden Sie hier:
es: El protocolo HTTP(S) puede utilizarse con los dispositivos y las aplicaciones para enviar mensajes de sucesos a Internet of Things Foundation. Para obtener más detalles, consulte:
fr: Le protocole HTTP(S) permet à des terminaux et à des applications d'envoyer des messages d'événement à Internet of Things Foundation. Pour plus d'informations, reportez-vous aux rubriques suivantes :
it: Il protocollo HTTP(S) può essere utilizzato con dispositivi e applicazioni per inviare messaggi di evento a Internet of Things Foundation. Per i dettagli, consultare:
ja: デバイスとアプリケーションでは、Internet of Things Foundation にイベント・メッセージを送信するために HTTP(S) プロトコルを使用できます。詳細については、以下を参照してください。
ko: HTTP(S) 프로토콜은 Internet of Things Foundation에 이벤트 메시지를 전송하는 데 디바이스 및 애플리케이션과 함께 사용될 수 있습니다. 세부사항은 다음을 참조하십시오.
pt_br: O protocolo HTTP(S) pode ser utilizado com dispositivos e aplicativos para enviar mensagens de eventos para o Internet of Things Foundation. Para obter detalhes, consulte:
zh_cn: 设备和应用程序可以使用 HTTP(S) 协议向 Internet of Things Foundation 发送事件消息。有关详细信息，请参阅：
zh_tw: HTTP(S) 通訊協定可用於裝置和應用程式，以將事件訊息傳送至 Internet of Things Foundation。如需詳細資料，請參閱：

source: `Using HTTP(S) with the Internet of Things Foundation <../messaging/HTTPSIntro.html>`__.
de: `Verwenden von HTTP(S) mit Internet of Things Foundation <../messaging/HTTPSIntro.html>`__.
es: `Utilización de HTTP(S) con Internet of Things Foundation <../messaging/HTTPSIntro.html>`__.
fr: `Utilisation de HTTP(S) avec Internet of Things Foundation <../messaging/HTTPSIntro.html>`__.
it: `Utilizzo di HTTP(S) con Internet of Things Foundation <../messaging/HTTPSIntro.html>`__.
ja: `HTTP(S) と Internet of Things Foundation の使用<../messaging/HTTPSIntro.html>`__。
ko: `Internet of Things Foundation과 함께 HTTP(S) 사용 <../messaging/HTTPSIntro.html>`__
pt_br: `Usando o HTTP(S) com o Things Foundation <../messaging/HTTPSIntro.html>`__.
zh_cn: `将 HTTP(S) 与 Internet of Things Foundation 配合使用 <../messaging/HTTPSIntro.html>`__。
zh_tw: `將 HTTP(S) 用於 Internet of Things Foundation<../messaging/HTTPSIntro.html>`__。

source: `HTTP(S) Connectivity for Applications <../messaging/HTTPSApplications.html>`__.
de: `HTTP(S)-Konnektivität für Anwendungen <../messaging/HTTPSApplications.html>`__.
es: `Conectividad de HTTP(S) para aplicaciones <../messaging/HTTPSApplications.html>`__.
fr: `Connectivité HTTP(S) pour les applications <../messaging/HTTPSApplications.html>`__.
it: `Connettività HTTP(S) per le applicazioni <../messaging/HTTPSApplications.html>`__.
ja: `アプリケーションの HTTP(S) 接続 <../messaging/HTTPSApplications.html>`__。
ko: `애플리케이션용 HTTP(S) 연결 <../messaging/HTTPSApplications.html>`__
pt_br: `Conectividade HTTP(S) para Aplicativos <../messaging/HTTPSApplications.html>`__.
zh_cn: `应用程序的 HTTP(S) 连接 <../messaging/HTTPSApplications.html>`__。
zh_tw: `應用程式的 HTTP(S) 連線功能<../messaging/HTTPSApplications.html>`__。

source: Using HTTP(S) with Devices and the Internet of Things Foundation
de: HTTP(S) bei Geräten und Internet of Things Foundation verwenden
es: Utilización de HTTP(S) con dispositivos e Internet of Things Foundation
fr: Utilisation de HTTP(S) avec des terminaux et Internet of Things Foundation
it: Utilizzo di HTTP(S) con i dispositivi e con Internet of Things Foundation
ja: HTTP(S) をデバイスと Internet of Things Foundation で使用する
ko: 디바이스 및 Internet of Things Foundation과 함께 HTTP(S) 사용
pt_br: Usando o HTTP(S) com Dispositivos e o Internet of Things Foundation
zh_cn: 将 HTTP(S) 与设备和 Internet of Things Foundation 配合使用
zh_tw: 將 HTTP(S) 用於裝置和 Internet of Things Foundation

source: The HTTP(S) protocol allows devices to send event messages to the Internet of Things Foundation by sending an HTTP(S) POST request to the following URL:
de: Das HTTP(S)-Protokoll ermöglicht es Geräten, Ereignisnachrichten an Internet of Things Foundation zu senden, indem sie eine HTTP(S)-POST-Anforderung an die folgenden URL senden:
es: El protocolo HTTP(S) permite a los dispositivos enviar mensajes de sucesos a Internet of Things Foundation enviando una solicitud POST HTTP(S) al siguiente URL:
fr: Le protocole HTTP(S) permet aux terminaux d'envoyer des messages d'événement à Internet of Things Foundation en soumettant un demande HTTP(S) POST à l'adresse URL suivante :
it: Il protocollo HTTP(S) consente ai dispositivi di inviare messaggi di evento a Internet of Things Foundation inviando una richiesta POST HTTP(S) al seguente URL:
ja: HTTP(S) プロトコルでは、HTTP(S) POST 要求を次の URL に送信することにより、デバイスが Internet of Things Foundation にイベント・メッセージを送信できます。
ko: HTTP(S) 프로토콜을 통해 디바이스가 다음 URL에 HTTP(S) POST 요청을 전송하여 Internet of Things Foundation에 이벤트 메시지를 전송할 수 있습니다.
pt_br: O protocolo HTTP(S) permite que os dispositivos enviem mensagens de eventos para o Internet of Things Foundation enviando uma solicitação POST HTTP(S) para a seguinte URL:
zh_cn: HTTP(S) 协议允许设备通过向以下 URL 发送 HTTP(S) POST 请求，向 Internet of Things Foundation 发送事件消息。
zh_tw: HTTP(S) 通訊協定可讓裝置傳送 HTTP(S) POST 要求至下列 URL，以將事件訊息傳送至 Internet of Things Foundation：

source: The request body (event payload) can have any content, however, MQTT message payload guidelines should be followed.
de: Der Anforderungshauptteil (Ereignisnutzdaten) kann einen beliebigen Inhalt aufweisen, es müssen jedoch die Richtlinien für MQTT-Nachrichtennutzdaten befolgt werden.
es: El cuerpo de solicitud (carga útil de suceso) puede tener cualquier contenido; no obstante, deben seguirse las directrices de carga útil de mensajes MQTT.
fr: Le corps de la demande (contenu de l'événement) peut correspondre à n'importe quel contenu. Toutefois, les règles applicables au contenu des messages MQTT doivent être respectées.
it: Il corpo della richiesta (payload evento) può avere qualsiasi contenuto, tuttavia è necessario attenersi alle linee guida per il payload dei messaggi MQTT.
ja: 要求の本文 (イベント・ペイロード) は任意の内容にすることができますが、MQTT メッセージ・ペイロードのガイドラインに従う必要があります。
ko: 요청 본문(이벤트 페이로드)에 컨텐츠가 있을 수 있지만 MQTT 메시지 페이로드 가이드라인이 앞서야 합니다.
pt_br: O corpo do pedido (carga útil do evento) pode ter qualquer conteúdo, no entanto, as diretrizes de carga útil da mensagem MQTT devem ser seguidas.
zh_cn: 请求主体（事件有效内容）可以包含任何内容，但是应遵循 MQTT 消息有效内容准则。
zh_tw: 要求內文（事件內容）可以有任何內容，但應遵循 MQTT 訊息內容準則。

source: A Content-Type request header must be provided with the request. Only the following values are supported. The following table shows how they are mapped to the Internet of Things Foundation internal formats.
de: Ein Inhaltstypanforderungsheader muss zusammen mit der Anforderung angegeben werden. Nur die nachfolgend aufgeführten Werte werden unterstützt. Die folgende Tabelle zeigt die Zuordnung dieser Werte zu den internen Internet of Things Foundation-Formaten.
es: Debe proporcionarse una cabecera de solicitud de tipo de contenido con la solicitud. Sólo están soportados los siguientes valores. La tabla siguiente muestra cómo se correlacionan con los formatos internos de Internet of Things Foundation.
fr: Un en-tête de demande Context-Type doit être fourni avec la demande. Seules les valeurs suivantes sont prises en charge.Le tableau ci-dessous indique leur correspondance avec les format internes d'Internet of Things Foundation.
it: È necessario fornire un'intestazione della richiesta Tipo contenuto con la richiesta. Sono supportati solo i seguenti valori. La seguente tabella mostra come sono associati ai formati interni di Internet of Things Foundation.
ja: コンテンツ・タイプ要求ヘッダーを要求と共に指定する必要があります。次の値のみがサポートされます。次の表に、Internet of Things Foundation の内部フォーマットとどのようにマップするか示します。
ko: 컨텐츠-유형 요청 헤더가 요청과 함께 제공되어야 합니다. 다음 값만 지원됩니다. 다음 테이블에서는 Internet of Things Foundation 내부 형식에 맵핑되는 방식을 보여줍니다.
pt_br: Um cabeçalho de pedido do tipo de conteúdo deve ser fornecido com o pedido. Apenas os valores a seguir são suportados. A tabela a seguir mostra como eles são mapeados para os formatos internos do Internet of Things Foundation.
zh_cn: 必须为请求提供 Content-Type 请求头。只支持以下值。下表显示了这些值如何映射为 Internet of Things Foundation 内部格式。
zh_tw: 「內容類型」要求標頭必須隨要求提供。目前僅支援下列值。下表列出它們對映至 Internet of Things Foundation 內部格式的情形。

source: Content-Type Header Volume
de: Inhaltstypheader
es: Volumen de cabecera de tipo de contenido
fr: Volume d'en-tête Content-Type
it: Volume intestazione Tipo di contenuto
ja: コンテンツ・タイプのヘッダーのボリューム
ko: 컨텐츠-유형 헤더 볼륨
pt_br: Volume do cabeçalho do tipo de conteúdo
zh_cn: Content-Type 头卷
zh_tw: 內容類型標頭磁區

source: IoT Foundation Format
es: Formato de IoT Foundation
fr: Format IoT Foundation
it: Formato IoT Foundation
ko: IoT Foundation 형식
pt_br: Formato do IoT Foundation
zh_cn: IoT Foundation 格式
zh_tw: IoT Foundation 格式

source: text/plain
es: texto/sin formato
it: testo/semplice
ko: 텍스트/일반
pt_br: texto/plano

source: text
es: texto
fr: texte
it: testo
ja: テキスト
ko: 텍스트
pt_br: texto

source: application/json
es: aplicación/json
it: applicazione/json
ko: 애플리케이션/json
pt_br: aplicativo/json

source: application/xml
es: aplicación/xml
it: applicazione/xml
ko: 애플리케이션/xml
pt_br: aplicativo/xml

source: application/octet-stream
es: aplicación/serie octal
it: applicazione/octet-stream
ko: 애플리케이션/옥텟-스트림

source: bin
ko: 바이너리

source: Please Note: Devices must be registered before issuing an HTTP(S) request, and when connecting to the Quickstart service no authentication or registration is required, and the org_id should be set to "quickstart".
de: Beachten Sie: Geräte müssen vor dem Absetzen einer HTTP(S)-Anforderung registriert werden, beim Herstellen einer Verbindung zum Quickstart-Service ist keine Authentifizierung oder Registrierung erforderlich und für 'org_id' muss "quickstart" festgelegt werden.
es: Nota: los dispositivos deben registrarse antes de emitir una solicitud HTTP(S) y, al conectarse al servicio Quickstart, no se necesita ninguna autenticación ni registro y org_id debe establecerse en "quickstart".
fr: Remarque : Vous devez enregistrer les terminaux avant d'envoyer une demande HTTP(S) ; en cas de connexion au service Quickstart, il n'y a pas d'authentification ou d'enregistrement. La valeur indiquée pour org_id doit être "quickstart".
it: Nota: i dispositivi devono essere registrati prima di emettere la richiesta HTTP(S) e quando ci si connette al servizio Quickstart non è richiesta alcuna autenticazione o registrazione e org_id deve essere impostato su "quickstart".
ja: 注記: HTTP(S) 要求を発行する前にデバイスを登録する必要があります。Quickstart サービスに接続する際、認証は (登録も) 必要ありません。org_id は "quickstart" に設定する必要があります。
ko: 참고: 디바이스가 HTTP(S) 요청을 발행하기 전에 등록되어야 하며 Quickstart 서비스에 연결하는 경우 인증 또는 등록이 필요하지 않고 org_id가 "quickstart"로 설정되어야 합니다.
pt_br: Nota: Os dispositivos devem ser registrados antes de emitir uma solicitação HTTP(S), e quando se conectam ao serviço de iniciação rápida nenhuma autenticação ou registro é necessária e o org_id deve ser configurado como "quickstart".
zh_cn: 请注意：在发出 HTTP(S) 请求之前必须先注册设备，在连接 Quickstart 服务时，无需认证或注册，且 org_id 应设置为“quickstart”。
zh_tw: 請注意：必須先登錄裝置才能發出 HTTP(S) 要求，且在連接至 Quickstart 服務時，不需要進行鑑別或登錄，而且 org_id 應設為 "quickstart"。

source: HTTP(S) Authentication
de: HTTP(S)-Authentifizierung
es: Autenticación HTTP(S)
fr: Authentification HTTP(S)
it: Autenticazione HTTP(S)
ja: HTTP(S) 認証
ko: HTTP(S) 인증
pt_br: Autenticação HTTP(S)
zh_cn: HTTP(S) 认证
zh_tw: HTTP(S) 鑑別

source: HTTP(S) requests must include an Authorization header if they are sent to registered organizations. Basic authentication is the only method supported. The username and password must be provided as described below.
de: HTTP(S)-Anforderungen müssen einen Berechtigungsheader enthalten, wenn sie an registrierte Organisationen gesendet werden. Die Basisauthentifizierung ist die einzige unterstützte Methode. Der Benutzername und das Kennwort müssen angegeben werden, wie im Folgenden beschrieben.
es: Las solicitudes HTTP(S) deben incluir una cabecera de autorización si se envían a organizaciones registradas. La autenticación básica es el único método soportado. El nombre de usuario y la contraseña deben proporcionarse como se describe a continuación.
fr: Les demandes HTTP(S) doivent inclure un en-tête Authorization si elles sont envoyées à des organisations enregistrées. L'authentification de base est la seule méthode prise en charge. Le nom d'utilisateur et le mot de passe doivent être indiqués comme décrit dans la section ci-dessous.
it: Le richieste HTTP(S) devono includere un'intestazione Autorizzazione se vengono inviate a organizzazioni registrate. L'autenticazione di base è l'unico metodo supportato. È necessario fornire nome utente e password come descritto di seguito.
ja: HTTP(S) 要求は、登録済みの組織に送信する場合に、許可ヘッダーを含める必要があります。基本認証が、唯一サポートされる方法です。ユーザー名とパスワードを次に示すように指定する必要があります。
ko: HTTP(S) 요청은 등록된 조직에 전송되는 경우 권한 부여 헤더를 포함해야 합니다. 기본 인증은 지원되는 유일한 메소드입니다. 사용자 이름 및 비밀번호가 아래에 설명된 대로 제공되어야 합니다.
pt_br: As solicitações HTTP(S) devem incluir um cabeçalho de autorização, se eles são enviados para organizações registradas. A autenticação básica é o único método suportado. O nome do usuário e senha devem ser fornecidos como descrito abaixo.
zh_cn: 如果将 HTTP(S) 请求发送到已注册组织，那么这些请求中必须包括授权头。只支持基本认证方法。必须按如下所述提供用户名和密码。
zh_tw: HTTP(S) 要求如果是要傳送至已登錄的組織，則必須包含「授權」標頭。基本鑑別是唯一受支援的方法。您必須依照下列說明提供使用者名稱和密碼。

source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome do usuário
zh_cn: 用户名
zh_tw: 使用者名稱

source: The service currently supports only token-based authentication for devices. The username must be set to ``use-token-auth``. This username indicates to the service that the authentication token for the device will be passed as the password for the HTTP(S) request.
de: Der Service unterstützt zurzeit nur die tokenbasierte Authentifizierung für Geräte. Für den Benutzernamen muss ``use-token-auth`` festgelegt werden. Dieser Benutzername informiert den Service, dass das Authentifizierungstoken für das Gerät als Kennwort für die HTTP(S)-Anforderung übergeben wird.
es: El servicio actualmente sólo da soporte a la autenticación basada en señales para los dispositivos. El nombre de usuario debe establecerse en ``use-token-auth``. Este nombre de usuario indica al servicio que la señal de autenticación para el dispositivo se pasará como la contraseña para la solicitud HTTP(S).
fr: A l'heure actuelle, le service prend uniquement en charge l'authentification basée sur des jetons pour les terminaux. Le nom d'utilisateur doit correspondre à ``use-token-auth``. Il indique au service que le jeton d'authentification du terminal est transmis en tant que mot de passe pour la demande HTTP(S).
it: Il servizio attualmente supporta solo l'autenticazione basata su token per i dispositivi. Il nome utente deve essere impostato su ``use-token-auth``. Questo nome utente indica al servizio che il token di autenticazione per il dispositivo verrà inoltrato come password per la richiesta HTTP(S).
ja: サービスは、現在デバイスのトークンベースの認証のみをサポートしています。ユーザー名は`use-token-auth` に設定する必要があります。このユーザー名は、デバイスの認証トークンが HTTP(S) 要求のパスワードとして渡されることをサービスに示します。
ko: 서비스는 디바이스에 대해 토큰 기반 인증만 현재 지원합니다. 사용자 이름은 ``use-token-auth``로 설정되어야 합니다. 이 사용자 이름은 디바이스에 대한 인증 토큰이 HTTP(S) 요청에 대해 비밀번호로 전달됨을 서비스에 표시합니다.
pt_br: O serviço suporta atualmente apenas autenticação baseada em token para dispositivos. O nome do usuário deve ser configurado como ``use-token-auth`. Esse nome indica ao serviço que o token de autenticação para o dispositivo será transmitido como a senha para a solicitação HTTP(S).
zh_cn: 此服务当前只针对设备支持基于令牌的认证。用户名必须设置为“use-token-auth”。该用户名向服务表明：设备的认证令牌将作为 HTTP(S) 请求的密码进行传递。
zh_tw: 服務目前對於裝置僅支援記號型鑑別。使用者名稱必須設為 ``use-token-auth``。此使用者名稱向該服務指出裝置的鑑別記號將傳遞作為 HTTP(S) 要求的密碼。

source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 비밀번호
pt_br: Senha
zh_cn: 密码
zh_tw: 密碼

source: Submit the device authentication token as the password when issuing your HTTP(S) request.
de: Übergeben Sie das Authentifizierungstoken für das Gerät als Kennwort beim Absetzen der HTTP(S)-Anforderung.
es: Envíe la señal de autenticación de dispositivo como la contraseña cuando emita la solicitud HTTP(S).
fr: Soumettez le jeton d'authentification du terminal comme mot de passe lors de l'envoi de la demande HTTP(S).
it: Inoltrare il token di autenticazione del dispositivo come password quando si inoltrano le richieste HTTP(S).
ja: HTTP(S) 要求を発行する際に、パスワードとしてデバイスの認証トークンを送信します。
ko: HTTP(S) 요청 발행 시 비밀번호로 디바이스 인증 토큰을 제출하십시오.
pt_br: Envie o token de autenticação de dispositivo como a senha ao emitir a sua solicitação HTTP(S).
zh_cn: 发出 HTTP(S) 请求时，提交设备认证令牌作为密码。
zh_tw: 發出 HTTP(S) 要求時提交裝置鑑別記號作為密碼。
