Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/messaging/HTTPSIntro.po
Languages: ko, pt_br

source: HTTP(S) Connectivity with the Internet of Things Foundation
ko: Internet of Things Foundation과의 HTTP(S) 연결
pt_br: Conectividade HTTP(S) com o Internet of Things Foundation

source: The HTTP(S) messaging protocol can be used by devices and applications to interact with the IBM Internet of Things Foundation. This messaging protocol can be used instead of the `MQTT messaging protocol <../messaging/mqtt.html>`__ and the `optional client libraries <../libraries/programmingguides.html>`__.
ko: HTTP(S) 메시징 프로토콜은 IBM Internet of Things Foundation과 상호작용하는 데 디바이스 및 애플리케이션에서 사용될 수 있습니다. 이 메시징 프로토콜은 `MQTT 메시징 프로토콜 <../messaging/mqtt.html>`__ 및 `선택적 클라이언트 라이브러리 <../libraries/programmingguides.html>`__ 대신 사용될 수 있습니다.
pt_br: O protocolo de mensagem HTTP(S) pode ser utilizado por dispositivos e aplicativos para interagir com o IBM Internet of Things Foundation. Esse protocolo de mensagens pode ser utilizado no lugar do `protocolo de mensagem MQTT <../messaging/mqtt.html>`__ e as `bibliotecas do cliente opcional <../libraries/programmingguides.html>`__.

source: All devices can use HTTP(S) messaging to communicate with the Internet of Things Foundation with no additional installation.
ko: 모든 디바이스는 HTTP(S) 메시징을 사용하여 추가 설치 없이 Internet of Things Foundation과 통신할 수 있습니다.
pt_br: Todos os dispositivos podem utilizar mensagens HTTP(S) para comunicação com o Internet of Things Foundation sem necessidade de instalação adicional.

source: The HTTP(S) protocol can be used with devices and applications to send event messages to the Internet of Things Foundation. For details, please see:
ko: HTTP(S) 프로토콜은 Internet of Things Foundation에 이벤트 메시지를 전송하는 데 디바이스 및 애플리케이션과 함께 사용될 수 있습니다. 세부사항은 다음을 참조하십시오.
pt_br: O protocolo HTTP(S) pode ser utilizado com dispositivos e aplicativos para enviar mensagens de eventos para o Internet of Things Foundation. Para obter detalhes, consulte:

source: `HTTP(S) Connectivity for Devices <../messaging/HTTPSDevice.html>`__.
ko: `디바이스용 HTTP(S) 연결 <../messaging/HTTPSDevice.html>`__
pt_br: `Conectividade HTTP(S) para Aplicativos <../messaging/HTTPSDevice.html>`__.

source: `HTTP(S) Connectivity for Applications <../messaging/HTTPSApplications.html>`__.
ko: `애플리케이션용 HTTP(S) 연결 <../messaging/HTTPSApplications.html>`__
pt_br: `Conectividade HTTP(S) para Aplicativos <../messaging/HTTPSApplications.html>`__.

source: Please Note: Devices and applications cannot use the HTTP(S) protocol to issue commands.
ko: 참고: 디바이스 및 애플리케이션은 명령을 실행하는 데 HTTP(S) 프로토콜을 사용할 수 없습니다.
pt_br: Nota: Os dispositivos e aplicativos não podem utilizar o protocolo HTTP(S) para emitir comandos.

source: HTTP(S) Request
ko: HTTP(S) 요청
pt_br: Solicitação HTTP(S)

source: HTTP(S) requests for applications and devices must be issued to the originating organization's unique endpoint. The organization endpoint uses the following format:
ko: 애플리케이션 및 디바이스의 HTTP(S) 요청은 시작하는 조직의 고유한 엔드포인트에 발행되어야 합니다. 조직 엔드포인트는 다음 형식을 사용합니다.
pt_br: Solicitações HTTP(S) para aplicativos e dispositivos devem ser emitidos ao terminal único da organização originadora. O terminal da organização utiliza o formato a seguir:

source: Only HTTPS can be used with registered organizations. When using HTTPS with a registered organization, the data, including the issuer's credentials are encrypted. HTTP is supported in the Quickstart environment only.
ko: HTTPS만 등록된 조직과 함께 사용될 수 있습니다. 등록된 조직과 함께 HTTPS를 사용하는 경우 데이터(발행자의 신임 정보 포함)가 암호화됩니다. HTTP는 Quickstart 환경에서만 지원됩니다.
pt_br: Apenas o HTTPS pode ser utilizado com organizações registradas. Ao utilizar o HTTPS com uma organização registrada, os dados, incluindo as credenciais do emissor são criptografados. O HTTP é suportado apenas no ambiente de iniciação rápida.

source: Quality of Service
ko: 서비스 품질(QoS)
pt_br: Qualidade de Serviço

source: The HTTP(S) protocol provides "at most once" best effort delivery, analagous to the QoS0 quality of service provided by the MQTT protocol. When using QoS0, or the HTTP(S) equivalent, to deliver event messages, the device or application must implement retry logic to guarantee delivery.
ko: HTTP(S) 프로토콜은 MQTT 프로토콜에서 제공된 QoS0 서비스 품질(QoS)과 유사하게 "최대 한 번" 최선형 전송을 제공합니다. 이벤트 메시지를 전달하는 데 QoS0 또는 HTTP(S) 등가물을 사용하는 경우 디바이스 또는 애플리케이션은 전달을 위해 재시도 논리를 구현해야 합니다.
pt_br: O protocolo HTTP(S) fornece "no máximo uma vez " a entrega do melhor esforço, análogas a qualidade de serviço fornecido do QoS0 pelo protocolo MQTT. Ao usar o QoS0, ou o equivalente HTTP(S), para entregar mensagens de evento, o dispositivo ou aplicativo deve implementar a lógica de nova tentativa para garantir a entrega.

source: For more information on the MQTT protocol and Quality of Service levels, please see `MQTT for the Internet of Things Foundation <../messaging/mqtt.html>`__ documentation.
ko: MQTT 프로토콜 및 서비스 품질(QoS) 레벨에 대한 자세한 정보는 `Internet of Things Foundation용 MQTT <../messaging/mqtt.html>`__ 문서를 참조하십시오.
pt_br: Para obter mais informações sobre o protocolo MQTT e os níveis de Qualidade de Serviço, consulte `documentação do MQTT para o Internet of Things Foundation <../messaging/mqtt.html>`__.
