Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/messaging/HTTPSApplications.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: HTTP(S) Connectivity for Applications
de: HTTP(S)-Konnektivität für Anwendungen
es: Conectividad de HTTP(S) para aplicaciones
fr: Connectivité HTTP(S) pour les applications
it: Connettività HTTP(S) per le applicazioni
ja: アプリケーションの HTTP(S) 接続
ko: 애플리케이션을 위한 HTTP(S) 연결
pt_br: Conectividade HTTP(S) para Aplicativos
zh_cn: 应用程序的 HTTP(S) 连接
zh_tw: 應用程式的 HTTP(S) 連線功能

source: The HTTP(S) messaging protocol can be used by devices and applications to interact with the IBM Internet of Things Foundation. This messaging protocol can be used instead of the `MQTT messaging protocol <../messaging/mqtt.html>`__ and the `optional client libraries <../libraries/programmingguides.html>`__.
de: Das HTTP(S)-Nachrichtenprotokoll kann von Geräten und Anwendungen zur Interaktion mit IBM Internet of Things Foundation verwendet werden. Dieses Nachrichtenprotokoll kann anstelle des `MQTT-Nachrichtenprotokolls <../messaging/mqtt.html>`__ und der `optionalen Clientbibliotheken <../libraries/programmingguides.html>`__ verwendet werden.
es: Los dispositivos y las aplicaciones pueden utilizar el protocolo de mensajería HTTP(S) para interactuar con IBM Internet of Things Foundation. Este protocolo de mensajería puede utilizarse en lugar del `Protocolo de mensajería <../messaging/mqtt.html>`__ y las `bibliotecas de cliente opcionales <../libraries/programmingguides.html>`__.
fr: Le protocole de messagerie HTTP(S) permet à des terminaux et à des applications d'interagir avec IBM Internet of Things Foundation. Il peut être utilisé à la place du `protocole de messagerie MQTT <../messaging/mqtt.html>`__ et des `bibliothèques client facultatives <../libraries/programmingguides.html>`__.
it: Il protocollo di messaggistica HTTP(S) può essere utilizzato da dispositivi e applicazioni per interagire con IBM Internet of Things Foundation. Questo protocollo di messaggistica può essere utilizzato al posto del `protocollo di messaggistica MQTT <../messaging/mqtt.html>`__ e delle `librerie client facoltative <../libraries/programmingguides.html>`__.
ja: IBM Internet of Things Foundation と対話するために、デバイスとアプリケーションが HTTP(S) メッセージ・プロトコルを使用できます。このメッセージ・プロトコルは、`MQTT メッセージ・プロトコル <../messaging/mqtt.html>`__ と `オプションのクライアント・ライブラリー <../libraries/programmingguides.html>`__ の代わりに使用できます。
ko: HTTP(S) 메시징 프로토콜은 IBM Internet of Things Foundation과 상호작용하는 데 디바이스 및 애플리케이션에서 사용될 수 있습니다. 이 메시징 프로토콜은 `MQTT 메시징 프로토콜 <../messaging/mqtt.html>`__ 및 `선택적 클라이언트 라이브러리 <../libraries/programmingguides.html>`__ 대신 사용할 수 있습니다.
pt_br: O protocolo de mensagem HTTP(S) pode ser utilizado por dispositivos e aplicativos para interagir com o IBM Internet of Things Foundation. Esse protocolo de mensagens pode ser utilizado no lugar do `protocolo de mensagem MQTT <../messaging/mqtt.html>`__ e as `bibliotecas do cliente opcional <../libraries/programmingguides.html>`__.
zh_cn: 设备和应用程序可以使用 HTTP(S) 消息传递协议与 IBM Internet of Things Foundation 交互。此消息传递协议可代替 `MQTT 消息传递协议 <../messaging/mqtt.html>`__ 和 `可选客户机库 <../libraries/programmingguides.html>`__ 使用。
zh_tw: 裝置和應用程式可使用 HTTP(S) 傳訊通訊協定與 IBM Internet of Things Foundation 互動。此傳訊通訊協定可代替 `MQTT 傳訊通訊協定<../messaging/mqtt.html>`__和`選用的用戶端程式庫<../libraries/programmingguides.html>`__。

source: The HTTP(S) protocol can be used with devices and applications to send event messages to the Internet of Things Foundation. For details, please see:
de: Das HTTP(S)-Protokoll kann von Geräten und Anwendungen verwendet werden, um Ereignisnachrichten an Internet of Things Foundation zu senden. Details hierzu finden Sie hier:
es: El protocolo HTTP(S) puede utilizarse con los dispositivos y las aplicaciones para enviar mensajes de sucesos a Internet of Things Foundation. Para obtener más detalles, consulte:
fr: Le protocole HTTP(S) permet à des terminaux et à des applications d'envoyer des messages d'événement à Internet of Things Foundation. Pour plus d'informations, reportez-vous aux rubriques suivantes :
it: Il protocollo HTTP(S) può essere utilizzato con dispositivi e applicazioni per inviare messaggi di evento a Internet of Things Foundation. Per i dettagli, consultare:
ja: デバイスとアプリケーションでは、Internet of Things Foundation にイベント・メッセージを送信するために HTTP(S) プロトコルを使用できます。詳細については、以下を参照してください。
ko: HTTP(S) 프로토콜은 Internet of Things Foundation에 이벤트 메시지를 전송하는 데 디바이스 및 애플리케이션과 함께 사용될 수 있습니다. 세부사항은 다음을 참조하십시오.
pt_br: O protocolo HTTP(S) pode ser utilizado com dispositivos e aplicativos para enviar mensagens de eventos para o Internet of Things Foundation. Para obter detalhes, consulte:
zh_cn: 设备和应用程序可以使用 HTTP(S) 协议向 Internet of Things Foundation 发送事件消息。有关详细信息，请参阅：
zh_tw: HTTP(S) 通訊協定可用於裝置和應用程式，以將事件訊息傳送至 Internet of Things Foundation。如需詳細資料，請參閱：

source: `Using HTTP(S) with the Internet of Things Foundation <../messaging/HTTPSIntro.html>`__.
de: `Verwenden von HTTP(S) mit Internet of Things Foundation <../messaging/HTTPSIntro.html>`__.
es: `Utilización de HTTP(S) con Internet of Things Foundation <../messaging/HTTPSIntro.html>`__.
fr: `Utilisation de HTTP(S) avec Internet of Things Foundation <../messaging/HTTPSIntro.html>`__.
it: `Utilizzo di HTTP(S) con Internet of Things Foundation <../messaging/HTTPSIntro.html>`__.
ja: `HTTP(S) と Internet of Things Foundation の使用<../messaging/HTTPSIntro.html>`__。
ko: `Internet of Things Foundation과 함께 HTTP(S) 사용 <../messaging/HTTPSIntro.html>`__
pt_br: `Usando o HTTP(S) com o Things Foundation <../messaging/HTTPSIntro.html>`__.
zh_cn: `将 HTTP(S) 与 Internet of Things Foundation 配合使用 <../messaging/HTTPSIntro.html>`__。
zh_tw: `將 HTTP(S) 用於 Internet of Things Foundation<../messaging/HTTPSIntro.html>`__。

source: `HTTP(S) Connectivity for Devices <../messaging/HTTPSDevice.html>`__.
de: `HTTP(S)-Konnektivität für Geräte <../messaging/HTTPSDevice.html>`__.
es: `Conectividad de HTTP(S) para dispositivos <../messaging/HTTPSDevice.html>`__.
fr: `Connectivité HTTP(S) pour les terminaux <../messaging/HTTPSDevice.html>`__.
it: `Connettività HTTP(S) per i dispositivi <../messaging/HTTPSDevice.html>`__.
ja: デバイスの `HTTP(S) 接続 <../messaging/HTTPSDevice.html>`__。
ko: `디바이스용 HTTP(S) 연결 <../messaging/HTTPSDevice.html>`__
pt_br: `Conectividade HTTP(S) para Dispositivos <../messaging/HTTPSDevice.html>`__.
zh_cn: `设备的 HTTP(S) 连接 <../messaging/HTTPSDevice.html>`__。
zh_tw: `裝置的 HTTP(S) 連線功能<../messaging/HTTPSDevice.html>`__。

source: Using HTTP(S) with Applications and the Internet of Things Foundation
de: HTTP(S) bei Anwendungen und Internet of Things Foundation verwenden
es: Utilización de HTTP(S) con aplicaciones e Internet of Things Foundation
fr: Utilisation de HTTP(S) avec des applications et Internet of Things Foundation
it: Utilizzo di HTTP(S) con le applicazioni e Internet of Things Foundation
ja: HTTP(S) をアプリケーションと Internet of Things Foundation で使用する
ko: 애플리케이션 및 Internet of Things Foundation과 함께 HTTP(S) 사용
pt_br: Utilizando HTTP(S) com Aplicativos e o Internet of Things Foundation
zh_cn: 将 HTTP(S) 与应用程序和 Internet of Things Foundation 配合使用
zh_tw: 將 HTTP(S) 用於應用程式和 Internet of Things Foundation

source: The HTTP(S) protocol allows applications to send event messages to the Internet of Things Foundation by sending an HTTP(S) POST request to the following URL:
de: Das HTTP(S)-Protokoll ermöglicht es Anwendungen, Ereignisnachrichten an Internet of Things Foundation zu senden, indem sie eine HTTP(S)-POST-Anforderung an die folgenden URL senden:
es: El protocolo HTTP(S) permite a las aplicaciones enviar mensajes de sucesos a Internet of Things Foundation enviando una solicitud POST HTTP(S) al siguiente URL:
fr: Le protocole HTTP(S) permet aux applications d'envoyer des messages d'événement à Internet of Things Foundation en soumettant une demande HTTP(S) POST à l'adresse URL suivante :
it: Il protocollo HTTP(S) consente alle applicazioni di inviare messaggi di evento a Internet of Things Foundation inviando una richiesta POST HTTP(S) al seguente URL:
ja: HTTP(S) プロトコルでは、HTTP(S) POST 要求を次の URL に送信することにより、アプリケーションが Internet of Things Foundation にイベント・メッセージを送信できます。
ko: HTTP(S) 프로토콜을 통해 애플리케이션이 다음 URL에 HTTP(S) POST 요청을 전송하여 Internet of Things Foundation에 이벤트 메시지를 전송할 수 있습니다.
pt_br: O protocolo HTTP(S) permite que os aplicativos enviem mensagens de eventos para o Internet of Things Foundation enviando uma solicitação POST HTTP(S) para a seguinte URL:
zh_cn: HTTP(S) 协议允许应用程序通过向以下 URL 发送 HTTP(S) POST 请求，向 Internet of Things Foundation 发送事件消息：
zh_tw: HTTP(S) 通訊協定可讓應用程式傳送 HTTP(S) POST 要求至下列 URL，以將事件訊息傳送至 Internet of Things Foundation：

source: For details, see the relevant `API documentation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__. The request body (event payload) can have any content, however, MQTT message payload guidelines should be followed.
de: Details hierzu finden Sie in der entsprechenden `API-Dokumentation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__. Der Anforderungshauptteil (Ereignisnutzdaten) kann einen beliebigen Inhalt aufweisen, es müssen jedoch die Richtlinien für MQTT-Nachrichtennutzdaten befolgt werden.
es: Para obtener detalles, consulte la `documentación de la API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__ correspondiente. El cuerpo de solicitud (carga útil de suceso) puede tener cualquier contenido; no obstante, deben seguirse las directrices de carga útil de mensajes MQTT.
fr: Pour plus d'informations, reportez-vous à la `documentation d'API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__ appropriée. Le corps de la demande (contenu de l'événement) peut correspondre à n'importe quel contenu. Toutefois, les règles applicables au contenu des messages MQTT doivent être respectées.
it: Per i dettagli, consultare la relativa `documentazione API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__. Il corpo della richiesta (payload evento) può avere qualsiasi contenuto, tuttavia è necessario attenersi alle linee guida per il payload dei messaggi MQTT.
ja: 詳細は、関連する `API の資料<https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__を参照してください。要求の本文 (イベント・ペイロード) は任意の内容にすることができますが、MQTT メッセージ・ペイロードのガイドラインに従う必要があります。
ko: 세부사항은 관련 `API 문서 <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__의 내용을 참조하십시오. 요청 본문(이벤트 페이로드)에 컨텐츠가 있을 수 있지만 MQTT 메시지 페이로드 가이드라인이 앞서야 합니다.
pt_br: Para obter detalhes, consulte a documentação da API relevante ` <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__. O corpo do pedido (carga útil do evento) pode ter qualquer conteúdo, no entanto, as diretrizes de carga útil da mensagem MQTT devem ser seguidas.
zh_cn: 有关详细信息，请参阅相关的 `API 文档 <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__。请求主体（事件有效内容）可以包含任何内容，但是应遵循 MQTT 消息有效内容准则。
zh_tw: 如需詳細資料，請參閱相關的 `API 文件<https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__。要求內文（事件內容）可以有任何內容，但應遵循 MQTT 訊息內容準則。

source: Please Note: An application does not need to be registered before it can issue an HTTP(S) request. When connecting to the Quickstart service, no authentication (or registration) is required, the org_id should be set to "quickstart".
de: Beachten Sie: Eine Anwendung muss nicht registriert werden, bevor sie eine HTTP(S)-Anforderung senden kann. Bei der Herstellung einer Verbindung zum Quickstart-Service ist keine Authentifizierung (oder Registrierung) erforderlich, für 'org_id' muss "quickstart" festgelegt werden.
es: Nota: una aplicación no necesita estar registrada para poderse emitir una solicitud HTTP(S). Al conectarse al servicio Quickstart, no se necesita ninguna autenticación (o registro) y org_id debe establecerse en "quickstart".
fr: Remarque : Il est inutile d'enregistrer une application pour qu'elle puisse soumettre une demande HTTP(S). Lors de la connexion au service Quickstart, aucune authentification (ou enregistrement) n'est nécessaire. La valeur définie pour org_id doit être "quickstart".
it: Nota: non è necessario registrare un'applicazione affinché possa emettere una richiesta HTTP(S). Quando ci si connette al servizio Quickstart, non è richiesta l'autenticazione (o la registrazione), e org_id deve essere impostato su "quickstart".
ja: 注記: HTTP(S) 要求を発行する前にアプリケーションを登録する必要はありませんQuickstart サービスに接続する際、認証は (登録も) 必要ありません。org_id は "quickstart" に設定する必要があります
ko: 참고: HTTP(S) 요청을 발행하려면 애플리케이션이 등록될 필요가 없습니다. Quickstart 서비스에 연결하는 경우 인증(또는 등록)이 필요하지 않고 org_id가 "quickstart"로 설정되어야 합니다.
pt_br: Nota: Um aplicativo não precisa ser registrado antes de poder emitir uma solicitação HTTP(S). Ao conectar-se ao serviço de iniciação rápida, nenhuma autenticação (ou registro) é necessária, o org_id deve ser configurado como "quickstart".
zh_cn: 请注意：应用程序无需进行注册即可发出 HTTP(S) 请求。连接 Quickstart 服务时，无需认证（或注册），org_id 应设置为“quickstart”。
zh_tw: 請注意：應用程式不需要先登錄就可以發出 HTTP(S) 要求。連接至 Quickstart 服務時，不需要進行鑑別（或登錄），org_id 應設為 "quickstart"。

source: HTTP(S) Authentication
de: HTTP(S)-Authentifizierung
es: Autenticación HTTP(S)
fr: Authentification HTTP(S)
it: Autenticazione HTTP(S)
ja: HTTP(S) 認証
ko: HTTP(S) 인증
pt_br: Autenticação HTTP(S)
zh_cn: HTTP(S) 认证
zh_tw: HTTP(S) 鑑別

source: HTTP(S) requests must include an Authorization header if they are sent to organizations that require authentication. Basic authentication the only method supported. The username and password must be provided as described below.
de: HTTP(S)-Anforderungen müssen einen Berechtigungsheader enthalten, wenn sie an Organisationen gesendet werden, die eine Authentifizierung erfordern. Die Basisauthentifizierung ist die einzige unterstützte Methode. Der Benutzername und das Kennwort müssen angegeben werden, wie im Folgenden beschrieben.
es: Las solicitudes HTTP(S) deben incluir una cabecera de autorización si se envían a organizaciones que requieren autenticación. La autenticación básica es el único método soportado. El nombre de usuario y la contraseña deben proporcionarse como se describe a continuación.
fr: Les demandes HTTP(S) doivent inclure un en-tête Authorization si elles sont envoyées à des organisations qui requièrent une authentification. L'authentification de base est la seule méthode prise en charge. Le nom d'utilisateur et le mot de passe doivent être indiqués comme décrit dans la section ci-dessous.
it: Le richieste HTTP(S) devono includere un'intestazione Autorizzazione se vengono inviate a organizzazioni che richiedono l'autenticazione. L'autenticazione di base è l'unico metodo supportato. È necessario fornire nome utente e password come descritto di seguito.
ja: HTTP(S) 要求には、認証を必要とする組織に送信する場合に許可ヘッダーを含める必要があります。基本認証が、唯一サポートされる方法です。ユーザー名とパスワードを次に示すように指定する必要があります。
ko: HTTP(S) 요청은 인증이 필요한 조직에 전송되는 경우 권한 부여 헤더를 포함해야 합니다. 유일한 메소드가 지원한 기본 인증입니다. 사용자 이름 및 비밀번호가 아래에 설명된 대로 제공되어야 합니다.
pt_br: As solicitações HTTP(S) devem incluir um cabeçalho de autorização, se eles são enviados para as organizações que requerem autenticação. A autenticação básica é o único método suportado. O nome do usuário e senha devem ser fornecidos como descrito abaixo.
zh_cn: 如果将 HTTP(S) 请求发送到需要认证的组织，那么这些请求中必须包括授权头。只支持基本认证方法。必须按如下所述提供用户名和密码。
zh_tw: HTTP(S) 要求如果是要傳送至需要鑑別的組織，則必須包含「授權」標頭。基本鑑別是唯一受支援的方法。您必須依照下列說明提供使用者名稱和密碼。

source: Applications require an API key to connect to an organization. When the API key is registered, a token will be generated that must be used with that API key.
de: Anwendungen benötigen einen API_Schlüssel, um eine Verbindung zu einer Organisation herzustellen. Wenn der API_Schlüssel registriert wird, wird ein Token generiert, das zusammen mit diesem API-Schlüssen verwendet werden muss.
es: Las aplicaciones requieren una clave de API para conectarse a una organización. Cuando se registra una clave de API, se genera una señal que se deberá utilizar con esa clave de API.
fr: Les applications requièrent une clé d'API pour se connecter à une organisation. Lorsque la clé d'API est enregistrée, la procédure génère un jeton qui doit être utilisé avec cette clé d'API.
it: Le applicazioni richiedono una chiave API per connettersi a un'organizzazione. Una volta registrata la chiave API, verrà creato un token che deve essere utilizzato con la chiave API.
ja: アプリケーションが組織に接続するには API キーが必要です。API キーを登録すると、その API キーと共に使用する必要のあるトークンが生成されます。
ko: 애플리케이션이 조직에 연결하려면 API 키가 필요합니다. API 키가 등록되면 해당 API 키와 함께 사용되어야 하는 토큰이 생성됩니다.
pt_br: Os aplicativos requerem uma chave API para se conectarem a uma organização. Quando a chave API é registrada, é gerado um token que deve ser usado com essa chave API.
zh_cn: 应用程序需要 API 密钥才能连接到组织。注册 API 密钥时，将生成必须与该 API 密钥配合使用的令牌。
zh_tw: 應用程式需要 API 金鑰才能連接至組織。如果 API 金鑰已登錄，則會產生一個必須與該 API 金鑰搭配使用的記號。

source: API keys use the following format:
de: API-Schlüssel verwenden das folgende Format:
es: Las claves de API utilizan el siguiente formato:
fr: Les clés d'API utilisent le format suivant :
it: Le chiavi API utilizzano il seguente formato:
ja: API キーは次のフォーマットを使用します。
ko: API 키는 다음 형식을 사용합니다.
pt_br: As chaves da API usam o formato a seguir:
zh_cn: API 密钥使用以下格式：
zh_tw: API 金鑰採用下列格式：

source: The token will follow the format of this example:
de: Das Format des Tokens entspricht diesem Beispiel:
es: La señal seguirá el formato de este ejemplo:
fr: Le jeton doit respecter le format de cet exemple :
it: Il token seguirà il formato di questo esempio:
ja: トークンはこの例のフォーマットに従います。
ko: 토큰이 이 예제의 형식을 따릅니다.
pt_br: O token seguirá o formato deste exemplo:
zh_cn: 令牌遵循以下示例格式：
zh_tw: 記號會遵循下列範例的格式：

source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome do usuário
zh_cn: 用户名
zh_tw: 使用者名稱

source: In an HTTP(S) request, the API key must be used as the username.
de: In einer HTTP(S)-Anforderung muss der API-Schlüssel als Benutzername verwendet werden.
es: En una solicitud HTTP(S), la clave de API debe utilizarse como nombre de usuario.
fr: Dans une demande HTTP(S), la clé d'API doit être utilisée comme nom d'utilisateur.
it: In una richiesta HTTP(S), la chiave API deve essere utilizzata come nome utente.
ja: HTTP(S) 要求では、API キーはユーザー名として使用する必要があります。
ko: HTTP(S) 요청에서 API 키가 사용자 이름으로 사용되어야 합니다.
pt_br: Em um pedido de HTTP(S), a chave API deve ser utilizada como o nome do usuário.
zh_cn: 在 HTTP(S) 请求中，API 密钥必须用作用户名。
zh_tw: 在 HTTP(S) 要求中，API 金鑰必須作為使用者名稱。

source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 비밀번호
pt_br: Senha
zh_cn: 密码
zh_tw: 密碼

source: In an HTTP(S) request, the generated token must be used as the password.
de: In einer HTTP(S)-Anforderung muss das generierte Token als Kennwort verwendet werden.
es: En una solicitud HTTP(S), la señal generada debe utilizarse como contraseña.
fr: Dans une demande HTTP(S), le jeton généré doit être utilisé comme mot de passe.
it: In una richiesta HTTP(S), il token generato deve essere utilizzato come password.
ja: HTTP(S) 要求では、生成されたトークンはパスワードとして使用する必要があります。
ko: HTTP(S) 요청에서 생성된 토큰이 비밀번호로 사용되어야 합니다.
pt_br: Em um pedido de HTTP(S), o token gerado deve ser utilizado como a senha.
zh_cn: 在 HTTP(S) 请求中，生成的令牌必须用作密码。
zh_tw: 在 HTTP(S) 要求中，產生的記號必須作為密碼。
