Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/messaging/managed_devices.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: MQTT Connectivity for Managed Devices
de: MQTT-Konnektivität für verwaltete Geräte
es: Conectividad de MQTT para dispositivos gestionados
fr: Connectivité MQTT des terminaux gérés
it: Connettività MQTT per i dispositivi gestiti
ja: 管理対象デバイスの MQTT 接続
ko: 관리 디바이스를 위한 MQTT 연결
pt_br: Conectividade de MQTT para Dispositivos Gerenciados
zh_cn: 受管设备的 MQTT 连接
zh_tw: 受管理裝置的 MQTT 連線功能

source: The Device Management Protocol is used for device management communication between the device management agent and the device management server as a part of the Internet of Things Foundation. It is based on MQTT but uses a different set of topics to the regular device messaging protocol used for unmanaged device communication.
de: Das Gerätemanagementprotokoll wird für die Gerätemanagementkommunikation zwischen dem Gerätemanagementagenten und dem Gerätemanagementserver als Bestandteil von Internet of Things Foundation verwendet. Es basiert auf MQTT, verwendet aber eine Themengruppe, die vom regulären Gerätenachrichtenprotkoll abweicht, das für die Kommunikation nicht verwalteter Geräte verwendet wird.
es: El protocolo de gestión de dispositivos se utiliza en la comunicación de gestión de dispositivos entre el agente de gestión de dispositivos y el servidor de gestión de dispositivos como parte de Internet of Things Foundation. Se basa en MQTT, pero utiliza un conjunto de temas distinto del protocolo de mensajería de dispositivos ordinario que se utiliza en las comunicaciones de dispositivos sin gestionar.
fr: Le protocole de gestion des terminaux est utilisé pour la communication de gestion des terminaux entre l'agent de gestion des terminaux et le serveur de gestion des terminaux au sein d'Internet of Things Foundation. Il s'appuie sur MQTT mais utilise un ensemble de sujets différents de celui du protocole de messagerie des terminaux standard utilisé pour la communication des terminaux non gérés.
it: Il protocollo di gestione dispositivo è utilizzato per le comunicazioni di gestione dispositivo tra l'agent di gestione dispositivo e il server di gestione dispositivo come parte di Internet of Things Foundation. Si basa su MQTT ma utilizza un insieme differente di argomenti rispetto al protocollo di messaggistica dispositivo regolare utilizzato per le comunicazioni del dispositivo non gestito.
ja: デバイス管理プロトコルは、Internet of Things Foundation の一部として、デバイス管理エージェントとデバイス管理サーバーの間のデバイス管理通信に使用されます。これは、MQTT に基づいていますが、非管理対象デバイスとの通信に使用される通常のデバイス・メッセージ・プロトコルとは異なるトピックのセットを使用します。
ko: 디바이스 관리 프로토콜이 Internet of Things Foundation의 파트로 디바이스 관리 서버 및 디바이스 관리 에이전트 간의 디바이스 관리 통신에 사용됩니다. 이는 MQTT에 기반하지만 관리되지 않는 디바이스 통신에 사용되는 일반 디바이스 메시징 프로토콜에 대해 다른 주제 세트를 사용합니다.
pt_br: O Protocolo de Gerenciamento de Dispositivo é usado para a comunicação de gerenciamento de dispositivos entre o agente de gerenciamento de dispositivo e o servidor de gerenciamento de dispositivo como parte do Internet of Things Foundation. Ele é baseado em MQTT, mas usa um conjunto diferente de tópicos do que o protocolo de sistema de mensagens do dispositivo usado para a comunicação de dispositivos não gerenciados.
zh_cn: 设备管理协议将作为 Internet of Things Foundation 的一部分，用于设备管理代理程序和设备管理服务器之间的设备管理通信。该协议基于 MQTT，但它使用的主题集不同于用于非受管设备通信的普通设备消息传递协议。
zh_tw: 「裝置管理通訊協定」是 Internet of Things Foundation 的一部分，用於裝置管理代理程式與裝置管理伺服器之間的裝置管理通訊。它以 MQTT 為基礎，但使用了一組與一般裝置傳訊通訊協定（用於未受管理的裝置通訊）不同的主題。

source: The management agent on a device must implement the device management protocol in order to enable management by the Internet of Things Foundation. The management agent may be packaged as an enhanced MQTT client, or written using an MQTT library.
de: Vom Managementagenten eines Geräts muss das Gerätemanagementprotokoll implementiert werden, damit das Management von Internet of Things Foundation ausgeführt werden kann. Der Managementagent kann als erweiterter MQTT-Client gepackt oder mithilfe einer MQTT-Bibliothek geschrieben werden.
es: El agente de gestión de un dispositivo debe implementar el protocolo de gestión de dispositivos para habilitar la gestión por parte de Internet of Things Foundation. El agente de gestión se puede empaquetar como un cliente de MQTT mejorado o escribirse utilizando una biblioteca de MQTT.
fr: L'agent de gestion d'un terminal doit mettre en oeuvre le protocole de gestion des terminaux pour permettre à Internet of Things Foundation d'effectuer des opérations de gestion. L'agent de gestion peut prendre la forme d'un client MQTT amélioré ou d'un bloc de code écrit avec une bibliothèque MQTT.
it: L'agent di gestione su un dispositivo deve implementare il protocollo di gestione dispositivo per poter abilitare la gestione da parte di Internet of Things Foundation. L'agent di gestione può essere assemblato come un client MQTT potenziato o scritto utilizzando una libreria MQTT.
ja: Internet of Things Foundation で管理できるようにするには、デバイス上の管理エージェントがデバイス管理プロトコルを実装している必要があります。管理エージェントは、拡張 MQTT クライアントとしてパッケージされたものもあれば、MQTT ライブラリーを使用して作成されたものもあります。
ko: 디바이스의 관리 에이전트는 Internet of Things Foundation에서 관리를 사용으로 설정하도록 디바이스 관리 프로토콜을 구현해야 합니다. 관리 에이전트는 개선된 MQTT 클라이언트로 패키지되거나 MQTT 라이브러리를 통해 작성될 수 있습니다.
pt_br: O agente de gerenciamento em um dispositivo deve implementar o protocolo de gerenciamento de dispositivo para ativar o gerenciamento do Internet of Things Foundation. O agente de gerenciamento pode ser empacotado como um cliente MQTT aprimorado ou gravado usando uma biblioteca MQTT.
zh_cn: 设备上的管理代理程序必须实施设备管理协议，才能通过 Internet of Things Foundation 进行管理。管理代理程序可以打包为增强版 MQTT 客户机，或使用 MQTT 库进行编写。
zh_tw: 裝置上的管理代理程式必須實作裝置管理通訊協定，才能由 Internet of Things Foundation 啟用管理功能。管理代理程式可能包裝成加強的 MQTT 用戶端，或是使用 MQTT 程式庫來撰寫。

source: MQTT Client Configuration
de: MQTT-Clientkonfiguration
es: Configuración de cliente MQTT
fr: Configuration d'un client MQTT
it: Configurazione client MQTT
ja: MQTT クライアント構成
ko: MQTT 클라이언트 구성
pt_br: Configuração do Cliente MQTT
zh_cn: MQTT 客户机配置
zh_tw: MQTT 用戶端配置

source: Quality of Service Levels and CleanSession
de: Servicequalitätsstufen und CleanSession
es: Niveles de calidad de servicio y CleanSession
fr: Niveaux de qualité de service (QoS) et CleanSession
it: Livelli QoS (Quality of Service) e sessione pulita
ja: サービス品質レベルとクリーン・セッション
ko: 서비스 품질(QoS) 레벨 및 CleanSession
pt_br: Níveis de Qualidade de Serviço e CleanSession
zh_cn: 服务质量级别和 CleanSession
zh_tw: 服務品質等級與 CleanSession

source: Managed devices can publish messages with Quality of Service (QoS) level of 0 or 1. If QoS 1 is used, messages from the device will be queued if necessary. Messages from the device must not be retained messages.
de: Von verwalteten Geräten können Nachrichten der Stufen 0 oder 1 für die Servicequalität (Quality of Service, QoS) publiziert werden. Wenn Servicequalitätsstufe 1 verwendet wird, werden die Nachrichten von dem Gerät bei Bedarf in eine Warteschlange gestellt. Die Nachrichten vom Gerät dürfen nicht aufbewahrte Nachrichten sein.
es: Los dispositivos gestionados pueden publicar mensajes con el nivel de calidad de servicio (QoS) de 0 o 1. Si se utiliza QoS 1, los mensajes del dispositivo se pondrán en cola si es necesario. Los mensajes del dispositivo no debe ser mensajes retenidos.
fr: Les terminaux gérés peuvent publier des messages en utilisant le niveau de qualité de service (QoS) 0 ou 1. Si la qualité de service 0 est utilisée, les messages du terminal sont mis en file d'attente, si nécessaire. Les messages du terminal ne doivent pas être des messages conservés.
it: I dispositivi gestiti possono pubblicare messaggi con un livello di QoS (Quality of Service) pari a 0 o 1. Se viene utilizzato QoS 1, i messaggi dal dispositivo verranno accodati, se necessario. I messaggi dal dispositivo non devono essere messaggi conservati.
ko: 관리 디바이스는 서비스 품질(QoS) 레벨이 0 또는 1인 메시지를 공개할 수 있습니다. QoS 1이 사용되면 필요한 경우 디바이스의 메시지가 큐에 저장됩니다. 디바이스의 메시지가 보관된 메시지가 아니어야 합니다.
pt_br: Os dispositivos gerenciados podem publicar mensagens com níveis de Qualidade de Serviço (QoS) 0 ou 1. Se o QoS 1 for usado, as mensagens do dispositivo serão enfileiradas, se necessário. As mensagens do dispositivo não devem ser mensagens retidas.
zh_cn: 受管设备可以发布服务质量 (QoS) 级别为 0 或 1 的消息。如果使用 QoS 级别 1，那么在必要时会对来自设备的消息进行排队。来自设备的消息不能是保留消息。
zh_tw: 受管理裝置可以發佈服務品質 (QoS) 等級 0 或 1 的訊息。如果使用 QoS 1，則來自裝置的訊息將會置入佇列（必要的話）。來自裝置的訊息不能是保留的訊息。

source: The Internet of Things Foundation publishes requests with a QoS level of 1 to support queuing of messages. In order to queue messages sent while a managed device is not connected, the device should use cleansession=false. Otherwise, cleansession=true should be used.
de: Von Internet of Things Foundation werden Anforderungen mit Servicequalitätsstufe 1 zur Unterstützung der Warteschlangensteuerung für die Nachrichten unterstützt. Damit Nachrichten, die gesendet wurden, während ein verwaltetes Gerät nicht verbunden war, in die Warteschlange gestellt werden, muss von dem Gerät 'cleansession=false' verwendet werden. Andernfalls muss 'cleansession=true' verwendet werden.
es: Internet of Things Foundation publica solicitudes con un nivel QoS de 1 para admitir la puesta en cola de los mensajes. Para poner en cola los mensajes mientras no está conectado un dispositivo gestionado, este debe utilizar cleansession=false. En caso contrario, debe utilizarse cleansession=true.
fr: Internet of Things Foundation publie des demandes en utilisant le niveau de qualité de service 1 pour prendre en charge la mise en file d'attente des messages. Pour mettre en file d'attente les messages envoyés lorsqu'un terminal géré n'est pas connecté, le terminal doit utiliser cleansession=false. Sinon, cleansession=true doit être utilisé.
it: Internet of Things Foundation pubblica richieste con un livello QoS 1 per supportare l'accodamento dei messaggi. Al fine di accodare i messaggi inviati mentre un dispositivo gestito non è connesso, il dispositivo deve utilizzare cleansession=false. In caso contrario, deve essere utilizzato cleansession=true.
ko: Internet of Things Foundation이 QoS 레벨 1인 요청을 공개하여 메시지의 큐 저장을 지원합니다. 관리 디바이스가 연결되지 않는 동안 전송된 메시지를 큐에 저장하려면 디바이스가 cleansession=false를 사용해야 합니다. 그렇지 않으면, cleansession=true를 사용해야 합니다.
pt_br: O Internet of Things Foundation publica solicitações com um QoS 1 para suportar o enfileiramento de mensagens. Para enfileirar as mensagens enviadas enquanto um dispositivo gerenciado não está conectado, o dispositivo deve usar cleansession=false. Caso contrário, deve-se utilizar cleansession=true.
zh_cn: Internet of Things Foundation 可发布 QoS 级别为 1 的请求以支持消息排队。要在未连接受管设备的情况下让发送的消息排队，该设备应使用 cleansession=false。否则，应使用 cleansession=true。
zh_tw: Internet of Things Foundation 會發佈 QoS 等級為 1 的要求，以支援將訊息置入佇列。若要將受管理裝置未連接時傳送的訊息置入佇列，該裝置應該使用 cleansession=false。否則，應該使用 cleansession=true。

source: Topics
de: Themen
es: Temas
fr: Sujets
it: Argomenti
ja: トピック
ko: 주제
pt_br: Tópicos
zh_cn: 主题
zh_tw: 主題

source: Messages can originate from the Internet of Things Foundation or from the device.
de: Nachrichten können von Internet of Things Foundation oder von einem Gerät stammen.
es: Los mensajes se pueden originar desde Internet of Things Foundation o desde el dispositivo.
fr: Les messages peuvent provenir d'Internet of Things Foundation ou du terminal.
it: I messaggi possono provenire da Internet of Things Foundation o dal dispositivo.
ja: メッセージは Internet of Things Foundation またはデバイスから発信できます。
ko: 메시지가 Internet of Things Foundation 또는 디바이스에서 시작될 수 있습니다.
pt_br: As mensagens podem se originar a partir do Internet of Things Foundation ou do dispositivo.
zh_cn: 消息可以来自 Internet of Things Foundation 或设备。
zh_tw: 訊息可以源自 Internet of Things Foundation 或裝置。

source: Messages originating from the device are published to topics with the prefix 'iotdevice-1' in the form:
de: Nachrichten, die von einem Gerät stammen, werden für Themen mit dem Präfix 'iotdevice-1' im folgenden Format publiziert:
es: Los mensajes que se originan desde el dispositivo se publican en temas con el prefijo 'iotdevice-1' y el formato:
fr: Les messages provenant du terminal sont publiés dans des sujets avec le préfixe 'iotdevice-1' sous la forme suivante :
it: I messaggi che provengono dal dispositivo sono pubblicati su argomenti con il prefisso 'iotdevice-1' nel modulo:
ja: デバイスから発信されるメッセージは、接頭部 'iotdevice-1' が付いた以下の形式でトピックにパブリッシュされます。
ko: 디바이스에서 시작되는 메시지는 양식에서 'iotdevice-1' 접두부와 함께 주제에 공개됩니다.
pt_br: As mensagens originadas a partir do dispositivo são publicadas para tópicos com o prefixo 'iotdevice-1' no formato:
zh_cn: 来自设备的消息将发布到具有“iotdevice-1”前缀且采用以下格式的主题中：
zh_tw: 源自裝置的訊息會發佈至主題，其字首為 'iotdevice-1' 且格式如下：

source: Responses from the Internet of Things Foundation will be published to:
de: Antworten von Internet of Things Foundation werden publiziert für:
es: Las respuestas de Internet of Things Foundation se publicarán en:
fr: Les réponses d'Internet of Things Foundation sont publiées dans :
it: Le risposte da Internet of Things Foundation verranno pubblicate in:
ja: Internet of Things Foundation からの応答は以下にパブリッシュされます。
ko: Internet of Things Foundation의 응답이 다음에 공개됩니다.
pt_br: As respostas do Internet of Things Foundation serão publicadas em:
zh_cn: 来自 Internet of Things Foundation 的响应将发布到：
zh_tw: 來自 Internet of Things Foundation 的回應會發佈至：

source: Messages originating from the Internet of Things Foundation are published to topics with the prefix 'iotdm-1' in the form:
de: Nachrichten, die von Internet of Things Foundation stammen, werden für Themen mit dem Präfix 'iotdm-1' im folgenden Format publiziert:
es: Los mensajes que se originan desde Internet of Things Foundation se publican en temas con el prefijo 'iotdm-1' y el formato:
fr: Les messages provenant d'Internet of Things Foundation sont publiés dans des sujets avec le préfixe 'iotdm-1' sous la forme suivante :
it: I messaggi che provengono da Internet of Things Foundation sono pubblicati su argomenti con il prefisso 'iotdm-1' nel modulo:
ja: Internet of Things Foundation から発信されるメッセージは、接頭部 'iotdm-1' が付いた以下の形式でトピックにパブリッシュされます。
ko: Internet of Things Foundation에서 시작되는 메시지는 양식에서 'iotdm-1' 접두부와 함께 주제에 공개됩니다.
pt_br: As mensagens originadas a partir do Internet of Things Foundation são publicadas para tópicos com o prefixo 'iotdm-1' no formato:
zh_cn: 来自 Internet of Things Foundation 的消息将发布到具有“iotdm-1”前缀且采用以下格式的主题中：
zh_tw: 源自 Internet of Things Foundation 的訊息會發佈至主題，其字首為 'iotdm-1' 且格式如下：

source: Responses from the device must be published to:
de: Antworten von dem Gerät müssen wie folgt publiziert werden:
es: Las respuestas procedentes del dispositivo se deben publicar en:
fr: Les réponses du terminal doivent être publiées dans :
it: Le risposte dal dispositivo devono essere pubblicate in:
ja: デバイスからの応答は以下にパブリッシュされる必要があります。
ko: 디바이스의 응답이 다음에 공개되어야 합니다.
pt_br: As respostas do dispositivo devem ser publicadas para:
zh_cn: 设备中的响应必须发布到：
zh_tw: 來自裝置的回應必須發佈至：

source: Message Format
de: Nachrichtenformat
es: Formato del mensaje
fr: Format du message
it: Formato messaggio
ja: メッセージの形式
ko: 메시지 형식
pt_br: Formato da Mensagem
zh_cn: 消息格式
zh_tw: 訊息格式

source: All messages are sent in JSON format over MQTT. There are two types of message.
de: Alle Nachrichten werden im JSON-Format über MQTT gesendet. Es gibt zwei Arten von Nachrichten.
es: Todos los mensajes se envían en formato JSON sobre MQTT. Hay dos tipos de mensaje.
fr: Tous les messages sont envoyés dans le format JSON via MQTT. Il existe deux types de message.
it: Tutti i messaggi vengono inviati in formato JSON su MQTT. Ci sono due tipi di messaggio.
ja: すべてのメッセージは MQTT によって JSON 形式で送信されます。メッセージには 2 つのタイプがあります。
ko: 모든 메시지가 MQTT를 통해 JSON 형식으로 전송됩니다. 2개 유형의 메시지가 있습니다.
pt_br: Todas as mensagens são enviadas no formato JSON em MQTT. Existem dois tipos de mensagens.
zh_cn: 所有消息都通过 MQTT 以 JSON 格式进行发送。有两种类型的消息。
zh_tw: 所有訊息都會以 JSON 格式透過 MQTT 傳送。共有兩種類型的訊息。

source: Requests.
de: Anforderungen.
es: Solicitudes.
fr: Des demandes.
it: Richieste.
ja: リクエスト。
ko: 요청입니다.
pt_br: Solicitações.
zh_cn: 请求。
zh_tw: 要求。

source: Requests are formatted as follows:
de: Anforderungen werden wie folgt formatiert:
es: Debe aplicarse el siguiente formato a las solicitudes:
fr: Les demandes sont formatées de la manière suivante :
it: Le richieste vengono formattate come segue:
ja: リクエストのフォーマットは以下のとおりです。
ko: 요청은 다음과 같이 형식화됩니다.
pt_br: As solicitações são formatadas da seguinte maneira:
zh_cn: 请求的格式如下：
zh_tw: 要求的格式如下：

source: These messages must include two JSON elements, "d" and "reqId". The "d" field carries the data relevant to the request, and the "reqId" field is an identifier of the request, and must be copied into a response. If a response is not required, the field should be omitted.
de: Diese Nachrichten müssen die zwei JSON-Element "d" und "reqId" enthalten. Im Feld "d" werden die Daten angegeben, die für die Anforderung relevant sind, das Feld "reqId" enthält die Kennung der Anfrage; sie muss in die Antwort kopiert werden. Wenn keine Antwort erforderlich ist, muss das Feld weggelassen werden.
es: Estos mensajes deben incluir dos elementos de JSON, "d" y "reqId". El campo "d" transporta los datos pertinentes a la solicitud y el campo "reqId" es un identificador de la solicitud y debe copiarse en una respuesta. Si no se necesita una respuesta, este campo debe omitirse.
fr: Ces messages doivent inclure deux éléments JSON, "d" et "reqId". La zone "d" contient les données applicables à la demande et la zone "reqId" est un identificateur de la demande qui doit être copié dans une réponse. Si aucune réponse n'est requise, la zone doit être omise.
it: Questi messaggi devono comprendere due elementi JSON, "d" e "reqId". Il campo "d" include i dati relativi alla richiesta e il campo "reqId" è un identificativo della richiesta e deve essere copiato in una risposta. Se non è richiesta una risposta, il campo deve essere omesso.
ja: リクエストのメッセージには 2 つの JSON 要素、"d" および "reqId" を含める必要があります。"d" フィールドは、リクエストに関連するデータを渡します。"reqId" フィールドは、リクエストの ID であり、応答にコピーする必要があります。応答が不要な場合は、このフィールドを省略する必要があります。
ko: 이러한 메시지에는 2개의 JSON 요소인 "d" 및 "reqId"가 포함되어야 합니다. "d" 필드는 요청과 관련한 데이터를 운반하고, "reqId" 필드는 요청의 ID이며 응답에 복사되어야 합니다. 응답이 필요하지 않은 경우 필드를 생략해야 합니다.
pt_br: Estas mensagens devem incluir dois elementos JSON, "d" e "reqId". O campo "d" transporta os dados relevantes para a solicitação e o campo "reqId" é um identificador da solicitação e deve ser copiado em uma resposta. Caso não seja necessário fornecer uma resposta, o campo deve ser omitido.
zh_cn: 这些消息必须包含以下两个 JSON 元素：“d”和“reqId”。“d”字段中存放与请求相关的数据，“reqId”字段是请求的标识并且必须复制到响应中。如果不需要响应，那么应省略此字段。
zh_tw: 這些訊息必須包括兩個 JSON 元素："d" 及 "reqId"。"d" 欄位帶有與要求相關的資料，而 "reqId" 欄位則是要求的 ID，且必須複製到回應中。如果不需要回應，則應該省略該欄位。

source: Response.
de: Antwort.
es: Respuesta.
fr: La réponse.
it: Risposta.
ja: 応答。
ko: 응답입니다.
pt_br: Resposta.
zh_cn: 响应。
zh_tw: 回應。

source: Responses are formatted as follows:
de: Antworten werden wie folgt formatiert:
es: Debe aplicarse el siguiente formato a las respuestas:
fr: Les réponses sont formatées de la manière suivante :
it: Le risposte vengono formattate come segue:
ja: 応答のフォーマットは以下のとおりです。
ko: 응답은 다음과 같이 형식화됩니다.
pt_br: As respostas são formatadas da seguinte maneira:
zh_cn: 响应的格式如下：
zh_tw: 回應的格式如下：

source: These messages can include four JSON elements: "rc", "message", "d", and "reqId". The "rc" field is a result code of the original request, the "message" field is an optional field with a text description of the response code, "d" is a data field accompanying the response, if necessary, and "reqId" is the request ID of the original request. The "reqId" field is used to correlate responses with requests, and the device needs to ensure that all request IDs are unique.
de: Diese Nachrichten können vier JSON-Elemente enthalten: "rc", "message", "d" und "reqId". Das Feld "rc" ist der Ergebniscode der ursprünglichen Anforderung, das Feld "message" ist ein optionales Feld mit einer Textbeschreibung des Antwortcodes, "d" ist eine Datenfeld, in dem die Ursachen angegeben werden und "reqId" ist die Anforderungs-ID der ursprünglichen Anforderung. Das Feld "reqId" wird zum Korrelieren der Antworten mit den Anforderungen verwendet; von dem Gerät muss sichergestellt werden, dass alle Anforderungs-IDs eindeutig sind.
es: Estos mensajes pueden incluir cuatro elementos JSON: "rc", "message", "d" y "reqId". El campo "rc" es un código de resultado de la solicitud original, el campo "message" es un campo opcional con una descripción de texto del código de respuesta, "d" es un campo de datos que acompaña a la respuesta, si es necesario, y "reqId" es el ID de la solicitud original. El campo "reqId" se utiliza para correlacionar las respuestas con las solicitudes y el dispositivo necesita asegurarse de que todos los ID de solicitud sean exclusivos.
fr: Ces messages peuvent inclure quatre éléments JSON : "rc", "message", "d" et "reqId". La zone "rc" représente le code de résultat de la demande d'origine, la zone "message" est une zone facultative contenant un texte de description du code de réponse, la zone "d" est une zone de données accompagnant la réponse, si nécessaire, et la zone "reqId" est l'ID de la demande d'origine. La zone "reqId" est utilisée pour corréler des réponses à des demandes. Le terminal doit s'assurer que tous les ID demande sont uniques.
it: Questi messaggi possono includere quattro elementi JSON: "rc", "message", "d" e "reqId". Il campo "rc" è un codice di risultato della richiesta originale, il campo "message" è un campo facoltativo con una descrizione di testo del codice di risposta, "d" è un campo dati che accompagna la risposta, se necessario, e "reqId" è l'ID richiesta della richiesta originale. Il campo "reqId" viene utilizzato per correlare le risposte con le richieste e il dispositivo deve assicurare che tutti gli ID richiesta siano univoci.
ja: 応答のメッセージには、4 つの JSON 要素、"rc"、"message"、"d"、および "reqId" を含めることができます。"rc" フィールドは元のリクエストの結果コード、"message" フィールドは応答コードを説明するテキストを含むオプションのフィールド、"d" は応答に付随するデータ・フィールド、"reqId" は元のリクエストのリクエスト ID です。"reqId" フィールドによって応答をリクエストと相関させることができるため、デバイスですべてのリクエスト ID が固有になるようにする必要があります。
ko: 이러한 메시지에는 4개의 JSON 요소인 "rc", "message", "d" 및 "reqId"가 포함될 수 있습니다. "rc" 필드는 기존 요청의 결과 코드이고 "message" 필드는 응답 코드의 텍스트 설명이 포함된 선택적 필드이며 "d"는 필요한 경우 응답을 수반하는 데이터 필드이고 "reqId"는 기존 요청의 요청 ID입니다. "reqId" 필드는 응답을 요청과 상관시키는 데 사용되고, 디바이스에서 모든 요청 ID가 고유하다고 확인해야 합니다.
pt_br: Estas mensagens podem incluir quatro elementos JSON: "rc", "message", "d" e "reqId". O campo "rc" é um código de resultado da solicitação original, o campo "message" é um campo opcional com uma descrição de texto do código de resposta , "d" é um campo de dados que acompanha a resposta, se necessário, e "reqId" é o ID de solicitação da solicitação original. O campo "reqId" é usado para correlacionar respostas com solicitações e o dispositivo deve assegurar que todos os IDs de solicitação sejam exclusivos.
zh_cn: 这些消息可以包含以下四个 JSON 元素：“rc”、“message”、“d”和“reqId”。“rc”字段是原始请求的结果代码，“message”字段是包含响应代码文本描述的可选字段，“d”是响应随附的数据字段（如果需要），而“reqId”是原始请求的请求标识。“reqId”字段用于将响应与请求联系在一起，因此设备需要确保所有请求标识都是唯一的。
zh_tw: 這些訊息可以包括四個 JSON 元素: "rc"、"message"、"d" 及 "reqId"。"rc" 欄位是原始要求的結果碼，"message" 欄位是選用欄位，含有回應碼的文字說明，"d" 是附帶回應的資料欄位（必要的話），而 "reqId" 是原始要求的要求 ID。"reqId" 欄位用來建立回應與要求的關聯，且裝置需要確定所有要求 ID 都是唯一的。
