Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/messaging/managed_devices.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: When responding to Internet of Things Foundation requests, the correct "reqId" value must be sent in the response.
de: Bei Antworten auf Anforderungen von Internet of Things Foundation muss der korrekte Wert für "reqId" in der Antwort gesendet werden.
es: Cuando se responde a las solicitudes de Internet of Things Foundation, el valor "reqId" correcto debe enviarse en la respuesta.
fr: Dans le cas d'une réponse à des demandes Internet of Things Foundation, la valeur "reqId" correcte doit être envoyée dans la réponse.
it: Quando si risponde alle richieste Internet of Things Foundation, nella risposta deve essere inviato il valore "reqId" corretto.
ja: Internet of Things Foundation のリクエストに応答する際には、正しい "reqId" 値を応答に含めて送信する必要があります。
ko: Internet of Things Foundation 요청에 응답하는 경우 올바른 "reqId" 값이 응답으로 전송되어야 합니다.
pt_br: Ao responder às solicitações do Internet of Things Foundation, deve-se enviar o valor correto de "reqId" na resposta.
zh_cn: 响应 Internet of Things Foundation 请求时，必须在响应中发送正确的“reqId”值。
zh_tw: 在回應 Internet of Things Foundation 要求時，必須在回應中傳送正確的 "reqId" 值。

source: Devices can publish messages with Quality of Service (QoS) level of 0 or 1. If QoS 1 is used, messages from the device will be queued if necessary. Messages from the device must not be retained messages.
ja: デバイスは、サービス品質 (QoS) レベルが 0 または 1 のメッセージをパブリッシュできます。QoS 1 を使用する場合、デバイスからのメッセージは必要に応じてキューに入れられます。デバイスからのメッセージは、保存メッセージにしないでください。

source: The Internet of Things Foundation publishes requests with a QoS level of 1 to support queuing of messages. In order to queue messages sent while a device is not connected, the device should use cleansession=false. Otherwise, cleansession=true should be used.
ja: Internet of Things Foundation は、メッセージのキューイングをサポートするために QoS レベル 1 でリクエストをパブリッシュします。デバイスが接続されていないときに送信されたメッセージをキューに入れる場合は、デバイスで cleansession=false を使用する必要があります。そうでない場合は、cleansession=true を使用してください。
