Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/messaging/mqtt.po
Languages: es, fr, ko, pt_br

source: The primary mechanism that devices and applications use to communicate with the IBM Internet of Things Foundation is MQTT; this is a protocol designed for the efficient exchange of real-time data with sensor and mobile devices.
es: El mecanismo principal que los dispositivos y las aplicaciones utilizan para comunicarse con IBM Internet of Things Foundation es MQTT; este es un protocolo diseñado para el intercambio eficiente de datos en tiempo real con dispositivos de sensor y móviles.
fr: MQTT est le mécanisme principal que les terminaux et les applications utilisent pour communiquer avec IBM Internet of Things Foundation ; ce protocole est conçu pour assurer l'échange efficace de données en temps réel avec des capteurs et des terminaux mobiles.
ko: 디바이스와 애플리케이션이 IBM Internet of Things Foundation과 통신하는 데 사용하는 기본 메커니즘은 MQTT입니다. MQTT는 실시간 데이터와 센서 및 모바일 디바이스의 효율적인 교환을 위해 설계된 프로토콜입니다.
pt_br: O mecanismo primário que os dispositivos e os aplicativos usam para se comunicar com o IBM Internet of Things Foundation é o MQTT; este é um protocolo designado para a troca eficiente de dados em tempo real com sensor e dispositivos móveis.

source: MQTT runs over TCP/IP and, while it is possible to code directly to TCP/IP, you might prefer to use a library that handles the details of the MQTT protocol for you. You will find there's a wide range of MQTT client libraries available at mqtt.org_, with the best place to start looking being the `Eclipse Paho project`_. IBM contributes to the development and support of many of these libraries.
es: MQTT se ejecuta sobre TCP/IP y, mientras que es posible codificar directamente en TCP/IP, es posible que prefiera utilizar una biblioteca que maneje automáticamente los detalles del protocolo MQTT. Encontrará que existe una amplia gama de bibliotecas de cliente MQTT disponibles en mqtt.org_, donde el mejor lugar para empezar a mirar es `Proyecto de Eclipse Paho`_. IBM contribuye al desarrollo y soporte de muchas de estas bibliotecas.
fr: MQTT s'exécute sur TCP/IP et, même si vous pouvez coder directement les données dans TCP/IP, vous préférez peut-être utiliser une bibliothèque qui traite les informations du protocole pour vous. Un grand nombre de bibliothèques client MQTT sont disponibles sur le site mqtt.org_ et il est recommandé de visiter en priorité le site `Eclipse Paho project`_. IBM participe au développement et au support technique d'un grand nombre de ces bibliothèques.
ko: MQTT는 TCP/IP 위에서 실행되며 TCP/IP에 직접 코딩할 수 있지만 사용자는 MQTT 프로토콜의 세부사항을 처리하는 라이브러리의 사용을 선호할 수 있습니다. 사용 가능한 광범위한 MQTT 클라이언트 라이브러리가 mqtt.org에 있으며 `Eclipse Paho 프로젝트`에서 검색을 시작하는 것이 가장 좋습니다. IBM은 이 라이브러리 중 다수의 개발 및 지원에 기여합니다.
pt_br: MQTT é executado sobre TCP/IP e, enquanto é possível codificar diretamente para TCP/IP, você pode preferir usar uma biblioteca que manipule os detalhes do protocolo MQTT para você. Você descobrirá que há um amplo intervalo de bibliotecas de clientes MQTT disponíveis em mqtt.org_, com o melhor local para começar a olhar sendo o `Eclipse Paho project`_. A IBM contribui para o desenvolvimento e suporte de muitas dessas bibliotecas.

source: MQTT 3.1 is the version of the protocol that is in widest use today. Version 3.1.1 contains a number of minor enhancements, and has been ratified as an OASIS Standard.
es: MQTT 3.1 es la versión del protocolo que más se utiliza en la actualidad. La Versión 3.1.1 contiene varias mejoras menores y se ha ratificado como estándar de OASIS.
fr: MQTT 3.1 est la version du protocole la plus couramment utilisée aujourd'hui. La version 3.1.1 inclut un certain nombre d'améliorations mineures et a été validée en tant que norme OASIS.
ko: MQTT 3.1은 오늘날 가장 광범위하게 사용되는 프로토콜의 버전입니다. 버전 3.1.1은 다수의 사소한 개선사항을 포함하고 있으며 OASIS 표준으로 승인되었습니다.
pt_br: MQTT 3.1 é a versão do protocolo mais amplamente usada hoje. A Versão 3.1.1 contém vários aprimoramentos menores e foi ratificada como um Padrão OASIS.

source: One reason for using version 3.1.1 is that the maximum length of the MQTT Client Identifier (ClientId) is increased from the 23 character limit imposed by 3.1. The IoT service will often require longer ClientId's and will accept long ClientId's with either version of the protocol however some 3.1 client libraries check the ClientId and enforce the 23 character limit.
es: Una razón para utilizar la versión 3.1.1 es que la longitud máxima del identificador de cliente MQTT (ClientId) se ha incrementado respecto al límite de 23 caracteres impuesto por la 3.1. El servicio IoT necesitará normalmente ID de cliente más largos y aceptará los ID de cliente largos con cualquiera de las versiones del protocolo; no obstante algunas bibliotecas de cliente 3.1 comprueba el ID de cliente e imponen el límite de 23 caracteres.
fr: L'une des raisons justifiant l'utilisation de la version 3.1.1 est l'augmentation du nombre maximal de caractères de l'identificateur du client MQTT (ClientId), qui était limité à 23 caractères dans la version 3.1. Le service IoT (internet des objets) requiert souvent des ID client plus longs et accepte les ID client longs avec les deux versions du protocole. Toutefois, certaines bibliothèques client de la version 3.1 vérifient l'ID client et applique la valeur maximale de 23 caractères.
ko: 버전 3.1.1을 사용하는 한 가지 이유는 MQTT 클라이언트 ID(ClientId)의 최대 길이가 3.1의 제한인 23자보다 길어졌다는 점입니다. IoT 서비스는 더 긴 ClientId를 요구하는 경우가 종종 있으며 두 버전의 프로토콜에 대해 긴 ClientId를 승인하지만 일부 3.1 클라이언트 라이브러리는 ClientId를 확인하여 23자 제한을 적용합니다.
pt_br: Uma razão para usar a versão 3.1.1 é que o comprimento máximo do Identificador de Cliente MQTT (ClientId) é aumentado do limite de 23 caracteres imposto pela 3.1. O serviço IoT exigirá frequentemente ClientId mais longo e aceitará ClientId longo com qualquer versão do protocolo, no entanto, algumas bibliotecas do cliente 3.1 verificam o ClientId e forçam o limite de 23 caracteres.

source: MQTT client connection
es: Conexión de cliente MQTT
fr: Connexion client MQTT
ko: MQTT 클라이언트 연결
pt_br: Conexão do cliente MQTT

source: Every registered organization has a unique endpoint which must be used when connecting MQTT clients for applications and devices in that organization.
es: Cada organización registrada tiene un punto final exclusivo que se debe utilizar al conectar clientes MQTT para aplicaciones y dispositivos de dicha organización.
fr: Chaque organisation enregistrée possède un noeud final unique qui doit être utilisé lors de la connexion des clients MQTT pour les applications et les terminaux de cette organisation.
ko: 등록된 모든 조직은 해당 조직의 애플리케이션 및 디바이스를 위해 MQTT 클라이언트를 연결할 때 사용해야 하는 고유 엔드포인트를 가지고 있습니다.
pt_br: Toda organização registrada possui um terminal exclusivo que deve ser usado ao conectar clientes MQTT para aplicativos e dispositivos nessa organização.

source: Unencrypted client connection
es: Conexión de cliente no cifrada
fr: Connexion client non chiffrée
ko: 암호화되지 않은 클라이언트 연결
pt_br: Conexão do cliente não criptografada

source: Connect on port **1883**
es: Conectar en el puerto **1883**
fr: Connexion sur le port **1883**
ko: 포트 **1883**에서 연결
pt_br: Conectar à porta **1883**

source: All information your device submits is being sent in plain text (including the authentication credentials for your device). We recommend the use of an encrypted connection whenever possible.
es: Toda la información que el dispositivo somete se está enviando en texto sin formato (incluidas las credenciales de autenticación para el dispositivo). Siempre que sea posible, recomendamos el uso de una conexión cifrada.
fr: Toutes les informations soumises par votre terminal sont envoyées sous la forme d'un texte en clair (y compris les données d'authentification du terminal). Il est recommandé d'utiliser une connexion chiffrée dans la mesure du possible.
ko: 디바이스가 제출하는 모든 정보는 일반 텍스트로 전송됩니다(디바이스에 대한 인증 신임 정보 포함). 가능할 때마다 암호화된 연결을 사용하는 것이 좋습니다.
pt_br: Todas as informações que seu dispositivo envia estão sendo enviadas em texto simples (incluindo as credenciais de autenticação para seu dispositivo). Recomendamos o uso de uma conexão criptografada sempre que possível.

source: Encrypted client connection
es: Conexión de cliente cifrada
fr: Connexion client chiffrée
ko: 암호화된 클라이언트 연결
pt_br: Conexão do cliente criptografada

source: Connect on port **8883** or **443** for websockets.
es: Conectarse en el puerto **8883** o **443** para sockets web.
fr: Connexion sur le port **8883** ou **443** pour les websockets.
ko: 웹 소켓을 위해 포트 **8883** 또는 **443**에서 연결합니다.
pt_br: Conectar à porta **8883** ou **443** para websockets.

source: In many client libraries you will need to provide the server's public certificate in pem format. The following file contains the entire certificate chain for \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
es: En muchas bibliotecas de cliente necesitará proporcionar el certificado público del servidor en formato pem. El archivo siguiente contiene la cadena de certificados entera para \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
fr: Dans la plupart des bibliothèques client, vous devez fournir le certificat public du serveur au format pem. Le fichier suivant contient l'ensemble de la chaîne de certificats de \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
ko: 다수의 클라이언트 라이브러리에서 사용자는 pem 형식으로 서버의 공용 인증서를 제공해야 합니다. 다음 파일에는 \*.messaging.internetofthings.ibmcloud.com: messaging.pem에 대한 전체 인증서 체인이 포함되어 있습니다.
pt_br: Em muitas bibliotecas de clientes, você precisará fornecer um certificado público do servidor no formato pem. O arquivo a seguir contém a sequência de certificados inteira para \*.messaging.internetofthings.ibmcloud.com: messaging.pem_

source: Some SSL client libraries have been shown to not handle wildcarded domains, in which case, if you can not change libraries, you will need to turn off certificate checking.
es: Se ha mostrado que algunas bibliotecas de cliente SSL no manejan dominios con caracteres comodín, en cuyo caso, si no puede cambiar las bibliotecas, necesitará desactivar la comprobación de certificados.
fr: Certaines bibliothèques client SSL ne traitent pas correctement les domaines associés à des caractères génériques. Dans ce cas, si vous ne pouvez pas changer de bibliothèques, vous devez désactiver la vérification des certificats.
ko: 일부 SSL 클라이언트 라이브러리는 와일드카드 도메인을 처리하지 않는 것으로 표시되었으며 이 경우 라이브러리를 변경할 수 없으면 인증서 확인을 꺼야 합니다.
pt_br: Algumas bibliotecas do cliente SSL demonstraram não manipular domínios com caractere curinga; neste caso, se você não puder mudar as bibliotecas, será necessário desativar a verificação de certificados.

source: The IoT Foundation requires TLS v1.2. We suggest the following cipher suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 or AES128-GCM-SHA256 *(as of Jun 1 2015)*.
es: IoT Foundation requiere TLS v1.2. Sugerimos las siguientes suites de cifrado: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 o AES128-GCM-SHA256 *(a partir del 1 de junio de 2015)*.
fr: IoT Foundation requiert TLS version 1.2. Il est recommandé d'utiliser les suites de chiffrement suivantes : ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 ou AES128-GCM-SHA256 *(à compter du 1er juin 2015)*.
ko: IoT Foundation에서는 TLS v1.2를 요구합니다. ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 또는 AES128-GCM-SHA256 암호 스위트를 추천합니다. *(2015년 1월 1일 현재)*
pt_br: O IoT Foundation requer TLS v1.2. Sugerimos os seguintes conjuntos de cifras: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 ou AES128-GCM-SHA256 *(a partir de 1 de junho de 2015)*.

source: Device and application clients
es: Clientes de dispositivos y aplicaciones
fr: Clients de terminal et d'application
ko: 디바이스 및 애플리케이션 클라이언트
pt_br: Clientes de dispositivo e de aplicativo

source: We define two primary classes of thing: Devices & Applications
es: Se definen dos clases principales de objetos: dispositivos y aplicaciones
fr: Deux grandes classes d'objets sont définies : Terminaux et Applications
ko: 디바이스와 애플리케이션이라는 사물의 두 가지 기본 클래스를 정의함
pt_br: Nós definimos duas classes primárias de coisas: Dispositivos e Aplicativos

source: The class of thing that your MQTT client identifies itself to the service as will determine the capabilities of your client once connected as well as the mechanism through which you will need to authenticate.
es: La clase de objeto con el que el cliente MQTT se identifica a sí mismo en el servicio determinará las prestaciones del cliente una vez conectado así como el mecanismo mediante el cual necesitará autenticarse.
fr: La classe d'objets avec laquelle le client MQTT s'identifie auprès du service détermine les fonctionnalités dont disposent votre client après sa connexion, ainsi que le mécanisme avec lequel vous devez vous authentifier.
ko: 인증을 수행하는 데 사용해야 하는 메커니즘과 연결된 이후 클라이언트의 기능을 판별할 때처럼 MQTT 클라이언트가 서비스에 대해 자신을 식별하는 사물의 클래스입니다.
pt_br: A classe de coisa que seu cliente MQTT se identifica para o serviço irá determinar os recursos do cliente depois de conectado e também o mecanismo pelo qual você precisará se autenticar.

source: Applications and devices also work with different MQTT topic spaces. Devices work within a device-scoped topic space, whereas applications have full access to the topic space for an entire organization.
es: Las aplicaciones y los dispositivos también funcionan con espacios de tema MQTT diferentes. Los dispositivos funcionan en un espacio de tema de ámbito de dispositivo, mientras que las aplicaciones tienen acceso completo al espacio de tema para una organización entera.
fr: Les applications et les terminaux fonctionnent avec des espaces de sujet MQTT différents. Les terminaux fonctionnent dans un espace de sujet délimité pour les terminaux alors que les applications disposent d'un accès complet à l'espace de sujet de l'ensemble de l'organisation.
ko: 애플리케이션과 디바이스는 다양한 MQTT 주제 공간에 대해서도 작업합니다. 디바이스는 디바이스 범위 주제 공간 내에서 작업하지만 애플리케이션은 전체 조직에 대한 주제 공간에 대한 전체 액세스를 가집니다.
pt_br: Os aplicativos e dispositivos também funcionam com diferentes espaços de tópicos MQTT. Os dispositivos funcionam dentro de um espaço de tópico com escopo do dispositivo, enquanto os aplicativos têm acesso total ao espaço de tópico para uma organização inteira.

source: :doc:`devices`
ko: :문서:`디바이스`

source: :doc:`applications`
ko: :문서:`애플리케이션`

source: Quality of service
es: Calidad de servicio
fr: Qualité de service
ko: 서비스 품질(QoS)
pt_br: Qualidade de serviço

source: The MQTT protocol provides three qualities of service for delivering messages between clients and servers: "at most once", "at least once" and "exactly once". Events and commands can be sent using any quality of service level, however you should carefully consider whether what the right level is for your needs. It is not a simple case that QoS2 is "better" than QoS0.
es: El protocolo MQTT proporciona tres calidades de servicio para la entrega de mensajes entre clientes y servidores: "como máximo una vez", "al menos una vez" y "exactamente una vez". Los sucesos y mandatos se pueden enviar utilizando cualquier nivel de calidad de servicio, sin embargo deberá considerar detenidamente si el nivel es el correcto para sus necesidades. No es tan sencillo que QoS2 sea "mejor" que QoS0.
fr: Le protocole MQTT fournit trois qualités de service pour la distribution de messages entre les clients et les serveurs : "une fois tout au plus", "au moins une fois" et "une fois exactement". Vous pouvez envoyer des événements et des commandes en utilisant n'importe quel niveau de qualité de service. Toutefois, vous devez identifier minutieusement le niveau adapté à vos besoins. Le niveau de qualité de service QoS2 n'est n'est pas forcément "meilleur" que le niveau de qualité de service QoS0.
ko: MQTT 프로토콜은 클라이언트와 서버 간 메시지 전달을 위해 세 가지 서비스 품질(QoS)을 제공합니다("한 번 이하", "한 번 이상", "정확하게 한 번"). 이벤트 및 명령은 모든 서비스 품질(QoS) 레벨을 사용하여 전송할 수 있지만 요구에 맞는 올바른 레벨이 무엇인지 주의해서 고려해야 합니다. QoS2가 QoS0보다 "낫다"는 단순한 케이스가 아닙니다.
pt_br: O protocolo MQTT fornece três qualidades de serviço para entrega de mensagens entre clientes e servidores: "at most once", "at least once" e "exactly once". Eventos e comandos podem ser enviados usando qualquer nível de qualidade de serviço, no entanto, deve-se considerar cuidadosamente se o nível correto atende às suas necessidades. Não é um caso simples que QoS2 é "better" que QoS0.

source: At most once (QoS0)
es: Como máximo una vez (QoS0)
fr: Une fois tout au plus (QoS0)
ko: 한 번 이하(QoS0)
pt_br: No máximo uma vez (QoS0)

source: The message is delivered at most once, or it might not be delivered at all. Delivery across the network is not acknowledged, and the message is not stored. The message could be lost if the client is disconnected, or if the server fails. QoS0 is the fastest mode of transfer. It is sometimes called "fire and forget".
es: El mensaje se entrega como máximo una vez, o puede no entregarse en absoluto. La entrega a través de la red no se confirma y el mensaje no se almacena. El mensaje podrían perderse si el cliente está desconectado, o si el servidor falla. QoS0 es la modalidad de transferencia más rápida. En algunas ocasiones se denomina "fire and forget".
fr: Le message est distribué une fois tout au plus et il est possible qu'il ne soit pas distribué du tout. La distribution sur le réseau ne donne pas lieu à l'émission d'un accusé de réception et le message n'est pas stocké. Le message peut être perdu en cas de déconnexion du client ou de l'échec du serveur. Le niveau QoS0 représente le mode de transmission le plus rapide. Il est parfois appelé mécanisme "fire and forget".
ko: 메시지가 한 번 이하로 전달되거나 전혀 전달되지 않습니다. 네트워크를 통한 전달은 수신확인 되지 않으므로 메시지가 저장되지 않습니다. 클라이언트의 연결이 끊기거나 서버가 실패하면 메시지가 유실될 수 있습니다. QoS0은 가장 빠른 전송 모드입니다. 이를 "실행 후 무시(fire and forget)"라고도 합니다.
pt_br: A mensagem é entregue no máximo uma vez ou pode não ser entregue definitivamente. A entrega pela rede não é reconhecida e a mensagem não é armazenada. A mensagem poderá ser perdida se o cliente estiver desconectado ou se o servidor falhar. QoS0 é o modo mais rápido de transferência. Ele é, às vezes, chamado de "fire and forget".

source: The MQTT protocol does not require servers to forward publications at QoS0 to a client. If the client is disconnected at the time the server receives the publication, the publication might be discarded, depending on the server implementation.
es: El protocolo MQTT no necesita servidores para reenviar publicaciones en QoS0 a un cliente. Si el cliente está desconectado en el momento en que el servidor recibe la publicación, es posible que la publicación se descarte, en función de la implementación de servidor.
fr: Le protocole MQTT n'exige pas que les serveurs réacheminent les publications vers un client au niveau QoS0. Si le client est déconnecté au moment où le serveur reçoit la publication, la publication risque d'être supprimée, selon la mise en oeuvre du serveur.
ko: MQTT 프로토콜은 서버가 QoS0에서의 공개를 클라이언트에 전달하도록 요구하지 않습니다. 서버가 공개를 수신할 때 클라이언트의 연결이 끊기면 서버 구현에 따라 공개가 삭제될 수 있습니다.
pt_br: O protocolo MQTT não exige servidores para redirecionar publicações em QoS0 para um cliente. Se o cliente estiver desconectado no momento em que o servidor recebe a publicação, a publicação poderá ser descartada, dependendo da implementação do servidor.

source: When sending real-time data on an interval we recommend using QoS0. If a single message goes missing it does not really matter as another message will be sent shortly after containing newer data. In this scenario the extra cost of using higher quality of service does not result in any tangible benefit.
es: Cuando se envíen datos en tiempo real a intervalos, recomendamos utilizar QoS0. No importa realmente si se pierde un mensaje individual porque se enviará otro mensaje en breve después de que éste contenga datos más nuevos. En este escenario, el coste adicional de utilizar una calidad de servicio superior no ofrece ninguna ventaja tangible.
fr: Il est recommandé d'utiliser la qualité de service QoS0 lorsque vous envoyez des données en temps réel au cours d'un intervalle donné. La perte d'un message n'a pas vraiment d'importance dans cette situation car un autre message sera envoyé peu après lorsqu'il inclura des données plus récentes. Dans ce scénario, le surcoût entraîné par l'utilisation d'une qualité de service plus élevée ne présente pas de réel avantage.
ko: 일정한 간격으로 실시간 데이터를 전송하는 경우 QoS0를 사용하는 것이 좋습니다. 새 데이터를 포함한 직후 다른 메시지가 전송되므로 단일 메시지가 누락되어도 문제가 되지 않습니다. 이 시나리오에서는 높은 서비스 품질(QoS)을 사용하는 데 소요되는 추가 비용이 유형의 이점을 생성하지 않습니다.
pt_br: Ao enviar dados em tempo real em um intervalo, recomendamos usar o QoS0. Se uma única mensagem estiver faltando, realmente não importará se outra mensagem será enviada rapidamente após conter dados mais novos. Nesse cenário, o custo extra de usar qualidade de serviço mais alta não resulta em nenhum benefício tangível.

source: At least once (QoS1)
es: Como mínimo una vez (QoS1)
fr: Au moins une fois (QoS1)
ko: 한 번 이상(QoS1)
pt_br: Pelo menos uma vez (QoS1)

source: The message is always delivered at least once. It might be delivered multiple times if there is a failure before an acknowledgment is received by the sender. The message must be stored locally at the sender, until the sender receives confirmation that the message has been published by the receiver. The message is stored in case the message must be sent again.
es: El mensaje siempre se entregan al menos una vez. Puede ser entregado varias veces si se produce una anomalía antes de un acuse de recibo recibidos por el remitente. El mensaje debe almacenarse localmente en el remitente, hasta que éste recibe la confirmación de que el destinatario ha publicado el mensaje. El mensaje se almacena por si éste debe volverse a enviar.
fr: Le message est toujours distribué au moins une fois. Il peut être distribué plusieurs fois si la procédure échoue avant qu'un accusé de réception ne soit reçu par l'expéditeur. Le message doit être stocké en local au niveau de l'expéditeur jusqu'à ce que ce dernier reçoive une confirmation indiquant que le message a été publié par le destinataire. Le message est stocké au cas où il devrait être une nouvelle fois envoyé.
ko: 메시지는 항상 한 번 이상 전달됩니다. 송신자가 수신확인을 수신하기 전에 장애가 발생하는 경우 메시지가 여러 번 전달될 수 있습니다. 수신자가 메시지를 공개했다는 확인을 송신자가 수신할 때까지 메시지는 송신자 측에서 로컬로 저장되어야 합니다. 메시지를 다시 전송해야 하는 경우 메시지가 저장됩니다.
pt_br: A mensagem é sempre entregue pelo menos uma vez. Ela pode ser entregue várias vezes se houver uma falha antes de uma confirmação ser recebida pelo remetente. A mensagem deve ser armazenada localmente no remetente, até o remetente receber a confirmação de que a mensagem foi publicada pelo destinatário. A mensagem é armazenada para o caso de ser necessário enviá-la novamente.

source: Exactly once (QoS2)
es: Exactamente una vez (QoS2)
fr: Une fois exactement (QoS2)
ko: 정확하게 한 번(QoS2)
pt_br: Exatamente uma vez (QoS2)
