Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/messaging/mqtt.po
Languages: es, fr, ko, pt_br

source: The message is always delivered exactly once. The message must be stored locally at the sender, until the sender receives confirmation that the message has been published by the receiver. The message is stored in case the message must be sent again. QoS2 is the safest, but slowest mode of transfer. A more sophisticated handshaking and acknowledgement sequence is used than for QoS1 to ensure no duplication of messages occurs.
es: El mensaje siempre se entrega exactamente una vez. El mensaje debe almacenarse localmente en el remitente, hasta que éste recibe la confirmación de que el destinatario ha publicado el mensaje. El mensaje se almacena por si éste debe volverse a enviar. QoS2 es el modo de transferencia más seguro, pero más lento. Se utiliza una secuencia de conformidad de conexión y de acuse de recibo más compleja que en el caso de QoS1 para garantizar que no se dupliquen los mensajes.
fr: Le message est toujours distribué une fois. Il doit être stocké en local au niveau de l'expéditeur jusqu'à ce que ce dernier reçoive une confirmation indiquant que le message a été publié par le destinataire. Le message est stocké au cas où il devrait être une nouvelle fois envoyé. La qualité de service QoS2 est le mode de transmission le plus sûr mais le plus lent. Elle utilise une séquence plus complexe que la qualité de service QoS1, avec l'établissement d'une liaison et l'émission d'un accusé de réception, pour s'assurer qu'il n'y pas une duplication des messages.
ko: 메시지는 항상 정확하게 한 번 전달됩니다. 수신자가 메시지를 공개했다는 확인을 송신자가 수신할 때까지 메시지는 송신자 측에서 로컬로 저장되어야 합니다. 메시지를 다시 전송해야 하는 경우 메시지가 저장됩니다. QoS2는 가장 안전하지만 가장 느린 전송 모드입니다. 메시지 중복이 발생하지 않도록 하기 위해 QoS1보다 정교한 핸드쉐이크 및 수신확인 순서가 사용됩니다.
pt_br: A mensagem sempre é entregue exatamente uma vez. A mensagem deve ser armazenada localmente no remetente, até o remetente receber a confirmação de que a mensagem foi publicada pelo destinatário. A mensagem é armazenada para o caso de ser necessário enviá-la novamente. QoS2 é o modo mais seguro, mas o mais lento de transferência. Uma sequência mais sofisticada de handshaking e confirmação é usada para QoS1 para assegurar que não ocorra duplicação de mensagens.

source: When sending commands we recommend using QoS2. In many cases, when processing commands you want to know that the command will only be actioned, and that it will be actioned only once. This is one of the clearest examples of when the additional overhead of QoS2 has a clear benefit.
es: Para enviar mandatos, recomendamos utilizar QoS2. En muchos casos, al procesar mandatos desea saber que el mandato sólo se accionará y que sólo se accionará una vez. Este es uno de los ejemplos más claros de los casos en que la sobrecarga adicional de QoS2 tiene una ventaja clara.
fr: Il est recommandé d'utiliser la qualité de service QoS2 pour l'envoi de commandes. Dans la plupart des cas, lors du traitement des commandes, vous souhaitez savoir que la commande sera uniquement appliquée et qu'elle sera appliquée une seule fois. C'est l'un des exemples où le temps système supplémentaire de la qualité de service QoS2 présente réellement un avantage.
ko: 명령을 전송하는 경우 QoS2를 사용하는 것이 좋습니다. 많은 경우 명령을 처리할 때 명령이 한 번만 실행되는지 알고 싶어 합니다. 이는 QoS2의 추가적인 오버헤드에 명확한 이점이 있는 경우에 대한 명확한 예 중 하나입니다.
pt_br: Ao enviar comandos, nós recomendamos usar QoS2. Em muitos casos, ao processar comandos você deseja saber se o comando será apenas acionado e se ele será acionado apenas uma vez. Este é um dos exemplos mais claros de quando a sobrecarga adicional do QoS2 tem um benefício evidente.

source: Subscription Buffers and Clean Session
es: Almacenamientos intermedios de suscripción y limpiar sesión
fr: Mémoires tampons des abonnements et option 'clean session'
ko: 구독 버퍼 및 정리 세션
pt_br: Buffers de Assinatura e Sessão de Limpeza

source: Each subscription from either a device or application is allocated a buffer of 5000 messages. This allows for any application or device to fall behind the live data it is processing and build up a backlog of up to 5000 pending messages for each subscription it has made. Once the buffer fills up, any new message will result in the oldest message in the buffer being discarded.
es: Para cada suscripción de un dispositivo o aplicación se asigna un almacenamiento intermedio de 5000 mensajes. Esto permite que cualquier aplicación o dispositivo se quede atrás de los datos activos que está procesando y cree un retraso de hasta 5000 mensajes pendientes para cada suscripción que ha realizado. Una vez se llene el almacenamiento intermedio, los nuevos mensajes se traducirán en los mensajes más antiguos del almacenamiento intermedio que se descarte.
fr: Chaque abonnement d'un terminal ou d'une application dispose d'une mémoire tampon de 5000 messages. Ce mécanisme permet à une application ou à un terminal de prendre du retard lors du traitement des données en temps réel et d'accumuler 5000 messages en attente pour chaque abonnement souscrit. Une fois que la mémoire tampon arrive à saturation, l'apparition d'un nouveau message entraîne la suppression du message le plus ancien dans la mémoire tampon.
ko: 디바이스 또는 애플리케이션으로부터의 각각의 구독에는 5000개의 메시지라는 버퍼가 할당됩니다. 이를 통해 애플리케이션 또는 디바이스는 처리 중인 라이브 데이터보다 뒤쳐져서 작성한 각각의 구독에 대해 최대 5000개의 보류 중인 메시지의 백로그를 빌드할 수 있습니다. 버퍼가 가득 차고 난 후 새 메시지가 생성되면 버퍼의 가장 오래된 메시지가 삭제됩니다.
pt_br: A cada assinatura de um dispositivo ou aplicativo é alocado um buffer de 5000 mensagens. Isso permite que qualquer aplicativo ou dispositivo fique atrás dos dados ativos que está processando e construa uma lista não processada de até 5000 mensagens pendentes para cada assinatura feita. Quando o buffer estiver cheio, qualquer mensagem nova resultará no descarte da mensagem mais antiga do buffer.

source: The subscription buffer can be accessed using MQTT clean session option. If clean session is set to false, a subscriber will start receiving messages from the buffer. If clean session is set to true, the buffer is reset.
es: Se puede acceder al almacenamiento intermedio de suscripción utilizando la opción de sesión de limpieza de MQTT.Si la sesión de limpieza está definida como false, el suscriptor comenzará a recibir mensajes desde el almacenamiento intermedio.Si la sesión de limpieza está definida como true, se restablecerá el almacenamiento intermedio.
fr: La mémoire tampon de l'abonnement est accessible à l'aide de l'option 'clean session' de MQTT. Si l'option 'clean session' correspond à false, un abonné commence à recevoir des messages provenant de la mémoire tampon. Si elle correspond à true, la mémoire tampon est réinitialisée.
ko: 구독 버퍼는 MQTT 정리 세션 옵션을 사용하여 액세스할 수 있습니다. 정리 세션이 false로 설정된 경우 구독자는 버퍼에서 메시지 수신을 시작합니다. 정리 세션이 true로 설정된 경우 버퍼가 재설정됩니다.
pt_br: O buffer de assinatura pode ser acessado usando a opção de sessão de limpeza MQTT. Se a sessão de limpeza for configurada como false, um assinante começará a receber mensagens do buffer. Se a sessão de limpeza for configurada como true, o buffer será reconfigurado.

source: This limit applies regardless of the quality of service setting used. Thus it is possible that a message sent at QoS1 or QoS2 may not be delivered to an application that is unable to keep up with the messages rate for the subscription(s) it has made.
es: Este límite se aplica sea cual sea el valor utilizado para la calidad de servicio. Por lo tanto, es posible que un mensaje enviado en QoS1 o QoS2 no se entregue a una aplicación que no puede mantenerse actualizada con la tasa de mensajes para la suscripción o las suscripciones que ha realizado.
fr: Cette limite s'applique, quel que soit le paramètre de qualité de service utilisé. Il est donc possible qu'un message envoyé au niveau de qualité de service QoS1 ou QoS2 ne soit pas distribué à une application qui ne peut pas soutenir le débit des messages associé à l'abonnement souscrit.
ko: 이 제한은 사용된 서비스 품질(QoS) 설정에 관계없이 적용됩니다. 따라서 QoS1 또는 QoS2에서 전송된 메시지가 애플리케이션이 작성한 구독에 대한 메시지 비율을 맞출 수 없는 애플리케이션에 전달되지 못할 수 있습니다.
pt_br: Este limite se aplica independentemente da configuração da qualidade de serviço usada. Portanto, é possível que uma mensagem enviada em QoS1 ou QoS2 possa não ser entregue a um aplicativo que não consegue acompanhar a taxa de mensagens para a(s) assinatura(s) feita(s).

source: **org\_id**.messaging.internetofthings.ibmcloud.com
es: **id\_org**.messaging.internetofthings.ibmcloud.com
