Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/messaging/payload.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_tw

source: Message Payload
de: Nachrichtennutzdaten
es: Carga útil de mensaje
fr: Contenu du message
it: Payload dei messaggi
ja: メッセージ・ペイロード
ko: 메시지 페이로드
pt_br: Carga Útil da Mensagem
zh_tw: 訊息內容

source: The Foundation supports sending and recieving messages in any format, however we recommend the use of JSON and the IoTF event format specification.
de: Die Foundation unterstützt das Senden und Empfangen von Nachrichten in jedem Format; wir empfehlen jedoch die Verwendung von JSON und der IoTF-Ereignisformatspezifikation.
es: Aunque Foundation soporta el envío y la recepción de mensajes en cualquier formato, recomendamos el uso de JSON y la especificación de formato de sucesos de IoTF.
fr: Foundation prend en charge l'envoi et la réception de messages dans n'importe quel format. Toutefois, il est recommandé d'utiliser la spécification de format d'événement JSON et IoTF.
it: Foundation supporta l'invio e la ricezione di messaggi in qualsiasi formato, tuttavia si raccomanda l'uso di JSON e della specifica del formato evento IoTF.
ja: Foundation では、任意の形式のメッセージの送受信がサポートされていますが、JSON および IoTF イベント形式仕様を使用することをお勧めします。
ko: 이 Foundation은 모든 형식의 메시지 송수신을 지원하지만 JSON 및 IoTF 이벤트 형식 스펙을 사용하는 것이 좋습니다.
pt_br: O Foundation suporta enviar e receber mensagens em qualquer formato, no entanto, recomendamos o uso de JSON e a especificação de formato de evento IoTF.
zh_tw: 此 Foundation 支援以任何格式傳送及接收訊息，不過我們建議使用 JSON 和 IoTF 事件格式規格。

source: IoTF Maximum Message Payload Size
de: Maximale Größe der IoTF-Nachrichtennutzdaten
es: Tamaño de carga útil de mensaje máximo de IoTF
fr: Taille maximale du contenu d'un message IoTF
it: Dimensione massima payload dei messaggi IoTF
ja: IoTF 最大メッセージ・ペイロード・サイズ
ko: IoTF 최대 메시지 페이로드 크기
pt_br: Tamanho máximo de carga útil da mensagem do IoTF
zh_tw: IoTF 訊息內容大小上限

source: The maximum payload size is 4 kilobytes (kB). If messages with payloads larger than this limit are sent, the client will be disconnected and the following log message will appear in the Diagnostic Logs if the client is a device:
de: Die maximale Nutzdatengröße beträgt 4 Kilobyte (KB). Wenn Nachrichten mit Nutzdaten gesendet werden, die größer als dieses Limit sind, wird die Clientverbundung getrennt und die folgende Protokollnachricht wird in den Diagnoseprotokollen angezeigt, wenn der Client ein Gerät ist:
es: El tamaño de carga útil máximo es de 4 kilobytes (kB). Si se envían mensajes con una carga útil superior a este límite, el cliente se desconectará y aparecerá el siguiente mensaje de registro en los Registros de diagnóstico en caso de que el cliente sea un dispositivo:
fr: La taille maximale du contenu est de 4 kilo-octets. Lorsque vous envoyez des messages dont le contenu est supérieur à cette limite, le client est déconnecté et le message suivant est consigné dans les journaux de diagnostic si le client est un terminal :
it: La dimensione massima del payload è 4 kilobyte (kB). Se vengono inviati messaggi con payload superiori a questo limite, il client verrà disconnesso e nei Log diagnostici verrà visualizzato il seguente messaggio di log se il client è un dispositivo:
ja: 最大ペイロード・サイズは 4 キロバイト (KB) です。この限界より大きいペイロードを持つメッセージが送信される場合、クライアントは切断され、以下のログ・メッセージが診断ログに表示されます (クライアントがデバイスである場合)。
ko: 최대 페이로드 크기는 4KB입니다. 페이로드가 이 한계보다 큰 메시지가 전송되는 경우 클라이언트의 연결이 끊어지며 클라이언트가 디바이스인 경우 다음 로그 메시지가 진단 로그에 표시됩니다.
pt_br: O tamanho máximo da carga útil é 4 kilobytes (kB). Caso sejam enviadas mensagens com cargas úteis superiores a esse limite, o cliente será desconectado e a seguinte mensagem de log aparecerá nos Logs de Diagnóstico se o cliente for um dispositivo:
zh_tw: 內容大小上限為 4 KB。如果傳送的訊息包含內容大於此限制，則會中斷用戶端連線，如果用戶端為裝置，則會在「診斷日誌」中出現下列日誌訊息：

source: Closed connection from x.x.x.x. The message size is too large for this endpoint.
de: Geschlossene Verbindung von x.x.x.x. Die Nachrichtengröße ist für diesen Endpunkt zu hoch.
es: Conexión cerrada desde x.x.x.x. El tamaño de mensaje es demasiado grande para este terminal.
fr: Connexion fermée à partir de x.x.x.x. La taille du message est trop importante pour ce noeud final.
it: Connessione da x.x.x.x chiusa. La dimensione del messaggio è troppo elevata per questo endpoint.
ja: x.x.x.x からの接続が閉じられました。メッセージ・サイズがこのエンドポイントには大きすぎます。
ko: x.x.x.x 연결이 종료되었습니다. 메시지 크기가 이 엔드포인트에 비해 너무 큽니다.
zh_tw: 已關閉來自 x.x.x.x 的連線。對此端點而言，訊息大小太大。

source: IoTF JSON Payload Specification
de: IoTF JSON - Nutzdatenspezifikation
es: Especificación de carga útil JSON de IoTF
fr: Spécification IoTF JSON Payload
it: Specifica del payload JSON IoTF
ja: IoTF JSON ペイロード仕様
ko: IoTF JSON 페이로드 스펙
zh_tw: IoTF JSON 內容規格

source: It is simple to create a JSON message that meets the IoTF specification.
de: Das Erstellen einer JSON-Nachricht, die der IoTF-Spezifikation entspricht ist einfach.
es: Es simple crear un mensaje JSON que cumpla con la especificación de IoTF.
fr: Il est facile de créer un message JSON conforme à la spécification IoTF.
it: È semplice creare un messaggio JSON che rispetti la specifica IoTF.
ja: IoTF 仕様を満たす JSON メッセージを作成することは簡単です。
ko: IoTF 스펙을 충족하는 JSON 메시지는 간단하게 작성할 수 있습니다.
pt_br: É simples criar uma mensagem JSON que atenda à especificação IoTF.
zh_tw: 建立符合 IoTF 規格的 JSON 訊息很簡單。

source: The message must be a valid JSON object (not an array) with only two top level elements: **d** and **ts**
de: Die Nachricht muss ein gültiges JSON-Objekt (kein Array) mit lediglich zwei Elementen der höchsten Ebene sein: **d** und **ts**
es: El mensaje debe ser un objeto (no una matriz) JSON válido con solo dos elementos de nivel superior: **d** y **ts**
fr: Le message doit être un objet JSON valide (pas un tableau) incluant uniquement deux éléments de niveau supérieur : **d** et **ts**
it: Il messaggio deve essere un oggetto JSON valido (non una schiera) con solo due elementi di livello principale: **d** e **ts**
ja: メッセージは、**d** および **ts** の 2 つのトップレベル要素のみを含む有効な JSON オブジェクト (配列ではない) でなければなりません。
ko: 해당 메시지는 두 개의 최상위 레벨 요소(**d** 및 **ts**)만 가진 올바른 JSON 오브젝트(배열 아님)여야 합니다.
pt_br: A mensagem deve ser um objeto JSON válido (não uma matriz) com apenas dois elementos de nível superior: **d** e **ts**
zh_tw: 訊息必須是有效的 JSON 物件（非陣列），而且只包含兩個最上層元素：**d** 和 **ts**

source: The message must be UTF-8 encoded
de: Die Nachricht muss in UTF-8 codiert sein
es: El mensaje debe estar codificado en UTF-8
fr: Le message doit utiliser le codage UTF-8
it: Il messaggio deve essere codificato UTF-8
ja: メッセージは UTF-8 エンコードでなければなりません
ko: 메시지는 UTF-8 인코딩되어 있어야 함
pt_br: A mensagem deve ser codificada por UTF-8
zh_tw: 訊息必須為 UTF-8 編碼

source: Data
de: Daten
fr: Données
it: Dati
ja: データ
ko: 데이터
pt_br: Dados
zh_tw: 資料

source: The **d** element is where you include all data for the event (or command) being transmitted in the message.
de: Im **d**-Element schließen Sie alle Daten für das Ereignis (oder den Befehl), das in der Nachricht übertragen wird, ein.
es: El elemento **d** es el lugar donde se incluyen todos los datos para el suceso (o mandato) que se está transmitiendo en el mensaje.
fr: **d** est l'élément où vous placez toutes les données de l'événement (ou de la commande) transmises dans le message.
it: L'elemento **d** è dove si includono tutti i dati per l'evento (o comando) da trasmettere nel messaggio.
ja: **d** 要素には、メッセージに入れて送信されるイベント (またはコマンド) のすべてのデータを入れます。
ko: **d** 요소는 메시지에서 전송 중인 이벤트(또는 명령)에 대한 모든 데이터를 포함하는 위치입니다.
pt_br: O elemento **d** é onde você inclui todos os dados para o evento (ou comando) que está sendo transmitido na mensagem.
zh_tw: **d** 元素是您包含訊息中所傳輸之事件（或指令）的所有資料的位置。

source: This element is required for your message to meet the IoTF message specification.
de: Dieses Element ist für Ihre Nachricht erforderlich, damit die IoTF-Nachrichtenspezifikation eingehalten wird.
es: Este elemento es necesario para que el mensaje cumpla con la especificación de mensajes de IoTF.
fr: Cet élément est nécessaire pour rendre votre message IoTF conforme à la spécification de messages IoTF.
it: Questo elemento è obbligatorio per il messaggio per rispetta la specifica dei messaggi IoTF.
ja: この要素は、メッセージが IoTF メッセージ仕様を満たす上で必須です。
ko: 이 요소는 메시지가 IoTF 메시지 스펙을 충족하기 위해 필수입니다.
pt_br: Esse elemento é obrigatório para a mensagem para atender à especificação da mensagem IoTF.
zh_tw: 訊息若要符合 IoTF 訊息規格，需要有此元素。

source: This must always be a JSON object (not an array)
de: Dies muss immer ein JSON-Objekt sein (kein Array)
es: Este debe ser siempre un objeto JSON (no una matriz)
fr: Ce doit toujours être un objet JSON (pas un tableau)
it: Deve essere sempre un oggetto JSON (non una schiera)
ja: これは、常に JSON オブジェクトでなければなりません (配列ではない)
ko: 이는 항상 JSON 오브젝트(배열 아님)여야 함
pt_br: Este deve ser sempre um objeto JSON (não uma matriz)
zh_tw: 這必須一律為 JSON 物件（非陣列）

source: In the case where you wish to send no data the **d** element should still be present, but contain an empty object.
de: Im dem Fall, wo Sie keine Daten senden wollen, muss das Element **d** weiterhin vorhanden sein, muss jedoch ein leeres Objekt enthalten.
es: En caso de que no desee enviar datos, el elemento **d** debe estar presente de todas formas, pero debe contener un objeto vacío.
fr: Si vous ne souhaitez pas envoyer de données, l'élément **d** doit toujours être indiqué mais il doit contenir un objet vide.
it: Nel caso in cui non si desidera inviare dati l'elemento **d** deve comunque essere presente, ma contenere un oggetto vuoto.
ja: データを送信するわけではない場合でも、**d** 要素には、空オブジェクトが内容として存在しなければなりません。
ko: 데이터를 전송하지 않으려는 경우에는 **d** 요소가 여전히 존재해야 하지만 비어 있는 오브젝트를 포함해야 합니다.
pt_br: No caso de você não desejar enviar nenhum dado, o elemento **d** ainda deve estar presente, mas conterá um objeto vazio.
zh_tw: 如果您不想要傳送資料，**d** 元素仍然要存在，但是包含空物件。

source: Example 1 - Simple Data
de: Beispiel 1 - Einfache Daten
es: Ejemplo 1 - Datos simples
fr: Exemple 1 - Données simples
it: Esempio 1 - Dati semplici
ja: 例 1 - 単純なデータ
ko: 예제 1 - 단순 데이터
pt_br: Exemplo 1 - Dados Simples
zh_tw: 範例 1 - 簡式資料

source: Example 2 - Complex data
de: Beispiel 2 - Komplexe Daten
es: Ejemplo 2 - Datos complejos
fr: Exemple 2 - Données complexes
it: Esempio 2 - Dati complessi
ja: 例 2 - 複合データ
ko: 예제 2 - 복합 데이터
pt_br: Exemplo 2 - Dados Complexos
zh_tw: 範例 2 - 複式資料

source: Example 3 - No data
de: Beispiel 3 - Keine Daten
es: Ejemplo 3 - Sin datos
fr: Exemple 3 - Pas de données
it: Esempio 3 - Nessun dato
ja: 例 3 - データなし
ko: 예제 3 - 데이터 없음
pt_br: Exemplo 3 - Nenhum dado
zh_tw: 範例 3 - 無資料

source: Timestamp
de: Zeitmarke
es: Indicación de fecha y hora
fr: Horodatage
it: Data/ora
ja: タイム・スタンプ
ko: 시간소인
pt_br: Registro de data e hora
zh_tw: 時間戳記

source: The **ts** element allows you to associate a timestamp with the event (or command). This is an optional element, if included its value should be a valid ISO8601 encoded timestamp string.
de: Das **ts**-Element ermöglicht das Zuordnen einer Zeitmarke mit dem Ereignis (oder dem Befehl). Dies ist ein optionales Element; falls einbezogen, muss es eine gültige ISO8601-codierte Zeitmarkenzeichenfolge sein.
es: El elemento **ts** le permite asociar una indicación de fecha y hora con el suceso (o mandato). Este es un elemento opcional; si se incluye, el valor debe ser una serie de indicación de fecha y hora codificada ISO8601 válida.
fr: L'élément **ts** permet d'associer un horodatage à l'événement (ou à la commande). Il est facultatif. Si vous décidez de l'indiquer, sa valeur doit être un chaîne d'horodatage codée ISO8601 valide.
it: L'elemento **ts** consente di associare una data/ora all'evento (o comando). Si tratta di un elemento facoltativo, se incluso il suo valore deve essere una stringa data/ora codificata ISO8601 valida.
ja: **ts** 要素を使用すると、イベント (またはコマンド) にタイム・スタンプを関連付けることができます。これはオプションの要素であり、これを含めた場合、その値は、ISO8601 エンコードのタイム・スタンプ文字列として有効なものでなければなりません。
ko: **ts** 요소를 사용하면 시간소인을 이벤트(또는 명령)와 연관시킬 수 있습니다. 이 요소는 선택적 요소이며 포함된 경우에는 해당 값이 올바른 ISO8601 인코딩된 시간소인 문자열이어야 합니다.
pt_br: O elemento **ts** permite associar um registro de data e hora ao evento (ou comando). Esse é um elemento opcional, se incluído, seu valor deve ser uma sequência de registro de data e hora codificada ISO8601 válida.
zh_tw: **ts** 元素可讓您建立時間戳記與事件（或指令）的關聯。這是選用的元素，如果有包括，其值應為有效的 ISO8601 編碼時間戳記字串。

source: Custom JSON payloads
de: Angepasste JSON-Nutzdaten
es: Cargas útiles JSON personalizadas
fr: Contenus JSON personnalisés
it: Payload JSON personalizzati
ja: カスタム JSON ペイロード
ko: 사용자 정의 JSON 페이로드
pt_br: Cargas úteis JSON customizadas
zh_tw: 自訂 JSON 內容

source: The IoT Foundation is designed to be open, you may send your event and command data in any format you choose, however if you choose to send data in a custom format it will limit some features of the service which can only function with a known payload format.
de: IoT Foundation ist als offene Plattform konzipiert. Sie können Ihre Ereignis- und Befehlsdaten in jedem Format senden, das Sie auswählen. Wenn Sie jedoch Daten in einem benutzerdefinierten Format senden, sind einige Funktionen des Services eingeschränkt, da der Service nur mit einem bekannten Nutzdatenformat funktioniert.
es: Aunque IoT Foundation está diseñado para ser abierto y se pueden enviar los datos de suceso y mandato en cualquier formato que se elija, si se elige enviar datos en un formato personalizado limitará algunas características del servicio que solo pueden funcionar con un formato de carga útil conocido.
fr: IoT Foundation étant conçu comme un service ouvert, vous pouvez envoyer les données d'un événement et d'une commande dans le format de votre choix. Toutefois, si vous décidez d'envoyer les données dans un format personnalisé, certaines fonctions du service qui peuvent uniquement s'exécuter avec un format de contenu connu seront limitées.
it: IoT Foundation è progettato per essere un servizio aperto, è possibile inviare i dati comando e evento in qualsiasi formato a propria scelta, tuttavia se si sceglie di inviare i dati in un formato personalizzato ci saranno delle limitazioni per alcune funzioni del servizio che possono funzionare solo con un formato payload noto.
ja: IoT Foundation はオープンとして設計されており、イベントおよびコマンドのデータは任意の形式で送信することが可能ですが、カスタム形式のデータを送信する場合、特定のペイロード形式でのみ機能するサービスの一部の機能が制限されることになります。
ko: IoT Foundation은 개방적이도록 설계되어 있으므로 사용자는 선택한 모든 형식으로 이벤트 및 명령 데이터를 전송할 수 있지만 사용자 정의 형식으로 데이터를 전송하도록 선택하는 경우에는 알려진 페이로드 형식에 대해서만 작동할 수 있는 서비스의 일부 기능이 제한됩니다.
pt_br: O IoT Foundation é projetado para ser aberto, você pode enviar seus dados de evento e de comando em qualquer formato que escolher, no entanto, se escolher enviar dados em um formato customizado, isso limitará alguns recursos do serviço que podem funcionar apenas com um formato de carga útil conhecido.
zh_tw: IoT Foundation 為開放式設計，您可以用您選擇的任何格式傳送事件和指令資料，不過，如果您選擇以自訂格式傳送資料，它將限制該服務的部分特性，讓這些特性只在使用已知的內容格式時才有效。

source: Below are a number of example payloads that are close to the IoTF specification, but do not quite match it. Each would be treated as a custom JSON payload.
de: Nachfolgend werden einige Beispiele von Nutzdaten aufgeführt, die nahe an die IoTF-Spezifikation kommen, jedoch nicht ganz mit ihr übereinstimmen. Jedes Nutzdatenbeispiel wird als angepasste JSON-Payload behandelt.
es: Más abajo hay diversas cargas útiles de ejemplo que están cerca de la especificación de IoTF, pero no coinciden del todo con ella. Cada una de ellas debe tratarse como carga útil JSON personalizada.
fr: La section ci-après contient un certain nombre d'exemples de contenu relativement proches de la spécification IoTF mais qui ne sont pas tout à fait compatibles. Chacun d'entre eux sera traité comme un contenu JSON personnalisé.
it: Di seguito viene visualizzata una serie di payload di esempio, simili alla specifica IoTF, ma non del tutto corrispondenti. Ognuno viene trattato come un payload JSON personalizzato.
ja: IoTF 仕様に近いものの、完全には一致していないサンプル・ペイロードをいくつか以下に示します。いずれもカスタム JSON ペイロードとして扱われます。
ko: IoTF 스펙에 가깝지만 상당히 일치하지는 않는 다수의 예제 페이로드가 아래에 제공됩니다. 각각의 예제 페이로드는 사용자 정의 JSON 페이로드로 처리됩니다.
pt_br: Abaixo estão vários exemplos de cargas úteis próximas à especificação IoTF, mas que não correspondem a ela. Cada uma deve ser tratada como uma carga útil JSON customizada.
zh_tw: 以下是一些內容範例，它們接近 IoTF 規格，但不完全符合。每一個都將視為自訂 JSON 內容。

source: **Example 1**
de: **Beispiel 1**
es: **Ejemplo 1**
fr: **Exemple 1**
it: **Esempio 1**
ja: **例 1**
ko: **예제 1**
pt_br: **Exemplo 1**
zh_tw: **範例 1**

source: Root node is a JSON array
de: Rootknoten ist ein JSON-Array
es: El nodo raíz es una matriz JSON
fr: Le noeud racine est un tableau JSON
it: Il nodo root è una schiera JSON
ja: ルート・ノードは JSON 配列
ko: 루트 노드가 JSON 배열임
pt_br: Nó raiz é uma matriz JSON
zh_tw: 根節點是 JSON 陣列

source: **Example 2**
de: **Beispiel 2**
es: **Ejemplo 2**
fr: **Exemple 2**
it: **Esempio 2**
ja: **例 2**
ko: **예제 2**
pt_br: **Exemplo 2**
zh_tw: **範例 2**

source: "d" node is a JSON array
de: "d"-Knoten ist ein JSON-Array
es: El nodo "d" es una matriz JSON
fr: Le noeud "d" est un tableau JSON
it: Il nodo "d" è una schiera JSON
ja: "d" ノードは JSON 配列
ko: "d" 노드가 JSON 배열임
pt_br: Nó "d" é uma matriz JSON
zh_tw: "d" 節點是 JSON 陣列

source: **Example 3**
de: **Beispiel 3**
es: **Ejemplo 3**
fr: **Exemple 3**
it: **Esempio 3**
ja: **例 3**
ko: **예제 3**
pt_br: **Exemplo 3**
zh_tw: **範例 3**

source: Unexpected node at root level
de: Unerwarteter Knoten auf Rootebene
es: Nodo inesperado a nivel raíz
fr: Noeud inattendu au niveau racine
it: Nodo imprevisto a livello root
ja: ルート・レベルに予期しないノード
ko: 루트 레벨에 있는 예상치 않은 노드
pt_br: Nó inesperado no nível raiz
zh_tw: 根層次有非預期的節點
