Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: it, ja, zh_cn, zh_tw

source: Introduction
it: Introduzione
ja: 概要
zh_cn: 简介
zh_tw: 簡介

source: About
it: Informazioni su
ja: 要約
zh_cn: 关于
zh_tw: 關於

source: Welcome to the documentation/reference material for IBM's IoT Foundation service. If you are looking for tutorials you can find them on developerWorks Recipes_.
it: Benvenuti nella documentazione/materiale di riferimento per il servizio IoT Foundation di IBM. Se si cercano le esercitazioni è possibile trovarle in developerWorks Recipes_.
ja: IBM の IoT Foundation サービスの文書 / 参照資料へようこそ。チュートリアルをお探しなら、developerWorks Recipes_ をご覧ください。
zh_cn: 欢迎使用 IBM IoT Foundation 服务的文档/参考资料。如果要查找教程，可在 developerWorks Recipes_ 上进行查找。
zh_tw: 歡迎使用 IBM 的 IoT Foundation 服務的文件/參考資料。如果您要尋找指導教學，可在 developerWorks Recipes_ 找到。

source: The documentation is organized into a number of sections:
it: La documentazione è organizzata in una serie di sezioni:
ja: 本書は、以下のような複数のセクションで編成されています。
zh_cn: 文档组织为多个部分：
zh_tw: 此文件分成幾個章節：

source: Device Management Operations
it: Operazioni di gestione dispositivo
ja: デバイス管理操作
zh_cn: 设备管理操作
zh_tw: 裝置管理作業

source: Programming Guides
it: Guide alla programmazione
ja: プログラミング・ガイド
zh_cn: 编程指南
zh_tw: 程式設計手冊

source: Messaging
it: Messaggistica
ja: メッセージング
zh_cn: 消息传递
zh_tw: 傳訊

source: Reference Material
it: Materiale di riferimento
ja: 参照資料
zh_cn: 参考资料
zh_tw: 參考資料

source: Contribute
it: Contribuisci
ja: 貢献
zh_cn: 提供
zh_tw: 提出

source: If it's not working for you, it's not working for us. The source of this documentation is available on GitHub_, we welcome both `suggestions for improvement`_ and community contributions via the use of issues and pull requests against our repository.
it: Se non funziona per voi, non funziona per noi. L'origine di questa documentazione è disponibile su GitHub_, accogliamo con piacere sia 'proposte di miglioramenti'_ che contributi della comunità tramite l'utilizzo di problemi e il richiamo di richieste nel nostro repository.
ja: ユーザーに活用してもらえなければ意味がありません。本書のソースは GitHub_ から入手できます。`改善の提案`_ や、弊社のリポジトリーに対する発行やプル・リクエストを利用したコミュニティーへの貢献は、いずれも歓迎いたします。
zh_cn: 如果这不适用于您，那么也不适用于我们。GitHub_ 上提供了此文档的源，我们欢迎您通过使用问题提出 `改善建议`_ 向社区添加内容以及针对存储库提出请求。
zh_tw: 如果對您沒有用，對我們也沒有用。此文件的來源可在 GitHub_ 取得，我們歡迎您 `提供建議以求改進`_，也歡迎透過對我們的儲存庫使用問題和提取要求來貢獻社群。
