Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/api/api_intro.po
Languages: de, es, fr, ko, pt_br

source: Introduction to the Internet of Things Foundation API
de: Einführung in die API von Internet of Things Foundation
es: Introducción a la API de Internet of Things Foundation
fr: API Internet of Things Foundation - Introduction
ko: Internet of Things Foundation API 소개
pt_br: Introdução à API do Internet of Things Foundation

source: The Internet of Things Foundation API can be used to interact with your organization in the Internet of Things Foundation.
de: Die API von Internet of Things Foundation API kann zur Interaktion mit Ihrer Organisation in Internet of Things Foundation verwendet werden.
es: Puede utilizar la API de Internet of Things Foundation se puede utilizar para interactuar con su organización en Internet of Things Foundation.
fr: L'API Internet of Things Foundation permet d'interagir avec votre organisation dans Internet of Things Foundation.
ko: Internet of Things Foundation에서 조직과 상호작용하는 데 Internet of Things Foundation API를 사용할 수 있습니다.
pt_br: A API do Internet of Things Foundation pode ser usada para interagir com sua organização no Internet of Things Foundation.

source: API Capabilities
de: API-Leistungsmerkmale
es: Funciones de la API
fr: Fonctionnalités de l'API
ko: API 기능
pt_br: Recursos da API

source: The IoT API has the following functionality:
de: Die IoT-API bietete die folgende Funktionalität:
es: La API IoT dispone de las siguientes funciones:
fr: L'API IoT possède les fonctionnalités suivantes :
ko: IoT API의 기능은 다음과 같습니다.
pt_br: A API do IoT possui a seguinte funcionalidade:

source: View organization details.
de: Anzeigen von Organisationsdetails.
es: Vista de detalles de la organización.
fr: Affichage des détails de l'organisation.
ko: 조직 세부사항을 보십시오.
pt_br: Visualizar detalhes da organização.

source: Bulk device operations (list all, add, remove).
de: Operationen mit Masseneinheiten (alle auflisten, hinzufügen, entfernen).
es: Operaciones de dispositivo masivas (listar todos, añadir, eliminar).
fr: Exécution d'opérations globales sur les terminaux (affichage de tous les terminaux et ajout ou suppression de terminaux).
ko: 벌크 디바이스 오퍼레이션(모두 나열, 추가, 제거).
pt_br: Operações de dispositivo em massa (listar todos, incluir, remover).

source: Device type operations (list all, create, delete, view details, update).
de: Operationen mit Einheitentypen (alle auflisten, erstellen, löschen, Details anzeigen, aktualisieren).
es: Operaciones de tipo de dispositivo (listar todo, crear, eliminar, ver detalles, actualizar).
fr: Opérations relatives aux types de terminaux (affichage de la liste de tous les types de terminaux, création et suppression de types de terminaux, affichage des détails et mise à jour des types de terminaux).
ko: 디바이스 유형 오퍼레이션(모두 나열, 작성, 삭제, 세부사항 보기, 업데이트).
pt_br: Operações de tipo de dispositivo (listar todos, criar, excluir, visualizar detalhes, atualizar).

source: Device operations (list devices, add, remove, view details, update, view location, view management information).
de: Operationen mit Einheiten (Einheiten auflisten, hinzufügen, entfernen, Details anzeigen, aktualisieren, Position anzeigen, Managementinformationen anzeigen).
es: Operaciones de dispositivo (listar dispositivos, añadir, eliminar, ver detalles, actualizar, ver ubicación, ver información de gestión)
fr: Opérations relatives aux terminaux (affichage de la liste de terminaux, ajout et suppression de terminaux, affichage des détails d'un terminal, mise à jour des terminaux, affichage de l'emplacement et des informations de gestion).
ko: 디바이스 오퍼레이션(디바이스 나열, 추가, 제거, 세부사항 보기, 업데이트, 위치 보기, 관리 정보 보기).
pt_br: Operações de dispositivo (listar dispositivos, incluir, remover, visualizar detalhes, atualizar, visualizar local, visualizar informações de gerenciamento).

source: Device diagnostic operations (clear log, retrieve logs, add log information, delete logs, get specific log, clear error codes, get device error codes, add an error code).
de: Operationen zur Einheitendiagnose (Protokoll löschen, Protokolle abrufen, Protokollinformationen hinzufügen, Protokolle löschen, Spezialprotokolle abrufen, Fehlercodes löschen, Einheitenfehlercodes abrufen, Fehlercode hinzufügen).
es: Operaciones de diagnóstico de dispositivos (borrar registro, recuperar registros, añadir información de registro, eliminar registros, obtener un registro específico, borrar códigos de error, obtener códigos de error de dispositivo, añadir código de error).
fr: Opérations de diagnostic des terminaux (effacement du journal, extraction des journaux, ajout d'informations de consignation, suppression des journaux, obtention d'un journal spécifique, effacement des codes d'erreur, obtention des codes d'erreur d'un terminal et ajout d'un code d'erreur).
ko: 디바이스 진단 오퍼레이션(로그 지우기, 로그 검색, 로그 정보 추가, 로그 삭제, 특정 로그 가져오기, 오류 코드 지우기, 디바이스 오류 코드 가져오기, 오류 코드 추가).
pt_br: Operações de diagnóstico de dispositivo (limpar log, recuperar logs, incluir informações de log, excluir logs, obter log específico, limpar códigos de erro, obter códigos de erro do dispositivo, incluir um código de erro).

source: Connection problem determination (list device connection log events).
de: Ermittlung von Verbindungsproblemen (Protokollereignisse für Einheitenverbindung auflisten).
es: Determinación de problemas de conexión (listar sucesos de registro de conexión de dispositivos).
fr: Identification des erreurs de connexion (affichage de la liste des événements du journal des connexions d'un terminal).
ko: 연결 문제점 판별(디바이스 연결 로그 이벤트 나열).
pt_br: Determinação de problemas de conexão (listar eventos de log da conexão de dispositivo).

source: Historical event retrieval (view events from all devices, view events from a device type, view events for a specific device).
de: Abrufen historischer Ereignisse (Ereignisse aller Einheiten anzeigen, Ereignisse aller Einheitentypen anzeigen, Ereignisse für eine bestimmte Einheit anzeigen).
es: Recuperación de sucesos históricos (ver sucesos procedentes de todos los dispositivos, ver sucesos procedentes de un tipo de dispositivo, ver sucesos de un dispositivo específico)
fr: Extraction des événements historiques (affichage des événements de tous les terminaux, affichage des événements d'un type de terminal et affichage des événements d'un terminal spécifique).
ko: 히스토리 이벤트 검색(모든 디바이스에서 이벤트 보기, 디바이스 유형에서 이벤트 보기, 특정 디바이스의 이벤트 보기).
pt_br: Recuperação de eventos históricos (visualizar eventos de todos os dispositivos, visualizar eventos de um tipo de dispositivo, visualizar eventos de um dispositivo específico).

source: Device management request operations (list device management requests, initiate a request, clear request status, get details of a request, get list of request statuses for each affected device, get request status for a specific device).
de: Anforderungsoperationen für Einheitenmanagement (Einheitenmanagementanforderungen auflisten, Anforderung initiieren, Anforderungsstatus löschen, Anforderungsdetails abrufen, Liste der Anforderungsstatusarten für jede betroffene Einheit abrufen, Einheitenanforderungsstatus für eine bestimmte Einheit abrufen).
es: Operaciones de solicitud de gestión de dispositivos (listar solicitudes de gestión de dispositivos, iniciar una solicitud, borrar el estado de solicitud, obtener detalles de una solicitud, obtener una lista de estados de solicitud para cada dispositivo afectado, obtener estados de solicitud de dispositivo para un dispositivo específico).
fr: Opérations relatives aux demandes de gestion des terminaux (affichage de la liste des demandes de gestion des terminaux, lancement d'une demande, effacement du statut d'une demande, obtention des détails d'une demande, obtention de la liste des statuts d'une demande pour chaque terminal concerné, obtention du statut d'une demande pour un terminal spécifique).
ko: 디바이스 관리 요청 오퍼레이션(디바이스 관리 요청 나열, 요청 시작, 요청 상태 지우기, 요청 세부사항 가져오기, 영향을 받는 각 디바이스의 요청 상태 목록 가져오기, 특정 디바이스의 요청 상태 가져오기)
pt_br: Operações de solicitação de gerenciamento de dispositivo (listar solicitações de gerenciamento de dispositivo, iniciar uma solicitação, limpar status da solicitação, obter detalhes de uma solicitação, obter uma lista de status de solicitação para cada dispositivo afetado, obter status de solicitação do dispositivo para um dispositivo específico).

source: Usage management (retrieve number of active devices over a period of time, retrieve amount of storage used by historical event data, retrieve total amount of data used).
de: Nutzungsverwaltung (Anzahl der aktiven Einheiten in einem Zeitraum abrufen, von historischen Ereignisdaten belegten Speicherplatz abrufen, gesamten belegten Speicherplatz abrufen).
es: Gestión de uso (recuperar el número de dispositivos activos a lo largo de un periodo de tiempo, recuperar la cantidad de almacenamiento utilizada por datos de sucesos de historial, recuperar la cantidad total de datos utilizados).
fr: Gestion de l'utilisation (extraction du nombre de terminaux actifs sur une période donnée, extraction de la quantité de stockage utilisée par les données d'événement historiques, extraction de la quantité totale de données utilisée).
ko: 사용법 관리(특정 기간 동안 활성 디바이스의 수 검색, 히스토리 이벤트 데이터에서 사용되는 스토리지량 검색, 사용된 총 데이터량 검색).
pt_br: Gerenciamento de uso (recuperar número de dispositivos ativos durante um período de tempo, recuperar quantidade de armazenamento usado pelos dados de eventos históricos, recuperar quantidade total de dados utilizados).

source: Service status queries (retrieve service statuses for an organization).
de: Servicestatusabfragen (Servicestatusangaben für Organisation abrufen).
es: Consultas de estados de servicio (recuperar estados de servicio para una organización).
fr: Requêtes des statuts du service (extraction des statuts du service pour une organisation).
ko: 서비스 상태 조회(조직의 서비스 상태 검색).
pt_br: Consultas de status de serviço (recuperar status de serviço para uma organização).

source: IoT Foundation API Version 2
es: API de IoT Foundation Versión 2
fr: API IoT Foundation version 2
ko: IoT Foundation API 버전 2
pt_br: API do IoT Foundation Versão 2

source: The current version of the Internet of Things Foundation API is version 2.
de: Die aktuelle Version der Internet of Things Foundation-API ist Version 2.
es: La versión actual de la API de Internet of Things Foundation es la versión 2.
fr: La version en cours de l'API Internet of Things Foundation est la version 2.
ko: Internet of Things Foundation API의 현재 버전은 버전 2입니다.
pt_br: A versão atual da API do Internet of Things Foundation é a versão 2.

source: `Click here <../swagger/v0002.html>`_ for details of the Version 2 API operations.
de: `Klicken Sie hier <../swagger/v0002.html>`_ für Details zu den Operationen in Version 2 der API.
es: `Pulse aquí <../swagger/v0002.html>`_ para obtener detalles de las operaciones de API de la versión 2.
fr: `Cliquez ici <../swagger/v0002.html>`_ pour plus de détails sur les opérations de la version 2 de l'API.
ko: `<../swagger/v0002.html>을(를) 클릭`하여 버전 2 API 오퍼레이션의 세부사항을 보십시오.
pt_br: `Clique aqui <../swagger/v0002.html>`_ para obter detalhes das operações da API Versão 2.

source: IoT Foundation API Version 1
es: API de IoT Foundation Versión 1
fr: API IoT Foundation version 1
ko: IoT Foundation API 버전 1
pt_br: API do IoT Foundation Versão 1

source: Version 1 of the API is still supported, however, some of the operations cannot be performed using version 1 of the API and others are performed using different API paths.
de: Version 1 der API wird zwar weiterhin unterstützt, manche Operationen können jedoch nicht mit Version 1 der API ausgeführt werden, andere können nur mit abweichenden API-Pfaden ausgeführt werden.
es: La versión 1 de la API sigue siendo compatible; sin embargo, no se pueden realizar parte de las operaciones con la versión 1 de la API y otras se realizarán utilizando otras vías de acceso de la API.
fr: La version 1 de l'API reste prise en charge. Toutefois, certaines opérations ne peuvent pas être effectuées avec la version 1 et d'autres sont effectuées à l'aide de chemins d'API différents.
ko: 버전 1의 API가 계속 지원되지만, 일부 오퍼레이션은 버전 1의 API를 통해 수행될 수 없고 기타의 경우 다른 API 경로를 통해 수행됩니다.
pt_br: A versão 1 da API ainda é suportada, entretanto, algumas das operações não podem ser executadas usando a versão 1 da API e outras são executadas usando diferentes caminhos de API.

source: Restrictions of version 1 of the IoT Foundation API:
de: Einschränkungen der Version 1 der IoT Foundation-API:
es: Limitaciones de versión 1 de la API de Fundación IoT.
fr: Restrictions liées à la version 1 de l'API IoT Foundation :
ko: IoT Foundation API 버전 1의 제한사항
pt_br: Restrições da versão 1 da PI do IoT Foundation:

source: Many of the API paths relating to devices have changed.
de: Viele API-Pfade, die Einheiten betreffen, haben sich geändert.
es: Muchas de las vías de acceso de la API a los dispositivos han cambiado.
fr: De nombreux chemins d'API ont été modifiés pour les terminaux.
ko: 디바이스와 관련한 다수의 API 경로가 변경되었습니다.
pt_br: Muitos dos caminhos de API relacionados aos dispositivos foram alterados.

source: Version 1 of the API does not support any device type operations, other than listing all device types.
de: Von Version 1 der API werden bis auf die Auflistung aller Einheitentypen keine Operationen für den Einheitentyp unterstützt.
es: La versión 1 de la API no admite todas las operaciones de tipo de dispositivo excepto la de listar todos los tipos de dispositivo.
fr: La version 1 de l'API ne prend en charge aucune opération relative aux types de terminaux, à l'exception de l'affichage de tous les types de terminaux.
ko: 버전 1의 API는 모든 디바이스 유형을 나열하지만 임의의 디바이스 유형 오퍼레이션을 지원하지는 않습니다.
pt_br: A versão 1 da API não suporta nenhuma operação de tipo de dispositivo, além da listagem de todos os tipos de dispositivos.

source: Operations related to device management, device management requests, diagnostic information, or location cannot be performed using version 1 of the API.
de: Operationen, die das Einheitenmanagement, Einheitenmanagementanforderungen, Diagnoseinformationen oder die Position betreffen, können mit Version 1 der API nicht ausgeführt werden.
es: Las operaciones relacionadas con la gestión de dispositivos, las solicitudes de gestión de dispositivos, información de diagnóstico o ubicación no se pueden realizar con la versión 1 de la API.
fr: Les opérations relatives à la gestion des terminaux, aux demandes de gestion des terminaux, aux informations de diagnostic ou à l'emplacement ne peuvent pas être effectuées à l'aide de la version 1 de l'API.
ko: 디바이스 관리, 디바이스 관리 요청, 진단 정보 또는 위치와 관련된 오퍼레이션은 API 버전 1을 사용하여 수행될 수 없습니다.
pt_br: As operações relacionadas ao gerenciamento de dispositivo, solicitações do gerenciamento de dispositivo, informações de diagnóstico ou local não podem ser executadasusando a versão 1 daAPI.

source: `Click here <../swagger/v0001.html>`_ for details of the Version 1 API operations.
de: `Klicken Sie hier <../swagger/v0001.html>`_ für Details zu den Operationen in Version 1 der API.
es: `Pulse aquí <../swagger/v0001.html>`_ para obtener detalles de las operaciones de API de la versión 1.
fr: `Cliquez ici <../swagger/v0001.html>`_ pour plus de détails sur la version 1 de l'API.
ko: `<../swagger/v0001.html>을(를) 클릭하여` 버전 1 API 오퍼레이션의 세부사항을 보십시오.
pt_br: `Clique aqui <../swagger/v0001.html>`_ para obter detalhes das operações da API Versão 1 API.
