Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/c_sharp_devices.po
Languages: es

source: C# Client Library - Devices
es: Biblioteca de cliente de C# - Dispositivos

source: Introduction
es: Introducción

source: This client library describes how to use devices with the C# ibmiotf module. For help with getting started with this module, see `C Sharp Client Library - Introduction <../libraries/c_sharp_introduction.html#/>`_\.
es: Esta biblioteca de cliente describe cómo utilizar dispositivos con el módulo C# ibmiotf. Para obtener ayuda para empezar a utilizar este módulo, consulte ` Biblioteca de cliente C# - Introducción <../libraries/c_sharp_introduction.html#/>`_\.

source: This client library is divided into two sections, both included within the library. This section contains information on how devices publish events and handle commands using the C# ibmiotf module. The Applications section contains information on how applications can use the ibmiotf module to interact with devices.
es: Esta biblioteca de cliente se divide en dos secciones, ambas incluidas en la biblioteca. Esta sección contiene información sobre cómo publican los dispositivos los sucesos y manejan los mandatos utilizando el módulo C# ibmiotf. La sección Aplicaciones contiene información sobre cómo pueden utilizar el módulo ibmiotf para interactuar con los dispositivos.

source: The constructor builds the client instance, and accepts arguments containing the following definitions:
es: El constructor crea la instancia de cliente y acepta argumentos que contienen las definiciones siguientes:

source: orgId - Your organization ID.
es: orgId - ID de organización.

source: deviceType - The type of your device.
es: deviceType - Tipo del dispositivo.

source: deviceId - The ID of your device.
es: deviceId - ID del dispositivo.

source: auth-method - Method of authentication (the only value currently supported is “token”).
es: auth-method - Método de autenticación (el único valor admitido actualmente es "token").

source: auth-token - API key token (required if auth-method is “token”).
es: auth-token - Señal de clave de API (necesario si auth-method es "token").

source: If deviceId and deviceType are provided, the client will connect to the Internet of Things Foundation Quickstart, and default to an unregistered device. The argument lists creates definitions which are used to interact with the Internet of Things Foundation module.
es: Si solo se suministran deviceId y deviceType, el cliente se conectará con el servicio Quickstart de Internet of Things Foundation y de forma predeterminada con un dispositivo sin registrar. Las listas de argumentos crean definiciones que se utilizan para interactuar con el módulo Internet of Things Foundation.

source: Publishing events
es: Publicación de sucesos

source: Events are the mechanism by which devices publish data to the Internet of Things Foundation. The device controls the content of the event and assigns a name for each event it sends.
es: Los sucesos son el mecanismo mediante el cual los dispositivos publican datos en Internet of Things Foundation. El dispositivo controla el contenido del suceso y asigna un nombre para cada suceso que envía.

source: When an event is received by the IoT Foundation the credentials of the connection on which the event was received are used to determine which device sent the event. With this architecture it is impossible for a device to impersonate another device.
es: Cuando IoT Foundation recibe un suceso, las credenciales de la conexión en la que se ha recibido el suceso se utilizan para determinar qué dispositivo envió el suceso. Con esta arquitectura, es imposible que un dispositivo pueda representar a otro dispositivo.

source: Events can be published at any of the three `quality of service (QoS) levels <../mqtt.html#/qoslevels>`_, defined by the MQTT protocol. By default events will be published as QoS level 0.
es: Los sucesos se pueden publicar en cualquiera de los sucesos de los niveles de calidad de servicio (QoS) <../mqtt.html#/qoslevels>`_, definidos por el protocolo MQTT. De forma predeterminada, los sucesos se publicarán con el nivel de QoS 0.

source: Publish event using default quality of service
es: Publicar suceso utilizando calidad de servicio predeterminada

source: Publish event using user-defined quality of service
es: Publicar suceso utilizando calidad de servicio definida por el usuario

source: Events can be published at higher MQTT quality of service levels, but events published at QoS levels above 0 may be slower then QoS 0 events, because of the extra confirmation of receipt used in QoS levels above 0.
es: Los sucesos se pueden publicar con niveles de calidad de servicio de MQTT más altos, pero los sucesos publicados con un nivel de calidad de servicio por encima de 0 pueden ser más lento que los sucesos del QoS 0, debido a la confirmación de recibo adicional que utilizan los niveles de calidad de servicio por encima de 0.

source: Handling commands
es: Manejo de mandatos

source: When the device client connects, it automatically subscribes to any commands for this device. To process specific commands, you must register a command callback method.
es: Cuando el cliente de dispositivo se conecta, se suscribe automáticamente a todos los mandatos para este dispositivo. Para procesar mandatos específicos, debe registrar un método de devolución de llamada de mandato.
