Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/c_sharp_introduction.po
Languages: de, es, it, ja, pt_br, zh_cn, zh_tw

source: C# Client Library - Introduction
de: C#-Clientbibliothek - Einführung
es: Biblioteca de cliente de C# - Introducción
it: Libreria client C# - Introduzione
ja: C# クライアント・ライブラリー - 概要
pt_br: Biblioteca do Cliente C# - Introdução
zh_cn: C# 客户机库 - 简介
zh_tw: C# 用戶端程式庫 - 簡介

source: Use the C# module for interacting with the `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com/>`_ . The module can be used to simplify interactions with the IBM Internet of Things Foundation. This library contains instructions to use the C# module to interact with devices and applications within your organizations.
de: Verwenden Sie das C#-Modul zur Interaktion mit `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com/>`_ . Das Modul kann zur Vereinfachung der Interaktionen mit IBM Internet of Things Foundation verwendet werden. Diese Bibliothek enthält Anweisungen zur Verwendung des C#-Moduls für die Interaktion mit Geräten und Anwendungen in Ihrer Organisation.
es: Utilice el módulo C# para interactuar con `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com/>`_. El módulo se puede utilizar para simplificar las interacciones con IBM Internet of Things Foundation. Esta biblioteca contiene instrucciones para utilizar el módulo C# para interactuar con dispositivos y aplicaciones dentro de las organizaciones.
it: Utilizzare il modulo C# per interagire con `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com/>`_ . Il modulo può essere utilizzato per semplificare le interazioni con IBM Internet of Things Foundation. Questa libreria contiene le istruzioni per utilizzare il modulo C# per interagire con i dispositivi e le applicazioni all'interno dell'organizzazione.
ja: C# モジュールを使用して `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com/>`_ と対話します。このモジュールを使用すると、IBM Internet of Things Foundation との対話を簡略化できます。以下のライブラリーには、C# モジュールを使用して組織内のデバイスやアプリケーションと対話する方法についての手順が含まれています。
pt_br: Use o módulo C# para interagir com o `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com/>`_. O módulo pode ser usado para simplificar interações com o IBM Internet of Things Foundation. Esta biblioteca contém instruções para utilizar o módulo C# para interagir com dispositivos e aplicativos em suas organizações.
zh_cn: 使用 C# 模块与 `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com/>`_ 进行交互。此模块可用于简化与 IBM Internet of Things Foundation 的交互。此库中包含有关使用 C# 模块与组织内的设备和应用程序进行交互的指示信息。
zh_tw: 您可以使用 C# 模組與 `IBM Internet of Things Foundation<https://internetofthings.ibmcloud.com/>`_ 互動。該模組可用來簡化與 IBM Internet of Things Foundation 的互動。此程式庫包含使用 C# 模組與組織內的裝置和應用程式互動的指示。

source: `C# library <https://github.com/IoT-Analytics/iot-csharp>`_
de: `C#-Clientbibliothek <https://github.com/IoT-Analytics/iot-csharp>`_
es: `Biblioteca C# <https://github.com/IoT-Analytics/iot-csharp>`_
it: `Libreria C# <https://github.com/IoT-Analytics/iot-csharp>`_
ja: `C# ライブラリー <https://github.com/IoT-Analytics/iot-csharp>`_
pt_br: `Biblioteca C# <https://github.com/IoT-Analytics/iot-csharp>`_
zh_cn: `C# 库 <https://github.com/IoT-Analytics/iot-csharp>`_
zh_tw: `C# 程式庫<https://github.com/IoT-Analytics/iot-csharp>`_

source: This client library is divided into two sections, both included within the library. The Devices section contains information on how devices publish events and handle commands using the C# ibmiotf module, and the Applications section contains information on how applications can use the ibmiotf module to interact with devices.
de: Diese Clientbibliothek ist in zwei Abschnitte unterteilt, die beide in der Bibliothek enthalten sind. Der Abschnitt mit den Geräte enthält Informationen dazu, wie Geräte Ereignisse publizieren und Befehle mit dem C#-Modul ibmiotf verarbeiten. Der Abschnitt mit den Anwendungen enthält Informationen, wie Anwendungen das ibmiotf-Modul zur Interaktion mit Geräte verwenden können.
es: Esta biblioteca de cliente se divide en dos secciones, ambas incluidas en la biblioteca. La sección Dispositivos contiene información sobre cómo los dispositivos publican sucesos y manejan mandatos utilizando el módulo de C# ibmiotf y la sección Aplicaciones contiene información sobre cómo las aplicaciones pueden utilizar el módulo ibmiotf para interactuar con los dispositivos.
it: Questa libreria client è divisa in due sezioni, entrambe incluse all'interno della libreria. La sezione Dispositivi contiene informazioni su come i dispositivi pubblicano gli eventi e gestiscono i comandi tramite l'utilizzo del modulo C# ibmiotf, e la sezione Applicazioni contiene informazioni su come le applicazioni possono utilizzare il modulo ibmiotf per interagire con i dispositivi.
ja: このクライアント・ライブラリーは、それぞれがライブラリー内に組み込まれた 2 つのセクションに分割されます。「デバイス」セクションには、デバイスで C# ibmiotf モジュールを使用してイベントのパブリッシュとコマンドの処理を行う方法についての情報が含まれ、「アプリケーション」セクションには、アプリケーションで ibmiotf モジュールを使用してデバイスと対話する方法についての情報が含まれています。
pt_br: Esta biblioteca do cliente é dividida em duas seções, ambas incluídas na biblioteca. A seção Dispositivos contém informações sobre como os dispositivos publicam eventos e manipulam comandos usando o módulo ibmiotf do C# e a seção Aplicativos contém informações sobre como os aplicativos podem usar o módulo ibmiotf para interagir com dispositivos.
zh_cn: 此客户机库分为两部分（均包含在该库中）。“设备”部分包含有关设备如何使用 C# ibmiotf 模块发布事件和处理命令的信息；“应用程序”部分包含有关应用程序如何使用 ibmiotf 模块来与设备进行交互的信息。
zh_tw: 此用戶端程式庫分成兩個區段，都內含在程式庫中。「裝置」區段包含裝置如何使用 C# ibmiotf 模組發佈事件及處理指令的相關資訊，「應用程式」區段則包含應用程式如何使用 ibmiotf 模組與裝置互動的相關資訊。

source: Documentation
de: Dokumentation
es: Documentación
it: Documentazione
ja: 資料
pt_br: Documentação
zh_cn: 文档
zh_tw: 文件

source: `Device Client <../libraries/c_sharp_devices.html#/>`_
de: `Geräteclient <../libraries/c_sharp_devices.html#/>`_
es: `Cliente de dispositivo <../libraries/c_sharp_devices.html#/>`_
it: `Client dispositivo <../libraries/c_sharp_devices.html#/>`_
ja: `デバイス・クライアント <../libraries/c_sharp_devices.html#/>`_
pt_br: `Cliente do Dispositivo <../libraries/c_sharp_devices.html#/>`_
zh_cn: `设备客户机 <../libraries/c_sharp_devices.html#/>`_
zh_tw: `裝置用戶端 <../libraries/c_sharp_devices.html#/>`_

source: `Application Client <../libraries/c_sharp_applications.html#/>`_
de: `Anwendungsclient <../libraries/c_sharp_applications.html#/>`_
es: Cliente de aplicaciones <../libraries/c_sharp_applications.html#/>`_
it: `Client applicazione <../libraries/c_sharp_applications.html#/>`_
ja: `アプリケーション・クライアント <../libraries/c_sharp_applications.html#/>`_
pt_br: `Aplicativo Cliente <../libraries/c_sharp_applications.html#/>`_
zh_cn: `应用程序客户机 <../libraries/c_sharp_applications.html#/>`_
zh_tw: `應用程式用戶端 <../libraries/c_sharp_applications.html#/>`_

source: Dependencies
de: Abhängigkeiten
es: Dependencias
it: Dipendenze
ja: 従属関係
pt_br: Dependências
zh_cn: 依赖关系
zh_tw: 相依關係

source: `paho-mqtt <http://www.eclipse.org/paho/clients/dotnet/>`_ provides a client class which enable applications to connect to an MQTT broker
de: `paho-mqtt <http://www.eclipse.org/paho/clients/dotnet/>`_ - Bietet eine Clientklasse, mit der das Verbinden von Anwendungen mit einem MQTT-Broker ermöglicht wird
es: `paho-mqtt <http://www.eclipse.org/paho/clients/dotnet/>`_ proporciona una clase de cliente que permite a las aplicaciones conectarse a un intermediario MQTT
it: `paho-mqtt <http://www.eclipse.org/paho/clients/dotnet/>`_ fornisce una classe client che consente alle applicazioni di connettersi a un broker MQTT
ja: `paho-mqtt <http://www.eclipse.org/paho/clients/dotnet/>`_ アプリケーションの MQTT ブローカーへの接続を可能にするクライアント・クラスを提供します。
pt_br: `paho-mqtt <http://www.eclipse.org/paho/clients/dotnet/>`_ fornece uma classe de cliente que permite que os aplicativos se conectem a um broker MQTT
zh_cn: `paho-mqtt <http://www.eclipse.org/paho/clients/dotnet/>`_ 提供了用于将应用程序连接到 MQTT 代理程序的客户机类
zh_tw: `paho-mqtt <http://www.eclipse.org/paho/clients/dotnet/>`_ 提供了一個用戶端類別，可讓應用程式連接至 MQTT 分配管理系統

source: `Apache Commons Logging <https://logging.apache.org/log4net/>`_ library for logging various information
de: `Apache Commons Logging <https://logging.apache.org/log4net/>`_ Bibliothek zum Protokollieren verschiedener Informationen
es: `Apache Commons Logging <https://logging.apache.org/log4net/>`_, biblioteca para registrar información diversa
it: `Apache Commons Logging <https://logging.apache.org/log4net/>`_, libreria per registrare informazioni varie
ja: `Apache Commons Logging <https://logging.apache.org/log4net/>`_ さまざまな情報をログに記録するためのライブラリー
pt_br: Biblioteca do `Apache Commons Logging <https://logging.apache.org/log4net/>`_ para a criação de log de várias informações
zh_cn: 用于记录各种信息的 `Apache Commons Logging <https://logging.apache.org/log4net/>`_ 库
zh_tw: `Apache Commons Logging <https://logging.apache.org/log4net/>`_ 程式庫，用於記載各種不同的資訊
