Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/programmingguides.po
Languages: es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: Programming Guides
es: Guías de programación
fr: Guides de programmation
it: Guide alla programmazione
ja: プログラミング・ガイド
ko: 프로그래밍 안내
pt_br: Guias de Programação
zh_cn: 编程指南
zh_tw: 程式設計手冊

source: There are several client libraries availabe for use with the Internet of Things Foundation. The client libraries are designed to allow users to interact with their devices and applications using their preferred language, and to simplify this interaction as much as possible.
es: Hay varias bibliotecas de cliente disponibles para utilizarse con Internet of Things Foundation. Las bibliotecas de cliente están diseñadas para permitir a los usuarios interactuar con los dispositivos y las aplicaciones utilizando el idioma preferido y para simplificar esta interacción lo máximo posible.
fr: Plusieurs bibliothèques client peuvent être utilisées avec Internet of Things Foundation. Ces bibliothèques sont conçues pour permettre aux utilisateurs d'interagir avec leurs terminaux et leurs applications à l'aide de leur langage préféré et pour simplifier autant que possible cette interaction.
ja: Internet of Things Foundation と一緒に使用できるクライアント・ライブラリーはいくつかあります。クライアント・ライブラリーは、ユーザーが自分の優先言語を使用してデバイスおよびアプリケーションと対話し、この対話をできるだけ簡略化できるように設計されています。
ko: Internet of Things Foundation과 함께 사용할 수 있는 여러 클라이언트 라이브러리가 있습니다. 클라이언트 라이브러리는 사용자가 선호하는 언어로 디바이스 및 애플리케이션과 상호작용하도록 허용하고 이 상호작용을 최대한 간소화하도록 디자인되었습니다.
pt_br: Há várias bibliotecas do cliente disponíveis para uso com o Internet of Things Foundation. As bibliotecas do cliente são projetadas para permitir que os usuários interajam com seus dispositivos e aplicativos usando seu idioma preferencial e para simplificar essa interação o máximo possível.
zh_cn: 提供了多个可用于 Internet of Things Foundation 的客户机库。这些客户机库旨在允许用户使用其首选语言与设备和应用程序交互，还可以尽可能简化这种交互。
zh_tw: 有數個用戶端程式庫可與 Internet of Things Foundation 搭配使用。這些用戶端程式庫的設計目的，是讓使用者可以使用他們偏好的語言與其裝置和應用程式互動，並盡可能簡化此互動。

source: There are also specific device and operation recipes available for use with the Internet of Things Foundation hosted on the `developerWorks Recipes <https://developer.ibm.com/recipes/?post_type=tutorials&s=IoTF>`__.
es: También hay recetas específicas de operaciones y dispositivos que pueden utilizarse con Internet of Things Foundation en `developerWorks Recipes <https://developer.ibm.com/recipes/?post_type=tutorials&s=IoTF>`__.
fr: Vous pouvez également utiliser des recettes applicables à des opérations et à des terminaux spécifiques avec Internet of Things Foundation, comme indiqué sur le site `developerWorks Recipes <https://developer.ibm.com/recipes/?post_type=tutorials&s=IoTF>`__.
ja: Internet of Things Foundation で利用できる特定のデバイスや操作のレシピが、`developerWorks のレシピ <https://developer.ibm.com/recipes/?post_type=tutorials&s=IoTF>`__ でホストされています。
ko: 또한 `developerWorks 레시피 <https://developer.ibm.com/recipes/?post_type=tutorials&s=IoTF>`__에서 호스트된 Internet of Things Foundation으로 사용할 수 있는 특정 디바이스 및 오퍼레이션 레시피가 있습니다.
pt_br: Existem também dispositivos específicos e receitas de operação disponíveis para uso com o Internet of Things Foundation hospedado no `Receitas do developerWorks <https://developer.ibm.com/recipes/?post_type=tutorials&s=IoTF>`__.
zh_cn: 同时还提供了可用于 Internet of Things Foundation（在 `developerWorks Recipes <https://developer.ibm.com/recipes/?post_type=tutorials&s=IoTF>`__ 上托管）的特定设备和操作配方。
zh_tw: 此外，也有特定的裝置和作業秘訣可用於 Internet of Things Foundation，請參閱 `developerWorks Recipes <https://developer.ibm.com/recipes/?post_type=tutorials&s=IoTF>`__。

source: In the event that you cannot find a programming guide or recipe to suit your environment or device, raw MQTT should be used to communicate with the Internet of Things Foundation. For more information, please see `MQTT <../messaging/mqtt.html#/>`__ and `MQTT Connectivity for Devices <../messaging/devices.html#/>`__.
es: Si no puede encontrar una receta o guía de programación que se adapte a su entorno o dispositivo, utilice MQTT sin formato para comunicarse con Internet of Things Foundation. Para obtener más información, consulte `MQTT <../messaging/mqtt.html#/>`__ y `Conectividad de MQTT para dispositivos <../messaging/devices.html#/>`__.
fr: Si vous ne trouvez pas de guides de programmation ou de recettes adaptés à votre environnement ou à votre terminal, vous devez utiliser une connectivité MQTT brute pour communiquer avec Internet of Things Foundation. Pour plus d'informations, voir `MQTT <../messaging/mqtt.html#/>`__ et `Connectivité MQTT pour les terminaux <../messaging/devices.html#/>`__.
ja: 環境やデバイスに合ったプログラミングのガイドやレシピが見つからない場合は、未加工の MQTT を使用して Internet of Things Foundation と通信する必要があります。詳細情報は、`「MQTT」<../messaging/mqtt.html#/>`__と`MQTT デバイス接続 <../messaging/devices.html#/>`__を参照してください。
ko: 해당 환경 또는 디바이스에 맞는 프로그래밍 안내서 또는 레시피를 찾을 수 없는 경우, Internet of Things Foundation과 통신하는 데 기본 MQTT를 사용해야 합니다. 자세한 정보는 `MQTT <../messaging/mqtt.html#/>`__ 및 `디바이스용 MQTT 연결 <../messaging/devices.html#/>`__의 내용을 참조하십시오.
pt_br: No caso de você não puder localizar um guia de programação ou receita para adequar seu ambiente ou dispositivo, o MQTT bruto deve ser utilizado para se comunicar com o Internet of Things Foundation. Para obter mais informações, consulte `MQTT <../messaging/mqtt.html#/>`__ e ` Conectividade MQTT para Dispositivos < ../messaging/devices.html#/>`__.
zh_cn: 如果您找不到适合环境或设备的规划指南或诀窍，那么应使用原始 MQTT 与 Internet of Things Foundation 通信。有关更多信息，请参阅 `MQTT <../messaging/mqtt.html#/>`__ 和 `设备的 MQTT 连接 <../messaging/devices.html#/>`__。
zh_tw: 如果您找不到適用於您的環境或裝置的程式設計手冊或秘訣，則應使用原始 MQTT 與 Internet of Things Foundation 通訊。如需相關資訊，請參閱 `MQTT <../messaging/mqtt.html#/>`__和`裝置的 MQTT 連線功能<../messaging/devices.html#/>`__。

source: `Introduction <../libraries/python.html#/>`__
es: `Introducción <../libraries/python.html#/>`__
it: `Introduzione <../libraries/python.html#/>`__
ja: `概要 <../libraries/python.html#/>`__
ko: `소개 <../libraries/python.html#/>`__
pt_br: Introdução <../libraries/python.html#/>`__
zh_cn: `简介 <../libraries/python.html#/>`__
zh_tw: `簡介 <../libraries/python.html#/>`__

source: `Documentation for device developers <../libraries/python_cli_for_devices.html#/>`__
es: `Documentación para desarrolladores de dispositivos <../libraries/python_cli_for_devices.html#/>`__
fr: `Documentation pour les développeurs de terminaux <../libraries/python_cli_for_devices.html#/>`__
it: `Documentazione per gli sviluppatori dispositivo <../libraries/python_cli_for_devices.html#/>`__
ja: `デバイス開発者用の資料 <../libraries/python_cli_for_devices.html#/>`__
ko: `디바이스 개발자용 문서 <../libraries/python_cli_for_devices.html#/>`__
pt_br: `Documentação para desenvolvedores de dispositivos <../libraries/python_cli_for_devices.html#/>`__
zh_cn: `面向设备开发者的文档 <../libraries/python_cli_for_devices.html#/>`__
zh_tw: `裝置開發人員的文件 <../libraries/python_cli_for_devices.html#/>`__

source: `Documentation application developers <../libraries/python_cli_for_apps.html#/>`__
es: `Documentación para desarrolladores de aplicaciones <../libraries/python_cli_for_apps.html#/>`__
fr: `Documentation pour les développeurs d'applications <../libraries/python_cli_for_apps.html#/>`__
it: `Documentazione per gli sviluppatori applicazione <../libraries/python_cli_for_apps.html#/>`__
ja: `アプリケーション開発者用の資料 <../libraries/python_cli_for_apps.html#/>`__
ko: `문서 애플리케이션 개발자 <../libraries/python_cli_for_apps.html#/>`__
pt_br: `Documentação para desenvolvedores de aplicativos <../libraries/python_cli_for_apps.html#/>`__
zh_cn: `面向应用程序开发者的文档 <../libraries/python_cli_for_apps.html#/>`__
zh_tw: `應用程式開發人員的文件 <../libraries/python_cli_for_apps.html#/>`__

source: `See the code in GitHub <https://github.com/ibm-messaging/iot-python>`_
es: `Consulte el código en GitHub <https://github.com/ibm-messaging/iot-python>`_
fr: `Reportez-vous au code disponible dans GitHub <https://github.com/ibm-messaging/iot-python>`_
it: `Consultare il codice in GitHub <https://github.com/ibm-messaging/iot-python>`_
ja: `GitHub にあるコードを参照 <https://github.com/ibm-messaging/iot-python>`_
ko: `GitHub의 코드 참조 <https://github.com/ibm-messaging/iot-python>`_
pt_br: `Consulte o código em GitHub <https://github.com/ibm-messaging/iot-python>`_
zh_cn: `请参阅 GitHub 中的代码 <https://github.com/ibm-messaging/iot-python>`_
zh_tw: `請參閱 GitHub 中的程式碼 <https://github.com/ibm-messaging/iot-python>`_

source: Embedded C
it: C integrato
ko: 임베디드 C
pt_br: C Integrado
zh_cn: 嵌入式 C
zh_tw: 嵌入式 C

source: `Documentation <../libraries/embedded_c.html#/>`__
es: `Documentación <../libraries/embedded_c.html#/>`__
it: `Documentazione <../libraries/embedded_c.html#/>`__
ja: `資料 <../libraries/embedded_c.html#/>`__
ko: `문서 <../libraries/embedded_c.html#/>`__
pt_br: `Documentação <../libraries/embedded_c.html#/>`__
zh_cn: `文档 <../libraries/embedded_c.html#/>`__
zh_tw: `文件 <../libraries/embedded_c.html#/>`__

source: `See the code in GitHub <https://github.com/ibm-messaging/iotf-embeddedc>`_
es: `Consulte el código en GitHub <https://github.com/ibm-messaging/iotf-embeddedc>`_
fr: `Reportez-vous au code disponible dans GitHub <https://github.com/ibm-messaging/iotf-embeddedc>`_
it: `Consultare il codice in GitHub <https://github.com/ibm-messaging/iotf-embeddedc>`_
ja: `GitHub にあるコードを参照 <https://github.com/ibm-messaging/iotf-embeddedc>`_
ko: `GitHub의 코드 참조 <https://github.com/ibm-messaging/iotf-embeddedc>`_
pt_br: `Consulte o código em GitHub <https://github.com/ibm-messaging/iotf-embeddedc>`_
zh_cn: `请参阅 GitHub 中的代码 <https://github.com/ibm-messaging/iotf-embeddedc>`_
zh_tw: `請參閱 GitHub 中的程式碼 <https://github.com/ibm-messaging/iotf-embeddedc>`_

source: `Introduction <../java/javaintro.html#/>`__
es: `Introducción <../java/javaintro.html#/>`__
it: `Introduzione <../java/javaintro.html#/>`__
ja: `概要 <../java/javaintro.html#/>`__
ko: `소개 <../java/javaintro.html#/>`__
pt_br: `Introdução <../java/javaintro.html#/>`__
zh_cn: `简介 <../java/javaintro.html#/>`__
zh_tw: `簡介 <../java/javaintro.html#/>`__

source: `Documentation for device developers <../java/java_cli_devices.html#/>`__
es: `Documentación para desarrolladores de dispositivos <../java/java_cli_devices.html#/>`__
fr: `Documentation pour les développeurs de terminaux <../java/java_cli_devices.html#/>`__
it: `Documentazione per gli sviluppatori dispositivo <../java/java_cli_devices.html#/>`__
ja: `デバイス開発者用の資料 <../java/java_cli_devices.html#/>`__
ko: `디바이스 개발자용 문서 <../java/java_cli_devices.html#/>`__
pt_br: `Documentação para desenvolvedores de dispositivos <../java/java_cli_devices.html#/>`__
zh_cn: `面向设备开发者的文档 <../java/java_cli_devices.html#/>`__
zh_tw: `裝置開發人員的文件 <../java/java_cli_devices.html#/>`__

source: `See the code in GitHub <https://github.com/ibm-messaging/iot-java>`_
es: `Consulte el código en GitHub <https://github.com/ibm-messaging/iot-java>`_
fr: `Reportez-vous au code disponible dans GitHub <https://github.com/ibm-messaging/iot-java>`_
it: `Consultare il codice in GitHub <https://github.com/ibm-messaging/iot-java>`_
ja: `GitHub にあるコードを参照 <https://github.com/ibm-messaging/iot-java>`_
ko: `GitHub의 코드 참조 <https://github.com/ibm-messaging/iot-java>`_
pt_br: `Consulte o código em GitHub <https://github.com/ibm-messaging/iot-java>`_
zh_cn: `请参阅 GitHub 中的代码 <https://github.com/ibm-messaging/iot-java>`_
zh_tw: `請參閱 GitHub 中的程式碼 <https://github.com/ibm-messaging/iot-java>`_

source: `Introduction <../nodejs/node-js_intro.html#/>`__
es: `Introducción <../nodejs/node-js_intro.html#/>`__
it: `Introduzione <../nodejs/node-js_intro.html#/>`__
ja: `概要 <../nodejs/node-js_intro.html#/>`__
ko: `소개 <../nodejs/node-js_intro.html#/>`__
pt_br: `Introdução <../nodejs/node-js_intro.html#/>`__
zh_cn: `简介 <../nodejs/node-js_intro.html#/>`__
zh_tw: `簡介 <../nodejs/node-js_intro.html#/>`__

source: `Documentation for device developers <../nodejs/node-js_devices.html#/>`__
es: `Documentación para desarrolladores de dispositivos <../nodejs/node-js_devices.html#/>`__
fr: `Documentation pour les développeurs de terminaux <../nodejs/node-js_devices.html#/>`__
it: `Documentazione per gli sviluppatori dispositivo <../nodejs/node-js_devices.html#/>`__
ja: `デバイス開発者用の資料 <../nodejs/node-js_devices.html#/>`__
ko: `디바이스 개발자용 문서 <../nodejs/node-js_devices.html#/>`__
pt_br: `Documentação para desenvolvedores de dispositivos <../nodejs/node-js_devices.html#/>`__
zh_cn: `面向设备开发者的文档 <../nodejs/node-js_devices.html#/>`__
zh_tw: `裝置開發人員的文件 <../nodejs/node-js_devices.html#/>`__

source: `Documentation for application developers <../nodejs/node-js_applications.html#/>`__
es: `Documentación para desarrolladores de aplicaciones <../nodejs/node-js_applications.html#/>`__
fr: `Documentation pour les développeurs d'applications <../nodejs/node-js_applications.html#/>`__
it: `Documentazione per gli sviluppatori applicazione <../nodejs/node-js_applications.html#/>`__
ja: `アプリケーション開発者用の資料 <../nodejs/node-js_applications.html#/>`__
ko: `애플리케이션 개발자용 문서 <../nodejs/node-js_applications.html#/>`__
pt_br: `Documentação para desenvolvedores de aplicativos <../nodejs/node-js_applications.html#/>`__
zh_cn: `面向应用程序开发者的文档 <../nodejs/node-js_applications.html#/>`__
zh_tw: `應用程式開發人員的文件 <../nodejs/node-js_applications.html#/>`__

source: `See the code in GitHub <https://github.com/ibm-messaging/iot-nodejs>`_
es: `Consulte el código en GitHub <https://github.com/ibm-messaging/iot-nodejs>`_
fr: `Reportez-vous au code disponible dans GitHub <https://github.com/ibm-messaging/iot-nodejs>`_
it: `Consultare il codice in GitHub <https://github.com/ibm-messaging/iot-nodejs>`_
ja: `GitHub にあるコードを参照 <https://github.com/ibm-messaging/iot-nodejs>`_
ko: `GitHub의 코드 참조 <https://github.com/ibm-messaging/iot-nodejs>`_
pt_br: `Consulte o código em GitHub <https://github.com/ibm-messaging/iot-nodejs>`_
zh_cn: `请参阅 GitHub 中的代码 <https://github.com/ibm-messaging/iot-nodejs>`_
zh_tw: `請參閱 GitHub 中的程式碼 <https://github.com/ibm-messaging/iot-nodejs>`_

source: `Introduction <../libraries/c_sharp_introduction.html#/>`__
es: `Introducción <../libraries/c_sharp_introduction.html#/>`__
it: `Introduzione <../libraries/c_sharp_introduction.html#/>`__
ja: `概要 <../libraries/c_sharp_introduction.html#/>`__
ko: `소개 <../libraries/c_sharp_introduction.html#/>`__
pt_br: `Introdução <../libraries/c_sharp_introduction.html#/>`__
zh_cn: `简介 <../libraries/c_sharp_introduction.html#/>`__
zh_tw: `簡介 <../libraries/c_sharp_introduction.html#/>`__

source: `Documentation for device developers <../libraries/c_sharp_devices.html#/>`__
es: `Documentación para desarrolladores de dispositivos <../libraries/c_sharp_devices.html#/>`__
fr: `Documentation pour les développeurs de terminaux <../libraries/c_sharp_devices.html#/>`__
it: `Documentazione per gli sviluppatori dispositivo <../libraries/c_sharp_devices.html#/>`__
ja: `デバイス開発者用の資料 <../libraries/c_sharp_devices.html#/>`__
ko: `디바이스 개발자용 문서 <../libraries/c_sharp_devices.html#/>`__
pt_br: `Documentação para desenvolvedores de dispositivos <../libraries/c_sharp_devices.html#/>`__
zh_cn: `面向设备开发者的文档 <../libraries/c_sharp_devices.html#/>`__
zh_tw: `裝置開發人員的文件 <../libraries/c_sharp_devices.html#/>`__

source: `Documentation for application developers <../libraries/c_sharp_applications.html#/>`__
es: `Documentación para desarrolladores de aplicaciones <../libraries/c_sharp_applications.html#/>`__
fr: `Documentation pour les développeurs d'applications <../libraries/c_sharp_applications.html#/>`__
it: `Documentazione per gli sviluppatori applicazione <../libraries/c_sharp_applications.html#/>`__
ja: `アプリケーション開発者用の資料 <../libraries/c_sharp_applications.html#/>`__
ko: `애플리케이션 개발자용 문서 <../libraries/c_sharp_applications.html#/>`__
pt_br: `Documentação para desenvolvedores de aplicativos <../libraries/c_sharp_applications.html#/>`__
zh_cn: `面向应用程序开发者的文档 <../libraries/c_sharp_applications.html#/>`__
zh_tw: `應用程式開發人員的文件 <../libraries/c_sharp_applications.html#/>`__

source: There are several client libraries availabe for use with the Internet of Things Foundation. These are designed to allow users to interact with their devices and applications using their preferred language, and to simplify this interaction as much as possible.
it: Sono disponibili diverse librerie client da utilizzare con Internet of Things Foundation. Sono progettate per consentire agli utenti di interagire con i loro dispositivi e le loro applicazioni utilizzando la lingua preferita e per semplificare questa interazione il pi√π possibile.
