Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python_cli_for_api.po
Languages: de, es, fr, it, ja, ko

source: The response contains parameters and application needs to retrieve the dictionary *results* from the response to get the array of devices returned. Other parameters in the response are required to make further call, for example, the *_bookmark* element can be used to page through results. Issue the first request without specifying a bookmark, then take the bookmark returned in the response and provide it on the request for the next page. Repeat until the end of the result set indicated by the absence of a bookmark. Each request must use exactly the same values for the other parameters, or the results are undefined.
de: Die Antwort enthält Parameter, die von der Anwendung benötigt werden, um die Wörterverzeichnis*ergebnisse* aus der Antwort abzurufen und die zurückgegebene Gruppe von Geräten zu erhalten. Andere Parameter in der Antwort sind für weitere Aufrufe erforderlich, z. B. kann das Element *_bookmark* zum Blättern in den Ergebnissen verwendet werden. Setzen Sie die erste Anforderung ohne Angabe eines Lesezeichens ab, verwenden Sie dann das in der Antwort zurückgegebene Lesezeichen und geben Sie es in der Anforderung für die nächste Seite an. Wiederholen Sie diesen Vorgang, bis das Ende der Ergebnismenge erreicht ist. Dies wird dadurch gekennzeichnet, dass kein Lesezeichen vorhanden ist. Jede Anforderung muss genau dieselben Werte für die anderen Parameter verwenden, da andernfalls die Ergebnisse nicht definiert sind.
es: La respuesta contiene parámetros y la aplicación debe recuperar el diccionario *results* de la respuesta, para obtener la matriz de los dispositivos devueltos. Se requieren otros parámetros en la respuesta para realizar más llamadas, por ejemplo, el elemento *_bookmark* puede utilizarse para paginar por los resultados. Emita la primera solicitud sin especificar un marcador y, a continuación, devuelva el marcador en la respuesta y proporciónelo en la solicitud de la página siguiente. Repita este paso hasta el final del conjunto de resultados indicado por la ausencia de un marcador. Cada solicitud debe utilizar exactamente los mismos valores para los otros parámetros o los resultados no estarán definidos.
fr: La réponse contient des paramètres et l'application doit extraire les *résultats* du dictionnaire de la réponse pour obtenir le tableau de terminaux renvoyés. D'autres paramètres de la réponse sont nécessaires pour effectuer d'autres appels, par exemple l'élément *_bookmark* qui permet de parcourir les pages de résultats. Soumettez la première demande sans indiquer de signet, puis utilisez le signet renvoyé dans la réponse et indiquez-le dans la demande pour la page suivante. Répétez l'opération jusqu'à la fin de l'ensemble de résultats indiquée par l'absence de signet. Chaque demande doit utiliser exactement les mêmes valeurs pour les autres paramètres. Sinon, les résultats ne sont pas définis.
it: La risposta contiene i parametri e l'applicazione deve richiamare i *risultati* del dizionario dalla risposta per ottenere la schiera dei dispositivi restituiti. Nella risposta sono richiesti altri parametri per effettuare ulteriori chiamate, ad esempio l'elemento *_bookmark* può essere utilizzato per sfogliare i risultati. Emettere inizialmente la richiesta senza specificare un segnalibro, quindi fornire il segnalibro restituito nella risposta alla richiesta per la pagina successiva. Ripetere fino alla fine della serie di risultati, indicata dall'assenza di un segnalibro. Ciascuna richiesta deve utilizzare esattamente gli stessi valori per gli altri parametri, altrimenti i risultati saranno indefiniti.
ja: 応答にはパラメーターが含まれ、アプリケーションが応答からのディクショナリーの *results* を取得して返されるデバイスの配列を取得するために必要とします。応答のその他のパラメーターは、*_bookmark* 要素などを使用して結果をページ送りするために、さらに呼び出しを実行する場合に必要です。最初の要求はブックマークを指定しないで発行し、次に応答で返されるブックマークを取得して、次のページの要求で指定します。ブックマークがなくなることで示される結果セットの終わりまで繰り返します。各要求は、他のパラメーターと同じ値を正確に使用する必要があります。そうしないと結果が未定義になります。
ko: 응답에는 리턴된 디바이스의 어레이를 가져오기 위해 응답에서 사전 *results*를 검색하는 데 애플리케이션에 필요한 매개변수가 포함됩니다. 응답의 기타 매개변수는 추가 호출을 작성하는 데 필요합니다. 예를 들어, *_bookmark* 요소를 사용하여 페이지별로 결과를 볼 수 있습니다. 책갈피를 지정하지 않고 첫 번째 요청을 발행한 다음 응답에 리턴된 책갈피를 가져와서 그 다음 페이지에 대해 요청 시 제공하십시오. 책갈피의 부재로 표시된 결과 세트의 끝까지 반복하십시오. 각 요청은 기타 매개변수에 대해 정확히 동일한 값을 사용해야 합니다. 그렇지 않으면 결과가 정의되지 않습니다.

source: In order to pass the *_bookmark* or any other condition, the overloaded method must be used. The overloaded method takes the parameters in the form of a dictionary as shown below,
de: Für die Übergabe des Elements *_bookmark* oder einer anderen Bedingung muss die überladene Methode verwendet werden. Die überladene Methode verwendet die Parameter im Wörterverzeichnisformat, wie im Folgenden dargestellt,
es: Para poder pasar *_bookmark* o cualquier otra condición, debe utilizarse el método sobrecargado. El método sobrecargado utiliza parámetros con formato de diccionario como se muestra a continuación,
fr: Pour transmettre le paramètre *_bookmark* ou n'importe quelle autre condition, vous devez utiliser la méthode surchargée. La méthode surchargée utilise les paramètres sous la forme d'un dictionnaire, comme indiqué ci-dessous.
it: Per trasmettere *_bookmark* o qualsiasi altra condizione, è necessario utilizzare il metodo sottoposto a overload. Il metodo sottoposto a overload acquisisce i parametri nel formato di un dizionario, come mostrato di seguito.
ja: *_bookmark* またはその他の条件を渡すには、多重定義されたメソッドを使用する必要があります。多重定義されたメソッドは、以下に示すディクショナリーの形式でパラメーターを取得します。
ko: *_bookmark* 또는 임의의 기타 조건을 전달하려면 과부하된 메소드를 사용해야 합니다. 과부하된 메소드는 아래에 표시된 대로 사전의 양식으로 매개변수를 가져옵니다.

source: Add a Device Type
de: Gerätetyp hinzufügen
es: Añadir un tipo de dispositivo
fr: Ajout d'un type de terminal
it: Aggiungere un tipo di dispositivo
ja: デバイス・タイプの追加
ko: 디바이스 유형 추가

source: The *addDeviceType()* method can be used to register a device type to Internet of Things Foundation Connect. In each request, you must first define the device information, and device metadata elements which you want to be applied to all devices of this type. The device information element is comprised of several variables, including, serial number, manufacturer, model, class, description, firmware and hardware versions, and descriptive location. The metadata element is comprised of custom variables and values which can be defined by the user.
de: Die Methode *addDeviceType()* kann dazu verwendet werden, einen Gerätetyp in Internet of Things Foundation Connect zu registrieren. In jeder Anforderung müssen Sie zuerst die Geräteinformationen und die Gerätemetadatenelemente, die für alle Geräte dieses Typs angewendet werden sollen, definieren. Das Geräteinformationselement besteht aus mehreren Variablen, wie z. B. Seriennummer, Hersteller, Modell, Klasse, Beschreibung, Firmware- und Hardwareversion sowie beschreibender Standort. Das Metadatenelement besteht aus angepassten Variablen und Werten, die vom Benutzer definiert werden können.
es: Puede utilizarse el método *addDeviceType()* para registrar un tipo de dispositivo en Internet of Things Foundation Connect. En cada solicitud, primero debe definir la información del dispositivo y los elementos de metadatos de dispositivo que desea que se apliquen a todos los dispositivos de este tipo. El elemento de información de dispositivo está formado por varias variables, incluido el número de serie, el fabricante, el modelo, la clase, la descripción, las versiones de firmware y hardware, y una ubicación descriptiva. El elemento de metadatos está formado por variables y valores personalizados que puede definir el usuario.
fr: La méthode *addDeviceType()* permet d'enregistrer un type de terminal dans Internet of Things Foundation Connect. Dans chaque demande, vous devez d'abord définir les éléments deviceInfo et metadata que vous souhaitez appliquer à tous les terminaux de ce type. L'élément deviceInfo se compose de plusieurs variables, y compris le numéro de série, le fabricant, le modèle, la classe, la description, les versions du microprogramme et des composants matériels et la description de l'emplacement. L'élément metadata se compose de variables et de valeurs personnalisées qui peuvent être définies par l'utilisateur.
it: Il metodo *addDeviceType()* può essere utilizzato per registrare un tipo di dispositivo in Internet of Things Foundation Connect. In ogni richiesta, è necessario definire inizialmente le informazioni sul dispositivo e gli elementi dei metadati del dispositivo che si desidera applicare a tutti i dispositivi dello stesso tipo. L'elemento delle informazioni sul dispositivo consiste di diverse variabili, tra le quali numero di serie, produttore, modello, classe, descrizione, versioni di firmware e hardware e ubicazione descrittiva. L'elemento dei metadati consiste di variabili e valori personalizzati che possono essere definiti dall'utente.
ja: *addDeviceType()* メソッドを使用すると、Internet of Things Foundation Connect にデバイス・タイプを登録できます。各要求で、最初にデバイス情報と、このタイプのすべてのデバイスに適用するデバイスのメタデータ要素を定義する必要があります。デバイス情報の要素は複数の変数から構成され、シリアル番号、製造者、モデル、クラス、説明、ファームウェアとハードウェアのバージョン、およびロケーションのわかりやすい説明が含まれます。メタデータ要素は、ユーザーが定義できるカスタムの変数と値から構成されます。
ko: *addDeviceType()* 메소드는 Internet of Things Foundation 연결에 디바이스 유형을 등록하는 데 사용할 수 있습니다. 각 요청에서는 먼저 디바이스 정보와 이 유형의 모든 디바이스에 적용되도록 하려는 디바이스 메타데이터 요소를 정의해야 합니다. 디바이스 정보 요소는 일련 번호, 제조업체, 모델, 클래스, 설명, 펌웨어 및 하드웨어 버전과 설명 위치를 포함하여 몇몇 변수로 구성됩니다. 메타데이터 요소는 사용자가 정의할 수 있는 값 및 사용자 정의 변수로 구성됩니다.

source: After defining the *deviceInfo* and *metadata* elements, use the following code snippet to register a new device type.
de: Nach der Definition der Elemente *deviceInfo* und *metadata* verwenden Sie das folgende Code-Snippet, um einen neuen Gerätetyp zu registrieren.
es: Después de definir los elementos *deviceInfo* y *metadata*, utilice el siguiente fragmento de código para registrar un nuevo tipo de dispositivo.
fr: Après avoir défini les éléments *deviceInfo* et *metadata*, utilisez le fragment de code suivant pour enregistrer un nouveau type de terminal.
it: Una volta definiti gli elementi *deviceInfo* e *metadata*, utilizzare il seguente frammento di codice per registrare un nuovo tipo di dispositivo.
ja: *deviceInfo* 要素と *metadata* 要素を定義した後で、次のコード・スニペットを使用して、新しいデバイス・タイプを登録します。
ko: *deviceInfo* 및 *metadata* 요소를 정의한 후 다음 코드 스니펫을 사용하여 새 디바이스 유형을 등록하십시오.

source: The following sample will define the API connection settings, define the DeviceInfo and Metadata elements, and then register a device type.
de: Mit dem folgenden Beispiel werden die API-Verbindungseinstellungen definiert, das Geräteinformations- und das Metadatenelement definiert und anschließend ein Gerätetyp registriert.
es: El siguiente ejemplo definirá los valores de conexión de la API, definirá los elementos DeviceInfo y Metadata, y registrará un tipo de dispositivo.
fr: L'exemple suivant définit les paramètres de connexion de l'API et les éléments DeviceInfo et Metadata, puis enregistre un type de terminal.
it: Nel seguente esempio verranno definiti gli elementi DeviceInfo e Metadata e le impostazioni di connessione dell'API, quindi verrà registrato un tipo di dispositivo.
ja: 次のサンプルは、API 接続設定を定義して、DeviceInfo 要素と Metadata 要素を定義し、デバイス・タイプを登録します。
ko: 다음 샘플은 API 연결 설정을 정의하고 DeviceInfo 및 메타데이터 요소를 정의한 다음 디바이스 유형을 등록합니다.

source: Delete a Device Type
de: Gerätetyp löschen
es: Suprimir un tipo de dispositivo
fr: Suppression d'un type de terminal
it: Eliminare un tipo di dispositivo
ja: デバイス・タイプの削除
ko: 디바이스 유형 삭제

source: The *deleteDeviceType()* method can be used to delete a device type from your Internet of Things Foundation organization. The following code snippet can be added to a .py file to delete a device type "myDeviceType5".
de: Die Methode *deleteDeviceType()* kann dazu verwendet werden, einen Gerätetyp aus der Internet of Things Foundation-Organisation zu löschen. Das folgende Code-Snippet kann zu einer .py-Datei hinzugefügt werden, um den Gerätetyp "myDeviceType5" zu löschen.
es: Puede utilizarse el método *deleteDeviceType()* para suprimir un tipo de dispositivo de la organización de Internet of Things Foundation. El siguiente fragmento de código puede añadirse a un archivo .py para suprimir un tipo de dispositivo "myDeviceType5".
fr: La méthode *deleteDeviceType()* permet de supprimer un type de terminal de votre organisation Internet of Things Foundation. Le fragment de code suivant peut être ajouté à un fichier .py pour supprimer le type de terminal "myDeviceType5".
it: Il metodo *deleteDeviceType()* può essere utilizzato per eliminare un tipo di dispositivo dall'organizzazione Internet of Things Foundation. È possibile aggiungere il seguente frammento di codice a un file .py per eliminare un tipo di dispositivo "myDeviceType5".
ja: *deleteDeviceType()* メソッドを使用すると、Internet of Things Foundation 組織からデバイス・タイプを削除できます。次のコード・スニペットを .py ファイルに追加して、デバイス・タイプ "myDeviceType5" を削除できます。
ko: *deleteDeviceType()* 메소드는 Internet of Things Foundation 조직에서 디바이스 유형을 삭제하는 데 사용할 수 있습니다. 다음 코드 스니펫을 .py 파일에 추가하여 디바이스 유형 "myDeviceType5"를 삭제할 수 있습니다.

source: Get a Device Type
de: Gerätetyp abrufen
es: Obtener un tipo de dispositivo
fr: Extraction d'un type de terminal
it: Richiamare un tipo di dispositivo
ja: デバイス・タイプの取得
ko: 디바이스 유형 가져오기

source: The *getDeviceType()* method retrieves information on a given device type. The *deviceTypeID* of the device type you wish to retrieve information on must be used as a parameter, as shown in the following code snippet for the device type "myDeviceType5". This method will return all available information for the device type, including all variables in the deviceInfo and metadata element.
de: Die Methode *getDeviceType()* ruft Informationen zu einem bestimmten Gerätetyp ab. Die Gerätetyp-ID (*deviceTypeID*) des Gerätetyps, zu dem Sie Informationen abrufen möchten, muss als Parameter verwendet werden, wie im folgenden Code-Snippet für den Gerätetyp "myDeviceType5" dargestellt. Diese Methode gibt alle verfügbaren Informationen zu dem Gerätetyp zurück, einschließlich aller Variablen in den Elementen 'deviceInfo' und 'metadata'.
es: El método *getDeviceType()* recupera información sobre un determinado tipo de dispositivo. El *deviceTypeID* del tipo de dispositivo sobre el que desea recuperar información debe utilizarse como parámetro, como se muestra en el siguiente fragmento de código para el tipo de dispositivo "myDeviceType5". Este método devolverá toda la información disponible para el tipo de dispositivo, incluidas todas las variables en el elemento deviceInfo y metadata.
fr: La méthode *getDeviceType()* extrait les informations d'un type de terminal donné. L'élément *deviceTypeID* du type de terminal dont vous souhaitez extraire les informations doit être utilisé comme paramètre, comme indiqué dans le fragment de code suivant pour le type de terminal "myDeviceType5". Cette méthode renvoie toutes les informations disponibles pour le type de terminal, y compris toutes les variables de l'élément deviceInfo et metadata.
it: Il metodo *getDeviceType()* richiama le informazioni su un determinato tipo di dispositivo. È necessario utilizzare *deviceTypeID* come parametro del tipo di dispositivo di cui si desidera richiamare le informazioni, come illustrato nel seguente frammento di codice per il tipo di dispositivo "myDeviceType5". Questo metodo restituirà tutte le informazioni disponibili per il tipo di dispositivo, comprese tutte le variabili nell'elemento dei metadati e in deviceInfo.
ja: *getDeviceType()* メソッドは、指定されたデバイス・タイプの情報を取得します。デバイス・タイプ "myDeviceType5" の次のコード・スニペットに示すように、情報を取得するデバイス・タイプの *deviceTypeID* をパラメーターとして使用する必要があります。このメソッドは、deviceInfo のすべての変数とメタデータ要素を含む、デバイス・タイプで利用できるすべての情報を返します。
ko: *getDeviceType()* 메소드는 제공된 디바이스 유형의 정보를 검색합니다. 정보를 검색하려는 디바이스 유형의 *deviceTypeID*는 디바이스 유형 "myDeviceType5"에 대해 다음 코드 스니펫에서 표시된 대로 매개변수로 사용되어야 합니다. 이 메소드는 deviceInfo 및 메타데이터 요소의 모든 변수를 포함하여 디바이스 유형에 대해 모든 사용 가능한 정보를 리턴합니다.

source: Update a Device Type
de: Gerätetyp aktualisieren
es: Actualizar un tipo de dispositivo
fr: Mise à jour d'un type de terminal
it: Aggiornare un tipo di dispositivo
ja: デバイス・タイプの更新
ko: 디바이스 유형 업데이트

source: The *updateDeviceType()* method can be used to modify the properties of a device type. When using this method, several parameters must be defined. Firstly, the *deviceTypeID* of the device type to be updated must be specified, then the *description*, *deviceInfo*, and *metadata* elements, as shown in the code snippet below.
de: Die Methode *updateDeviceType()* kann dazu verwendet werden, die Eigenschaften eines Gerätetyps zu modifizieren. Bei der Verwendung dieser Methode muss eine Reihe von Parametern definiert werden. Zuerst muss die Gerätetyp-ID (*deviceTypeID*) des zu aktualisierenden Gerätetyps angegeben werden, dann müssen die Elemente *description*, *deviceInfo* und *metadata* angegeben werden, wie im nachfolgenden Code-Snippet dargestellt.
es: Puede utilizarse el método *updateDeviceType()* para modificar las propiedades de un tipo de dispositivo. Cuando se utiliza este método, deben definirse varios parámetros. En primer lugar, debe especificarse el *deviceTypeID* del tipo de dispositivo que se va a actualizar y, a continuación, los elementos *description*, *deviceInfo* y *metadata*, como se muestra en el fragmento de código siguiente.
fr: La méthode *updateDeviceType()* permet de modifier les propriétés d'un type de terminal. Lorsque vous utilisez cette méthode, vous devez définir plusieurs paramètres. Vous devez d'abord indiquer l'élément *deviceTypeID* du type de terminal à mettre à jour, puis les éléments *description*, *deviceInfo* et *metadata*, comme indiqué dans le fragment de code ci-dessous.
it: Il metodo *updateDeviceType()* può essere utilizzato per modificare le proprietà di un tipo di dispositivo. Quando si utilizza questo metodo, è necessario definire diversi parametri. Innanzitutto, è necessario specificare *deviceTypeID* per il tipo di dispositivo da aggiornare, quindi gli elementi *description*, *deviceInfo* e *metadata*, come mostrato nel frammento di codice di seguito.
ja: *updateDeviceType()* メソッドを使用すると、デバイス・タイプのプロパティーを変更できます。このメソッドを使用する場合、いくつかのパラメーターを定義する必要があります。最初に、以下のコード・スニペットに示すように、更新するデバイス・タイプの *deviceTypeID* を指定してから、*description*、*deviceInfo*、および *metadata* の要素を指定する必要があります。
ko: *updateDeviceType()* 메소드는 디바이스 유형의 특성을 수정하는 데 사용할 수 있습니다. 이 메소드를 사용할 때 몇몇 매개변수를 정의해야 합니다. 아래 코드 스니펫에 표시된 대로, 업데이트될 디바이스 유형의 *deviceTypeID*가 먼저 지정된 다음 *description*, *deviceInfo* 및 *metadata* 요소가 지정되어야 합니다.

source: The properties to be modified should be defined within the, *description*, *deviceInfo*, and *metadata* elements. The variables contained in *deviceInfo* and *metadata* which are to be updated must be defined before the method is called. The code sample below is an example of the full method being called.
de: Die zu modifizierenden Eigenschaften müssen in den Elementen *description*, *deviceInfo* und *metadata* definiert sein. Die in *deviceInfo* und *metadata* enthaltenen Variablen, die aktualisiert werden sollen, müssen definiert werden, bevor die Methode aufgerufen wird. Das nachfolgende Codebeispiel veranschaulicht die vollständige aufgerufene Methode.
es: Las propiedades que se van a modificar deben definirse en los elementos *description*, *deviceInfo* y *metadata*. Las variables contenidas en *deviceInfo* y*metadata* que se van a actualizar deben definirse antes de invocar el método. El ejemplo de código siguiente es un ejemplo del método completo que se invoca.
fr: Les propriétés à modifier doivent être définies dans les éléments *description*, *deviceInfo* et *metadata*. Les variables incluses dans les éléments *deviceInfo* et *metadata* à mettre à jour doivent être définies avant l'appel de la méthode. L'exemple de code ci-dessous est un exemple présentant l'ensemble de la méthode appelée.
it: Le proprietà da modificare devono essere definite negli elementi *description*, *deviceInfo* e *metadata*. Le variabili che devono essere aggiornate contenute in *deviceInfo* e *metadata* devono essere definite prima di richiamare il metodo. L'esempio di codice riportato di seguito è una dimostrazione del richiamo del metodo completo.
ja: 変更するプロパティーは、*description*、*deviceInfo*、および *metadata* の各要素内で定義する必要があります。更新する *deviceInfo* と *metadata* に含まれる変数は、メソッドが呼び出される前に定義する必要があります。以下のコード・サンプルは、呼び出される完全なメソッドの例です。
ko: 수정될 특성이 *description*, *deviceInfo* 및 *metadata* 요소 내에서 정의되어야 합니다. 업데이트될 *deviceInfo* 및 *metadata*에 포함된 변수는 메소드가 호출되기 전에 정의되어야 합니다. 아래의 코드 샘플은 호출 중인 전체 메소드의 예제입니다.

source: Device operations
de: Geräteoperationen
es: Operaciones de dispositivo
fr: Opérations relatives aux terminaux
it: Operazioni con il dispositivo
ja: デバイスの操作
ko: 디바이스 오퍼레이션

source: Device operations made available through the API include listing, adding, removing, viewing, updating, viewing location and viewing device management information of devices in an Internet of Things Foundation organization.
de: Zu den über die API verfügbar gemachten Geräteoperationen gehört Folgendes: Auflisten, Hinzufügen, Entfernen, Anzeigen, Aktualisieren, Standortinformationen anzeigen und Gerätemanagementinformationen anzeigen für Geräte in einer Internet of Things Foundation-Organisation.
es: Las operaciones de dispositivo que están disponibles mediante la API incluyen listar, añadir, eliminar, ver y actualizar dispositivos, así como ver la ubicación y ver información de gestión de dispositivos en una organización de Internet of Things Foundation.
fr: Les opérations relatives aux terminaux disponibles via l'API permettent de répertorier, d'ajouter, de supprimer, d'afficher l'emplacement et les informations de gestion des terminaux d'une organisation Internet of Things Foundation.
it: Le operazioni con il dispositivo disponibili tramite l'API comprendono l'elencazione, l'aggiunta, la rimozione, la visualizzazione, l'aggiornamento, la visualizzazione dell'ubicazione e delle informazioni di gestione del dispositivo in un'organizzazione Internet of Things Foundation.
ja: API により利用できるデバイスの操作には、Internet of Things Foundation 組織のデバイスのリスト、追加、削除、表示、更新、ロケーションの表示、デバイス管理情報の表示が含まれます。
ko: API를 통해 사용 가능한 디바이스 오퍼레이션은 나열, 추가, 제거, 보기, 업데이트, 위치 보기 및 Internet of Things Foundation 조직에서 디바이스의 디바이스 관리 정보 보기를 포함합니다.

source: Refer to the Device section of the `IBM IoT Foundation API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ for information about the list of query parameters, the request & response model and http status code.
de: Der Abschnitt zu Geräten in der `IBM IoT Foundation-API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__-Dokumentation enthält Informationen zur Liste der Abfrageparameter, zum Anforderungs-/Antwortmodell und zum HTTP-Statuscode.
es: Consulte la sección Dispositivo de la `API de IBM IoT Foundation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ para obtener información sobre la lista de parámetros de consulta, el modelo de solicitud y respuesta, y el código de estado http.
fr: Reportez-vous à la section relative aux terminaux dans la page `API IBM IoT Foundation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ pour obtenir des informations sur la liste des paramètres de requête, le modèle de demande et de réponse et le code de statut http.
it: Fare riferimento alla sezione Dispositivo dell'`API di IBM IoT Foundation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ per informazioni sull'elenco dei parametri della query, sul modello di richiesta e di risposta e sul codice stato HTTP.
ja: 照会パラメーター、要求と応答のモデル、および HTTP 状況コードのリストについての情報は、`「IBM IoT Foundation API」の「デバイス」セクション <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ を参照してください。
ko: 조회 매개변수, 요청 및 응답 모델과 http 상태 코드의 목록에 대한 정보는 `IBM IoT Foundation API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__의 디바이스 절을 참조하십시오.
