Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: This can be easily changed with the following code.
de: Dies kann auf einfache Weise mit dem folgenden Code geändert werden.
es: Esto se puede cambiar fácilmente con el siguiente código.
fr: Vous pouvez modifier facilement ce comportement en utilisant le code suivant :
it: Ciò può essere facilmente modificato con il seguente codice.
ja: これは、次のコードで簡単に変更できます。
ko: 다음 코드를 사용하여 쉽게 이를 변경할 수 있습니다.
pt_br: Isso pode ser facilmente mudado com o código a seguir.
zh_cn: 这可使用以下代码轻松进行更改。
zh_tw: 這可以使用下列程式碼輕易變更。
