Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python_cli_for_api.po
Languages: de, es, fr, it, ja, ko

source: Python Client Library - Internet of Things Foundation API Support
de: Python-Clientbibliothek - Internet of Things Foundation-API-Unterstützung
es: Biblioteca de cliente Python - Soporte de API de Internet of Things Foundation
fr: Bibliothèque client Python - Prise en charge de l'API Internet of Things Foundation
it: Libreria client Python - Supporto per l'API di Internet of Things Foundation
ja: Python クライアント・ライブラリー - Internet of Things Foundation API のサポート
ko: Python 클라이언트 라이브러리 - Internet of Things Foundation API 지원

source: Introduction
de: Einführung
es: Introducción
it: Introduzione
ja: 概要
ko: 소개

source: This client library describes how to use the Internet of Things Foundation Python client library with the Internet of Things Foundation API. For help with getting started with this module, see `Python Client Library - Introduction <../python.html>`__.
de: Diese Clientbibliothek beschreibt die Verwendung der Internet of Things Foundation-Python-Clientbibliothek mit der Internet of Things Foundation- API. Hilfe bei der Einführung zu diesem Modul finden Sie in `Python-Clientbibliothek - Einführung <../python.html>`__.
es: Esta biblioteca de cliente describe cómo utilizar la biblioteca de cliente Internet of Things Foundation Python con la API de Internet of Things Foundation. Para obtener ayuda con el inicio de este módulo, consulte `Biblioteca de cliente Python - Introducción <../python.html>`__.
fr: Cette bibliothèque client explique comment utiliser la bibliothèque client Python d'Internet of Things Foundation avec l'API Internet of Things Foundation. Pour obtenir de l'aide lors de la mise en route de ce module, reportez-vous à la section `Bibliothèque client Python - Introduction <../python.html>`__.
it: Questa libreria client descrive come utilizzare la libreria client Python di Internet of Things Foundation con l'API di Internet of Things Foundation. Per una guida introduttiva per questo modulo, consultare `Libreria client Python - Introduzione <../python.html>`__.
ja: このクライアント・ライブラリーは、Internet of Things Foundation API と共に Internet of Things Foundation Python クライアント・ライブラリーを使用する方法について記述しています。このモジュールを始めるにあたって、ヘルプとなる `Python クライアント・ライブラリー - 概要 <../python.html>`__ を参照してください。
ko: 이 클라이언트 라이브러리는 Internet of Things Foundation Python 클라이언트 라이브러리를 Internet of Things Foundation API와 함께 사용하는 방법을 설명합니다. 이 모듈 시작에 대한 도움말은 `Python 클라이언트 라이브러리 - 소개 <../python.html>`__의 내용을 참조하십시오.

source: This documentation contains information on how applications can use the `Python ibmiotf Client Library <https://pypi.python.org/pypi/ibmiotf>`__ to interact with your organization in the IBM Internet of Things Foundation Connect through ReST APIs.
de: Diese Dokumentation enthält Informationen dazu, wie Anwendungen die `Python-ibmiotf-Clientbibliothek <https://pypi.python.org/pypi/ibmiotf>`__ verwenden können, um mit Ihrer Organisation in IBM Internet of Things Foundation Connect über REST-APIs zu interagieren.
es: Esta documentación contiene información sobre cómo las aplicaciones pueden utilizar la `Biblioteca de cliente Python ibmiotf <https://pypi.python.org/pypi/ibmiotf>`__ para interactuar con la organización en IBM Internet of Things Foundation Connect mediante las API ReST.
fr: Cette documentation contient des informations expliquant comment les applications peuvent utiliser la `bibliothèque client Python ibmiotf <https://pypi.python.org/pypi/ibmiotf>`__ pour interagir avec votre organisation dans IBM Internet of Things Foundation Connect via des API REST.
it: Questa documentazione contiene informazioni su come le applicazioni possono utilizzare la `Libreria client ibmiotf Python <https://pypi.python.org/pypi/ibmiotf>`__ per interagire con l'organizzazione in IBM Internet of Things Foundation Connect tramite le API ReST.
ja: この資料には、アプリケーションで `Python ibmiotf クライアント・ライブラリー<https://pypi.python.org/pypi/ibmiotf>`__を使用して、IBM Internet of Things Foundation Connect 内の組織と ReST API を介して対話する方法についての情報が含まれています。
ko: 이 문서에는 애플리케이션이 ReST API를 통해 IBM Internet of Things Foundation Connect에서 해당 조직과 상호작용하는 데 `Python ibmiotf 클라이언트 라이브러리 <https://pypi.python.org/pypi/ibmiotf>`__를 사용할 수 있는 방법에 대한 정보가 포함됩니다.

source: The `Python for Devices documentation <../python_cli_for_devices.html>`__ contains information on how devices can publish events and handle commands using the Python ibmiotf Client Library.
de: Die `Python für Geräte-Dokumentation <../python_cli_for_devices.html>`__ enthält Informationen dazu, wie Geräte mithilfe der Python-ibmiotf-Clientbibliothek Ereignisse veröffentlichen und Befehle verarbeiten können.
es: La `Documentación de Python para dispositivos<../python_cli_for_devices.html>`__ contiene información sobre cómo los dispositivos pueden publicar los sucesos y manejar los mandatos utilizando la biblioteca de cliente Python ibmiotf.
fr: La `documentation Python pour les terminaux <../python_cli_for_devices.html>`__ contient des informations expliquant comment les terminaux peuvent publier des événements et traiter les commandes à l'aide de la bibliothèque client Python ibmiotf.
it: La documentazione `Python per dispositivi <../python_cli_for_devices.html>`__ contiene informazioni su come i dispositivi possono pubblicare gli eventi e gestire i comandi utilizzando la libreria client ibmiotf Python .
ja: `デバイスのための Python の資料<../python_cli_for_devices.html>`__には、Python ibmiotf クライアント・ライブラリーを使用して、デバイスでイベントをパブリッシュしてコマンドを処理する方法に関する情報が含まれます。
ko: `디바이스용 Python 문서 <../python_cli_for_devices.html>`__에는 디바이스가 Python ibmiotf 클라이언트 라이브러리를 통해 이벤트를 공개하고 명령을 처리할 수 있는 방법에 대한 정보가 포함됩니다.

source: The `Python for Applications documentation <../python_cli_for_apps.html>`__ contains information on how applications can use the Python ibmiotf Client Library to interact with devices.
de: Die `Python für Anwendungen-Dokumentation <../python_cli_for_apps.html>`__ enthält Informationen dazu, wie Anwendungen mithilfe der Python-ibmiotf-Clientbibliothek mit Geräten interagieren können.
es: La `Documentación de Python para aplicaciones <../python_cli_for_apps.html>`__ contiene información sobre cómo pueden utilizar las aplicaciones la biblioteca de cliente Python ibmiotf para interactuar con los dispositivos.
fr: La `documentation Python pour les applications <../python_cli_for_apps.html>`__ contient des informations expliquant comment les applications peuvent utiliser la bibliothèque client Python ibmiotf pour interagir avec des terminaux.
it: La documentazione `Python per applicazioni <../python_cli_for_apps.html>`__ contiene informazioni su come le applicazioni possono utilizzare la libreria client ibmiotf Python per interagire con i dispositivi.
ja: `アプリケーションのための Python の資料<../python_cli_for_apps.html>`__には、アプリケーションが Python ibmiotf クライアント・ライブラリーを使用してデバイスと対話する方法についての情報が含まれます。
ko: `애플리케이션용 Python 문서 <../python_cli_for_apps.html>`__에는 애플리케이션이 디바이스와 통신하는 데 Python ibmiotf 클라이언트 라이브러리를 사용할 수 있는 방법에 대한 정보가 포함됩니다.

source: Constructor
de: Konstruktor
fr: Constructeur
it: Costruttore
ja: コンストラクター
ko: 생성자

source: The Internet of Things Python module client is built for device, application, or API use by the constructor. The constructor requires a properties object containing the following definitions:
de: Der Internet of Things-Python-Modulclient ist so konstruiert, dass er von Geräten, Anwendungen oder APIs verwendet werden kann. Der Konstruktor benötigt ein Eigenschaftenobjekt mit den folgenden Definitionen:
es: El constructor crea el cliente del módulo Internet of Things Python para el uso de dispositivos, aplicaciones o API. El constructor requiere un objeto Propiedades que contenga las definiciones siguientes:
fr: Le client du module Python d'Internet of Things est généré pour permettre l'utilisation de terminaux, d'applications et d'API par le constructeur. Le constructeur requiert un objet propriétés contenant les définitions suivantes :
it: Il client del modulo Python di Internet of Things è stato creato per l'utilizzo con dispositivi, applicazioni o API dal costruttore. Il costruttore richiede un oggetto Proprietà contenente le seguenti definizioni:
ja: Internet of Things Python モジュール・クライアントは、コンストラクターがデバイス、アプリケーション、または API を利用するために作成されています。コンストラクターでは、次の定義を含むプロパティー・オブジェクトが必要です。
ko: Internet of Things Python 모듈 클라이언트는 디바이스, 애플리케이션 또는 생성자별 API 사용에 대해 빌드됩니다. 생성자는 다음 정의가 포함된 특성 오브젝트가 필요합니다.

source: org - Your organization ID.
de: org - Ihre Organisations-ID.
es: org - ID de organización.
fr: org - ID de votre organisation.
it: org - L'ID organizzazione.
ja: org - 組織 ID。
ko: org - 조직 ID.

source: auth-method - This defines the authentication method be used, and should always be set to "apikey".
de: auth-method - Definiert die zu verwendende Authentifizierungsmethode und muss stets "apikey" lauten.
es: auth-method - Define el método de autenticación que se va a utilizar y debe establecerse siempre en "apikey".
fr: auth-method - Définit la méthode d'authentification à utiliser. Doit toujours correspondre à "apikey".
it: auth-method - Definisce il metodo di autenticazione da utilizzare e deve essere sempre impostato su "apikey".
ja: auth-method - これは、使用する認証方式を定義し、常に "apikey" に設定する必要があります。
ko: auth-method - 이는 사용될 인증 메소드를 정의하고 "apikey"로 설정되어야 합니다.

source: auth-key - The authentication key should be your API key.
de: auth-key - Beim Authentifizierungsschlüssel muss es sich um den API-Schlüssel handeln.
es: auth-key - La clave de autenticación debe ser su clave de API.
fr: auth-key - La clé d'authentification doit être votre clé d'API.
it: auth-key - La chiave di autenticazione deve essere la chiave API.
ja: auth-key - 認証鍵は、API キーにする必要があります。
ko: auth-key - 인증 키는 API 키여야 합니다.

source: auth-token - The authentication token is your API key token.
de: auth-token - Beim Authentifizierungstoken handelt es sich um das API-Schlüsseltoken.
es: auth-token - La señal de autenticación es la señal de la clave de API.
fr: auth-token - Le jeton d'authentification est le jeton de la clé d'API.
it: auth-token - Il token di autenticazione è il token della chiave API.
ja: auth-token - 認証トークンは、API キーのトークンです。
ko: auth-token - 인증 토큰은 API 키 토큰입니다.

source: These definitions are used to interact with the Internet of Things Foundation module.
de: Diese Definitionen werden zur Interaktion mit dem Internet of Things Foundation-Modul verwendet.
es: Estas definiciones se utilizan para interactuar con el módulo Internet of Things Foundation.
fr: Ces définitions permettent d'interagir avec le module Internet of Things Foundation.
it: Queste definizioni vengono utilizzate per interagire con il modulo Internet of Things Foundation.
ja: これらの定義は、Internet of Things Foundation モジュールと対話するために使用されます。
ko: 이러한 정의는 Internet of Things Foundation 모듈과 상호작용하는 데 사용됩니다.

source: After installing the client library, as described in the Python for the Internet of Things Foundation Introduction, the APIClient instance can be construced by running the following code snippet:
de: Nach der Installation der Clientbibliothek, wie in der Einführung zu Python für Internet of Things Foundation beschrieben, kann die API-Clientinstanz erstellt werden, indem das folgende Code-Snippet ausgeführt wird:
es: Después de instalar la biblioteca de cliente, tal como se describe en la Introducción de Python para Internet of Things Foundation, la instancia APIClient puede construirse ejecutando el siguiente fragmento de código:
fr: Après avoir installé la bibliothèque client à l'aide de la procédure décrite dans l'introduction à Python pour Internet of Things Foundation, vous pouvez construire l'instance APIClient en exécutant le fragment de code suivant :
it: Dopo aver installato la libreria client, come descritto nell'introduzione a Python per Internet of Things Foundation, l'istanza APIClient può essere creata eseguendo il seguente frammento di codice:
ja: クライアント・ライブラリーをインストールした後で、「Internet of Things Foundation のための Python -概要」で説明するように、次のコード・スニペットを実行することで、APIClient インスタンスを作成できます。
ko: 클라이언트 라이브러리를 설치한 후 Internet of Things Foundation용 Python 소개에 설명된 대로 APIClient 인스턴스가 다음 코드 스니펫을 실행하여 생성될 수 있습니다.

source: Response and Exception
de: Antwort und Ausnahmebedingung
es: Respuesta y excepción
fr: Réponse et exception
it: Risposta ed eccezione
ja: 応答と例外
ko: 응답 및 예외

source: Each method in the APIClient responds with either a valid response (JSON or boolean) in the case of success or IoTFCReSTException in the case of failure. The IoTFCReSTException contains the following properties that application can parse to get more information about the failure.
de: Jede Methode im API-Client reagiert entweder mit einer gültigen Antwort (JSON- oder boolesches Format) im Erfolgsfall oder mit einer IoTFCReSTException-Ausnahmebedingung im Falle eines Fehlers. Die IoTFCReSTException-Ausnahmebedingung enthält die folgenden Eigenschaften, die die Anwendung parsen kann, um weitere Informationen zum Fehler zu erhalten.
es: Cada método en APIClient responde con una respuesta válida (JSON o booleana) en el caso de que la operación sea satisfactoria o IoTFCReSTException en el caso de que se produzca un error. IoTFCReSTException contiene las siguientes propiedades que la aplicación puede analizar para obtener más información sobre el error.
fr: Chaque méthode de l'instance APIClient renvoie une réponse valide (objet JSON ou valeur booléenne) en cas de réussite, ou émet l'exception IoTFCReSTException en cas d'échec. L'exception IoTFCReSTException contient les propriétés suivantes que l'application peut analyser pour obtenir des informations complémentaires sur l'échec.
it: Ciascun metodo in APIClient risponde con una risposta valida (JSON o booleana) in caso di esito positivo o con IoTFCReSTException in caso di esito negativo. IoTFCReSTException contiene le seguenti proprietà che l'applicazione può analizzare per ottenere ulteriori informazioni sull'errore.
ja: APIClient の各メソッドは、成功した場合は有効な応答 (JSON またはブール値)、失敗した場合は IoTFCReSTException で応答します。IoTFCReSTException には、アプリケーションが失敗の詳細情報を取得するために解析できる、次のプロパティーが含まれます。
ko: APIClient의 각 메소드는 성공 시 유효한 응답(JSON 또는 부울)으로 응답하거나 실패 시 IoTFCReSTException으로 응답합니다. IoTFCReSTException에는 실패에 대한 자세한 정보를 가져오는 데 애플리케이션이 구문 분석할 수 있는 다음 특성이 포함됩니다.

source: httpcode - HTTP Status Code
es: httpcode - Código de estado HTTP
fr: httpcode - Code de statut HTTP
it: httpcode - Codice stato HTTP
ja: httpcode - HTTP 状況コード
ko: httpcode - HTTP 상태 코드

source: message - Exception message containing the reason for the failure
de: message - Ausnahmebedingungsnachricht mit der Fehlerursache
es: message - Mensaje de excepción que contiene la razón del error
fr: message - Message d'exception contenant la cause de l'échec
it: message - Messaggio di eccezione contenente il motivo dell'errore
ja: message - 失敗の理由を含む例外メッセージ
ko: message - 실패에 대한 이유가 포함된 예외 메시지

source: response - JsonElement containing the partial response if any otherwise null
de: response - JSON-Element mit der Teilantwort, falls vorhanden, andernfalls null.
es: response - JsonElement que contiene la respuesta parcial si existe; de lo contrario, es nulo
fr: response - Elément JSON contenant la réponse partielle, le cas échéant. Sinon correspond à null.
it: response - JsonElement contenente la risposta parziale, nel caso in cui le altre siano null
ja: response - 部分的な応答がある場合はそれを含む JsonElement。それ以外の場合は null です。
ko: response - 달리 널인 경우 부분 응답이 포함된 JsonElement

source: So in the case of failure, application needs to parse the response to see if the action is partially successful or not.
de: Bei einem Fehler muss die Anwendung die Antwort parsen, um festzustellen, ob die Aktion teilweise erfolgreich war.
es: En el caso de un error, la aplicación debe analizar la respuesta para ver si la acción es parcialmente satisfactoria o no.
fr: En cas d'échec, l'application doit analyser la réponse pour déterminer si l'action a partiellement réussi ou non.
it: Pertanto, in caso di errore, l'applicazione deve analizzare la risposta per verificare che l'azione sia parzialmente riuscita o meno.
ja: 失敗した場合、アプリケーションは応答を解析して、アクションが部分的に成功したかどうかを確認する必要があります。
ko: 따라서 실패한 경우 애플리케이션은 응답을 구문 분석하여 조치가 부분적으로 성공인지 여부를 확인해야 합니다.

source: Organization details
de: Organisationsdetails
es: Detalles de organización
fr: Détails de l'organisation
it: Dettagli organizzazione
ja: 組織の詳細
ko: 조직 세부사항

source: Applications can use the *getOrganizationDetails()* method to retrieve the Organization details. Add the following code to a .py file, beneath the constructor code shown above.
de: Anwendungen können mithilfe der Methode *getOrganizationDetails()* Organisationsdetails abrufen. Fügen Sie den folgenden Code zu einer .py-Datei hinzu, und zwar unterhalb des oben dargestellten Konstruktorcodes.
es: Las aplicaciones pueden utilizar el método *getOrganizationDetails()* para recuperar los detalles de la organización. Añada el código siguiente a un archivo .py, debajo del código de constructor que se muestra arriba.
fr: Les applications peuvent utiliser la méthode *getOrganizationDetails()* pour extraire les détails de l'organisation. Ajoutez le code suivant à un fichier .py, sous le code du constructeur indiqué ci-dessus.
it: Le applicazioni possono utilizzare il metodo *getOrganizationDetails()* per richiamare i dettagli dell'organizzazione. Aggiungere il seguente codice a un file .py, di seguito al codice del costruttore mostrato in precedenza.
ja: アプリケーションは *getOrganizationDetails()* メソッドを使用して、組織の詳細を取得できます。.py ファイル内の、上に示したコンストラクターのコードの下に次のコードを追加します。
ko: 애플리케이션은 *getOrganizationDetails()* 메소드를 사용하여 조직 세부사항을 검색할 수 있습니다. 위에 표시된 생성자 코드 아래에서 다음 코드를 .py 파일에 추가하십시오.

source: Refer to the Organization Configuration section of the `IBM IoT Foundation API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ for information about the request & response model and http status code.
de: Der Abschnitt zur Organisationskonfiguration in der `IBM IoT Foundation-API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__-Dokumentation enthält Informationen zum Anforderungs-/Antwortmodell und zum HTTP-Statuscode.
es: Consulte la sección Configuración de la organización de la `API de IBM IoT Foundation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ para obtener información sobre el modelo de solicitud y respuesta, y el código de estado http.
fr: Reportez-vous à la section décrivant la configuration de l'organisation dans la rubrique `API IBM IoT Foundation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ pour obtenir des informations sur le modèle de demande et de réponse et le code de statut http.
it: Fare riferimento alla sezione Configurazione organizzazione dell'`API di IBM IoT Foundation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ per informazioni sul modello di richiesta e risposta e sul codice stato HTTP.
ja: 要求と応答のモデル、および HTTP 状況コードについての情報は、`「IBM IoT Foundation API」の「組織の構成」セクション<https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__を参照してください。
ko: 요청 및 응답 모델과 http 상태 코드에 대한 정보는 `IBM IoT Foundation API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__의 조직 구성 절을 참조하십시오.

source: Sample
de: Beispiel
es: Ejemplo
fr: Exemple
it: Esempio
ja: サンプル
ko: 샘플

source: Your final code should follow this format:
de: Der fertiggestellte Code muss das folgende Format aufweisen:
es: El código final debe seguir este formato:
fr: Le code final doit posséder le format suivant :
it: Il codice finale deve seguire questo formato:
ja: 最終コードは、次のフォーマットに従う必要があります。
ko: 최종 코드는 이 형식을 따라야 합니다.

source: This code will run the constructor, and then retrieve organization details for the specified organization.
de: Mit diesem Code wird die Konstruktorfunktion ausgeführt; dann werden Organisationsdetails für die angegeben Organisation abgerufen.
es: Este código ejecutará el constructor y recuperará los detalles de la organización para la organización especificada.
fr: Ce code exécute le constructeur, puis extrait les détails de l'organisation indiquée.
it: Tale codice eseguirà il costruttore, quindi richiamerà i dettagli sull'organizzazione specificata.
ja: このコードはコンストラクターを実行してから、指定された組織の詳細を取得します。
ko: 이 코드는 생성자를 실행한 다음 지정된 조직에 대해 조직 세부사항을 검색합니다.

source: Bulk device operations
de: Massengeräteoperationen
es: Operaciones de dispositivo masivas
fr: Opérations globales sur les terminaux
it: Operazioni dispositivo in massa
ja: デバイスの一括操作
ko: 벌크 디바이스 오퍼레이션

source: Applications can use bulk operations to get, add or remove devices in bulk from Internet of Things Foundation Connect.
de: Anwendungen können Massenoperationen verwenden, um eine große Anzahl von Geräten auf einmal über Internet of Things Foundation Connect abzurufen, hinzuzufügen oder zu entfernen.
es: Las aplicaciones pueden utilizar operaciones masivas para obtener, añadir o eliminar dispositivos de forma masiva de Internet of Things Foundation Connect.
fr: Les applications peuvent utiliser des opérations globales pour extraire, ajouter ou supprimer des terminaux en bloc dans Internet of Things Foundation Connect.
it: Le applicazioni possono utilizzare le operazioni in massa per richiamare, aggiungere o rimuovere in massa i dispositivi da Internet of Things Foundation Connect.
ja: アプリケーションは、一括操作を使用すると、Internet of Things Foundation Connect からデバイスを一括で取得、追加、または削除できます。
ko: 애플리케이션이 벌크 오퍼레이션을 사용하여 Internet of Things Foundation 연결에서 대량으로 디바이스를 가져오고 추가하거나 제거할 수 있습니다.

source: Refer to the Bulk Operations section of the `IBM IoT Foundation API https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Bulk_Operations/>`__ for information about the list of query parameters, the request & response model and http status code.
de: Der Abschnitt zu Massenoperationen in der `IBM IoT Foundation-API https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Bulk_Operations/>`__-Dokumentation enthält Informationen zur Liste der Abfrageparameter, zum Anforderungs-/Antwortmodell und zum HTTP-Statuscode.
es: Consulte la sección Operaciones masivas de la `API de IBM IoT Foundation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Bulk_Operations/>`__ para obtener información sobre la lista de parámetros de consulta, el modelo de solicitud y respuesta, y el código de estado http.
fr: Reportez-vous à la section relative aux opérations globales dans la page `API IBM IoT Foundation https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Bulk_Operations/>`__ pour obtenir des informations sur la liste des paramètres de requête, le modèle de demande et de réponse et le code de statut http.
it: Fare riferimento alla sezione Operazioni in massa dell'`API di IBM IoT Foundation https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Bulk_Operations/>`__ per informazioni sull'elenco di parametri di query, sul modello di richiesta e risposta e sul codice stato HTTP.
ja: 照会パラメーター、要求と応答のモデル、および HTTP 状況コードのリストについての情報は、`「IBM IoT Foundation API」の「一括操作 (Bulk Operations)」<https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Bulk_Operations/>`__を参照してください。
ko: 조회 매개변수, 요청 및 응답 모델과 http 상태 코드의 목록에 대한 정보는 `IBM IoT Foundation API https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Bulk_Operations/>`__의 벌크 오퍼레이션 섹션을 참조하십시오.

source: Retrieve device information
de: Geräteinformationen abrufen
es: Recuperar información de dispositivos
fr: Extraction des informations des terminaux
it: Richiamare le informazioni sul dispositivo
ja: デバイス情報の取得
ko: 디바이스 정보 검색
