Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python_cli_for_api.po
Languages: de, es, fr, it, ja, ko

source: The response will contain some parameters and the application needs to retrieve the JSON element *events* from the response to get the array of events returned. Other parameters in the response are required to make further call, for example, the *_bookmark* element can be used to page through results. Issue the first request without specifying a bookmark, then take the bookmark returned in the response and provide it on the request for the next page. Repeat until the end of the result set indicated by the absence of a bookmark. Each request must use exactly the same values for the other parameters, or the results are undefined.
de: Die Antwort enthält einige Parameter und die Anwendung muss das JSON-Element *events* aus der Antwort abrufen, um die Gruppe der zurückgegebenen Ereignisse zu erhalten. Andere Parameter in der Antwort sind für weitere Aufrufe erforderlich, z. B. kann das Element *_bookmark* zum Blättern in den Ergebnissen verwendet werden. Setzen Sie die erste Anforderung ohne Angabe eines Lesezeichens ab, verwenden Sie dann das in der Antwort zurückgegebene Lesezeichen und geben Sie es in der Anforderung für die nächste Seite an. Wiederholen Sie diesen Vorgang, bis das Ende der Ergebnismenge erreicht ist. Dies wird dadurch gekennzeichnet, dass kein Lesezeichen vorhanden ist. Jede Anforderung muss genau dieselben Werte für die anderen Parameter verwenden, da andernfalls die Ergebnisse nicht definiert sind.
es: La respuesta contendrá algunos parámetros y la aplicación debe recuperar el elemento JSON *events* de la respuesta, para obtener la matriz de los sucesos devueltos. Se requieren otros parámetros en la respuesta para realizar más llamadas, por ejemplo, el elemento *_bookmark* puede utilizarse para paginar por los resultados. Emita la primera solicitud sin especificar un marcador y, a continuación, devuelva el marcador en la respuesta y proporciónelo en la solicitud de la página siguiente. Repita este paso hasta el final del conjunto de resultados indicado por la ausencia de un marcador. Cada solicitud debe utilizar exactamente los mismos valores para los otros parámetros o los resultados no estarán definidos.
fr: La réponse inclut un certain nombre de paramètres et l'application doit extraire l'élément JSON *events* de la réponse pour obtenir le tableau d'événements renvoyés. D'autres paramètres de la réponse sont nécessaires pour effectuer d'autres appels, par exemple l'élément *_bookmark* qui permet de parcourir les pages de résultats. Soumettez la première demande sans indiquer de signet, puis utilisez le signet renvoyé dans la réponse et indiquez-le dans la demande pour la page suivante. Répétez l'opération jusqu'à la fin de l'ensemble de résultats indiquée par l'absence de signet. Chaque demande doit utiliser exactement les mêmes valeurs pour les autres paramètres. Sinon, les résultats ne sont pas définis.
it: La risposta contiene alcuni parametri e l'applicazione deve richiamare l'elemento JSON *events* dalla risposta per richiamare la schiera degli eventi restituiti. Nella risposta sono richiesti altri parametri per effettuare ulteriori chiamate, ad esempio l'elemento *_bookmark* può essere utilizzato per sfogliare i risultati. Emettere inizialmente la richiesta senza specificare un segnalibro, quindi fornire il segnalibro restituito nella risposta alla richiesta per la pagina successiva. Ripetere fino alla fine della serie di risultati, indicata dall'assenza di un segnalibro. Ciascuna richiesta deve utilizzare esattamente gli stessi valori per gli altri parametri, altrimenti i risultati saranno indefiniti.
ja: 応答にはパラメーターが含まれ、アプリケーションが応答からの JSON 要素の *events* を取得して返されるイベントの配列を取得するために必要とします。応答のその他のパラメーターは、*_bookmark* 要素などを使用して結果をページ送りするために、さらに呼び出しを実行する場合に必要です。最初の要求はブックマークを指定しないで発行し、次に応答で返されるブックマークを取得して、次のページの要求で指定します。ブックマークがなくなることで示される結果セットの終わりまで繰り返します。各要求は、他のパラメーターと同じ値を正確に使用する必要があります。そうしないと結果が未定義になります。
ko: 응답에는 일부 매개변수가 포함되며 애플리케이션이 리턴된 이벤트의 어레이를 가져오기 위해 응답에서 JSON 요소 *events*를 검색해야 합니다. 응답의 기타 매개변수는 추가 호출을 작성하는 데 필요합니다. 예를 들어, *_bookmark* 요소를 사용하여 페이지별로 결과를 볼 수 있습니다. 책갈피를 지정하지 않고 첫 번째 요청을 발행한 다음 응답에 리턴된 책갈피를 가져와서 그 다음 페이지에 대해 요청 시 제공하십시오. 책갈피의 부재로 표시된 결과 세트의 끝까지 반복하십시오. 각 요청은 기타 매개변수에 대해 정확히 동일한 값을 사용해야 합니다. 그렇지 않으면 결과가 정의되지 않습니다.

source: The above snippet returns the events between the start and end time.
de: Das oben angeführte Code-Snippet gibt die Ereignisse zwischen Start- und Endzeit zurück.
es: El fragmento de código anterior devuelve los sucesos entre la hora de inicio y la hora de finalización.
fr: Le fragment ci-dessus renvoie les événements compris entre l'heure de début et de fin.
it: Il frammento di codice sopra riportato restituisce gli eventi tra la data di inizio e di fine.
ja: 上記のスニペットは、開始時刻と終了時刻の間のイベントを返します。
ko: 위의 스니펫은 시작 및 종료 시간 사이에 이벤트를 리턴합니다.

source: View events from a device type
de: Ereignisse eines Gerätetyps anzeigen
es: Ver sucesos de un tipo de dispositivo
fr: Affichage des événements d'un type de terminal
it: Visualizzare gli eventi da un tipo di dispositivo
ja: デバイス・タイプからのイベントを表示
ko: 디바이스 유형에서 이벤트 보기

source: The *getHistoricalEvents()* method is used to view events from all the devices of a particular device type.
de: Die Methode *getHistoricalEvents()* wird dazu verwendet, Ereignisse aller Geräte eines bestimmten Gerätetyps anzuzeigen.
es: El método *getHistoricalEvents()* se utiliza para ver sucesos de todos los dispositivos de un determinado tipo de dispositivo.
fr: La méthode *getHistoricalEvents()* permet d'afficher les événements de tous les terminaux d'un type spécifique.
it: Il metodo *getHistoricalEvents()* viene utilizzato per visualizzare gli eventi da tutti i dispositivi di un particolare tipo.
ja: *getHistoricalEvents()* メソッドを使用すると、特定のデバイス・タイプのすべてのデバイスからのイベントが表示されます。
ko: *getHistoricalEvents()* 메소드는 특정한 디바이스 유형의 모든 디바이스에서 이벤트를 보는 데 사용됩니다.

source: The response will contain some parameters and the application needs to retrieve the JSON element *events* from the response to get the array of events returned. As mentioned in the *view events from all devices* section, the overloaded method can be used to control the output.
de: Die Antwort enthält einige Parameter und die Anwendung muss das JSON-Element *events* aus der Antwort abrufen, um die Gruppe der zurückgegebenen Ereignisse zu erhalten. Wie im Abschnitt *Ereignisse aller Geräte anzeigen* erwähnt, kann die überladene Methode zur Steuerung der Ausgabe verwendet werden.
es: La respuesta contendrá algunos parámetros y la aplicación debe recuperar el elemento JSON *events* de la respuesta, para obtener la matriz de los sucesos devueltos. Como se ha comentado en la sección *Ver los sucesos de todos los dispositivos*, puede utilizarse el método sobrecargado para controlar la salida.
fr: La réponse inclut un certain nombre de paramètres et l'application doit extraire l'élément JSON *events* de la réponse pour obtenir le tableau d'événements renvoyés. Comme indiqué à la section *Affichage des événements de tous les terminaux*, la méthode surchargée peut être utilisée pour contrôler la sortie.
it: La risposta contiene alcuni parametri e l'applicazione deve richiamare l'elemento JSON *events* dalla risposta per richiamare la schiera degli eventi restituiti. Come menzionato nella sezione *visualizzazione eventi da tutti i dispositivi*, il metodo sottoposto a overload può essere utilizzato per controllare l'output.
ja: 応答にはパラメーターが含まれ、アプリケーションが応答からの JSON 要素の *events* を取得して返されるイベントの配列を取得するために必要とします。*全デバイスのイベントの表示* のセクションで説明したように、多重定義されたメソッドを、出力の制御に使用できます。
ko: 응답에는 일부 매개변수가 포함되며 애플리케이션이 리턴된 이벤트의 어레이를 가져오기 위해 응답에서 JSON 요소 *events*를 검색해야 합니다. 모든 devices* 절에서 *view 이벤트에 언급된 대로 과부하된 메소드를 사용하여 출력을 제어할 수 있습니다.

source: View events from a device
de: Ereignisse eines Geräts anzeigen
es: Ver sucesos de un dispositivo
fr: Affichage des événements d'un terminal
it: Visualizzare gli eventi da un dispositivo
ja: デバイスからのイベントを表示
ko: 디바이스에서 이벤트 보기

source: The *getHistoricalEvents()* method is used to view events from a specific device. DeviceTypeId and deviceId parameters are required in order to use this method.
de: Die Methode *getHistoricalEvents()* wird dazu verwendet, Ereignisse eines bestimmten Geräts anzuzeigen. Zur Verwendung dieser Methode sind die Parameter 'DeviceTypeId' und 'deviceId' erforderlich.
es: El método *getHistoricalEvents()* se utiliza para ver sucesos de un dispositivo específico. Los parámetros DeviceTypeId y deviceId son necesarios para poder utilizar este método.
fr: La méthode *getHistoricalEvents()* permet d'afficher les événements d'un terminal spécifique. Les paramètres DeviceTypeId et deviceId sont obligatoires pour utiliser cette méthode.
it: Il metodo *getHistoricalEvents()* viene utilizzato per visualizzare gli eventi da uno specifico dispositivo. I parametri DeviceTypeId e deviceId sono richiesti per utilizzare questo metodo.
ja: *getHistoricalEvents()* メソッドを使用すると、特定のデバイスのイベントが表示されます。このメソッドを使用するには、DeviceTypeId と deviceId パラメーターが必要です。
ko: *getHistoricalEvents()* 메소드는 특정 디바이스에서 이벤트를 보는 데 사용됩니다. 이 메소드를 사용하려면 DeviceTypeId 및 deviceId 매개변수가 필요합니다.

source: The response will contain more parameters and application needs to retrieve the JSON element *events* from the response to get the array of events returned.
de: Die Antwort enthält weitere Parameter und die Anwendung muss das JSON-Element *events* aus der Antwort abrufen, um die Gruppe der zurückgegebenen Ereignisse zu erhalten.
es: La respuesta contendrá más parámetros y la aplicación debe recuperar el elemento JSON *events* de la respuesta, para obtener la matriz de los sucesos devueltos.
fr: La réponse inclut d'autres paramètres et l'application doit extraire l'élément JSON *events* de la réponse pour obtenir le tableau d'événements renvoyés.
it: La risposta contiene ulteriori parametri e l'applicazione deve richiamare l'elemento JSON *events* dalla risposta per richiamare la schiera degli eventi restituiti.
ja: 応答にはより多くのパラメーターが含まれ、アプリケーションが応答からの JSON 要素の *events* を取得して返されるイベントの配列を取得するために必要とします。
ko: 응답에는 추가 매개변수가 포함되며 애플리케이션이 리턴된 이벤트의 어레이를 가져오기 위해 응답에서 JSON 요소 *events*를 검색해야 합니다.

source: Examples
de: Beispiele
es: Ejemplos
fr: Exemples
it: Esempi:
ja: 例
ko: 예제

source: `bulkOperations.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/bulkOperations.py>`__ - Sample that showcases how to get, add or remove devices in bulk from Internet of Things Foundation.
de: `bulkOperations.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/bulkOperations.py>`__ - Beispiel, das veranschaulicht, wie Geräte mithilfe von Massenoperationen von Internet of Things Foundation abgerufen, zu Internet of Things Foundation hinzugefügt oder aus Internet of Things Foundation entfernt werden können.
es: `bulkOperations.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/bulkOperations.py>`__ - Ejemplo que muestra cómo obtener, añadir o eliminar dispositivos de forma masiva de Internet of Things Foundation.
fr: `bulkOperations.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/bulkOperations.py>`__ - Exemple expliquant comment extraire, ajouter ou supprimer des terminaux en bloc dans Internet of Things Foundation.
it: `bulkOperations.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/bulkOperations.py>`__ - Un esempio che mostra come richiamare, aggiungere o rimuovere dispositivi in massa da Internet of Things Foundation.
ja: `bulkOperations.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/bulkOperations.py>`__ - Internet of Things Foundation でデバイスを一括で取得、追加、または削除する方法の例を示すサンプル。
ko: `bulkOperations.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/bulkOperations.py>`__ - Internet of Things Foundation에서 대량으로 디바이스를 가져오고 추가하거나 제거하는 방법을 보여주는 샘플

source: `deviceDiagnostics.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceDiagnostics.py>`__ - A sample that showcases various Device Diagnostic operations like clear logs, retrieve logs, add log information, delete logs, get specific log, clear error codes, get device error codes and add an error code to Internet of Things Foundation.
de: `deviceDiagnostics.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceDiagnostics.py>`__ - Beispiel, das verschiedene Gerätediagnoseoperationen veranschaulicht, wie zum Beispiel: Protokolle löschen, Protokolle abrufen, Protokollinformationen hinzufügen, Protokolle löschen, ein bestimmtes Protokoll abrufen, Fehlercodes löschen, Gerätefehlercodes abrufen und einen Fehlercode zu Internet of Things Foundation hinzufügen.
es: `deviceDiagnostics.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceDiagnostics.py>`__ - Un ejemplo que muestra varias operaciones de diagnóstico de dispositivos como, por ejemplo, borrar registros, recuperar registros, añadir información de registro, suprimir registros, obtener un registro específico, borrar códigos de error, obtener códigos de error de dispositivo y añadir un código de error a Internet of Things Foundation.
fr: `deviceDiagnostics.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceDiagnostics.py>`__ - Exemple présentant plusieurs opérations de diagnostic d'un terminal, comme l'effacement et l'extraction des journaux, l'ajout des informations d'un journal, la suppression de journaux, l'extraction d'un journal spécifique, l'effacement de codes d'erreur, l'obtention de codes d'erreur d'un terminal et l'ajout d'un code d'erreur à Internet of Things Foundation.
it: `deviceDiagnostics.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceDiagnostics.py>`__ - Un esempio che mostra varie operazioni di diagnostica dei dispositivi come l'eliminazione dei log, il richiamo dei log, l'aggiunta di informazioni di log, l'eliminazione di log, il richiamo di un log specifico, l'eliminazione dei codici di errore, il richiamo di codici di errore di un dispositivo e l'aggiunta di un codice di errore a Internet of Things Foundation.
ja: `deviceDiagnostics.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceDiagnostics.py>`__ - Internet of Things Foundation でのログ消去、ログの取得、ログ情報の追加、ログの削除、特定のログの取得、エラー・コードの消去、デバイス・エラー・コードの取得、エラー・コードの追加など、さまざまなデバイスの診断操作を示すサンプル。
ko: `deviceDiagnostics.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceDiagnostics.py>`__ - 여러 디바이스 진단 오퍼레이션(로그 지우기, 로그 검색, 로그 정보 추가, 로그 삭제, 특정 로그 가져오기, 오류 코드 지우기, 디바이스 오류 코드 가져오기 및 Internet of Things Foundation에 오류 코드 추가)을 보여주는 샘플

source: `deviceTypes.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceTypes.py>`__ - Sample that showcases various Device Type API operations like list all, create, delete, view and update device types in Internet of Things Foundation.
de: `deviceTypes.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceTypes.py>`__ - Beispiel, das verschiedene Gerätetyp-API-Operationen veranschaulicht, wie zum Beispiel: Auflisten aller Gerätetypen, Erstellen, Löschen, Anzeigen und Aktualisieren von Gerätetypen in Internet of Things Foundation.
es: `deviceTypes.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceTypes.py>`__ - Ejemplo que muestra varias operaciones de API de tipo de dispositivo como, por ejemplo, listar todo, crear, suprimir, ver y actualizar tipos de dispositivo en Internet of Things Foundation.
fr: `deviceTypes.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceTypes.py>`__ - Exemple présentant différentes opérations liées aux API Type de terminal, comme répertorier, créer, supprimer, visualiser et mettre à jour les types de terminaux dans Internet of Things Foundation.
it: `deviceTypes.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceTypes.py>`__ - Un esempio che mostra varie operazioni con l'API Tipo di dispositivo, come elenca tutti, crea, elimina, visualizza e aggiorna i tipi di dispositivo in Internet of Things Foundation.
ja: `deviceTypes.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceTypes.py>`__ - Internet of Things Foundation のデバイス・タイプのすべてのリスト、作成、削除、表示、および更新など、さまざまなデバイス・タイプ API の操作を示すサンプル。
ko: `deviceTypes.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/deviceTypes.py>`__ - 여러 디바이스 유형 API 오퍼레이션(모두 나열, Internet of Things Foundation에서 디바이스 유형 작성, 삭제, 보기 및 업데이트)을 보여주는 샘플

source: `devices.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/devices.py>`__ - A sample that showcases various Device operations like list, add, remove, view, update, view location and view management information of a device in Internet of Things Foundation.
de: `devices.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/devices.py>`__ - Beispiel, das verschiedene Geräteoperationen veranschaulicht, wie zum Beispiel: Auflisten, Hinzufügen, Entfernen, Anzeigen und Aktualisieren eines Geräts in Internet of Things Foundation, Anzeigen von Standort- und Managementinformationen eines Geräts in Internet of Things Foundation.
es: `devices.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/devices.py>`__ - Un ejemplo que muestra varias operaciones de dispositivo como, por ejemplo, listar, añadir, eliminar, ver y actualizar dispositivos, así como ver ubicación y ver información de gestión de un dispositivo en Internet of Things Foundation.
fr: `devices.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/devices.py>`__ - Exemple présentant différentes opérations relatives aux terminaux, par exemple pour répertorier, ajouter, supprimer, afficher, mettre à jour, visualiser l'emplacement et les informations de gestion d'un terminal dans Internet of Things Foundation.
it: `devices.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/devices.py>`__ - Un esempio che mostra varie operazioni dei dispositivi come elenca, aggiungi, rimuovi, visualizza, aggiorna, visualizza ubicazione e visualizza informazioni di gestione di un dispositivo in Internet of Things Foundation.
ja: `devices.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/devices.py>`__ - Internet of Things Foundation のデバイスのリスト、追加、削除、表示、更新、ロケーションの表示、管理情報の表示など、さまざまなデバイス・タイプの操作を示すサンプル。
ko: `devices.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/devices.py>`__ - 여러 디바이스 오퍼레이션(나열, 추가, 제거, 보기, 업데이트, 위치 보기 및 Internet of Things Foundation에서 디바이스의 관리 정보 보기)을 보여주는 샘플

source: `historian.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/historian.py>`__ - A sample that showcases how to retrieve historical events from Internet of Things Foundation.
de: `historian.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/historian.py>`__ - Beispiel, das veranschaulicht, wie historische Ereignisse von Internet of Things Foundation abgerufen werden.
es: `historian.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/historian.py>`__ - Un ejemplo que muestra cómo recuperar sucesos históricos de Internet of Things Foundation.
fr: `historian.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/historian.py>`__ - Exemple expliquant comment extraire les événements d'historique d'Internet of Things Foundation.
it: `historian.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/historian.py>`__ - Un esempio che mostra come richiamare gli eventi cronologici da Internet of Things Foundation.
ja: `historian.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/historian.py>`__ - Internet of Things Foundation で履歴イベントを取得する方法の例を示すサンプル。
ko: `historian.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/historian.py>`__ - Internet of Things Foundation에서 히스토리 이벤트를 검색하는 방법을 보여주는 샘플

source: `logConnection.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/logConnection.py>`__ - A sample that showcases device connectivity log operations that can be performed on Internet of Things Foundation.
de: `logConnection.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/logConnection.py>`__ - Beispiel, das Gerätekonnektivitätsprotokolloperationen veranschaulicht, die in Internet of Things Foundation ausgeführt werden können.
es: `logConnection.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/logConnection.py>`__ - Un ejemplo que muestra las operaciones de registro de conectividad de dispositivos que pueden ejecutarse en Internet of Things Foundation.
fr: `logConnection.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/logConnection.py>`__ - Exemple présentant les opérations liées au journal de connectivité des terminaux qui peuvent être effectuées dans Internet of Things Foundation.
it: `logConnection.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/logConnection.py>`__ - Un esempio che mostra le operazioni con i log di connettività del dispositivo che possono essere eseguite in Internet of Things Foundation.
ja: `logConnection.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/logConnection.py>`__ - Internet of Things Foundation で実行できるデバイスの接続ログ操作を示すサンプル。
ko: `logConnection.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/logConnection.py>`__ - Internet of Things Foundation에서 수행될 수 있는 디바이스 연결 로그 오퍼레이션을 보여주는 샘플

source: `organization.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/organization.py>`__ - A sample that showcases organization operations that can be performed on Internet of Things Foundation.
de: `organization.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/organization.py>`__ - Beispiel, das Organisationsoperationen veranschaulicht, die in Internet of Things Foundation ausgeführt werden können.
es: `organization.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/organization.py>`__ - Un ejemplo que muestra las operaciones de organización que pueden ejecutarse en Internet of Things Foundation.
fr: `organization.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/organization.py>`__ - Exemple présentant les opérations liées à l'organisation qui peuvent être effectuées dans Internet of Things Foundation.
it: `organization.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/organization.py>`__ - Un esempio che mostra le operazioni con l'organizzazione che è possibile eseguire in Internet of Things Foundation.
ja: `organization.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/organization.py>`__ - Internet of Things Foundation で実行できる組織の操作を示すサンプル。
ko: `organization.py <https://github.com/ibm-messaging/iot-python/blob/master/samples/apiExamples/organization.py>`__ - Internet of Things Foundation에서 수행될 수 있는 조직 오퍼레이션을 보여주는 샘플
