Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python_cli_for_api.po
Languages: de, es, fr, it, ja, ko

source: Bulk device information can be retrieved using the *getAllDevices()* method. This method retrieves information on all registered devices in the organization, each request can contain a maximum of 512KB.
de: Massendaten für Geräte können mithilfe der Methode *getAllDevices()* abgerufen werden. Mit dieser Methode werden Informationen zu allen registrierten Geräten in der Organisation abgerufen, wobei jede Anforderung maximal 512 KB enthalten kann.
es: Puede recuperarse información de dispositivos masiva utilizando el método *getAllDevices()*. Este método recupera información sobre todos los dispositivos registrados en la organización; cada solicitud puede contener un máximo de 512 KB.
fr: Des informations globales relatives aux groupes de terminaux peuvent être extraites à l'aide de la méthode *getAllDevices()*. Cette méthode extrait les informations de tous les terminaux enregistrés dans l'organisation. La taille maximale de chaque demande est 512 ko.
it: È possibile richiamare le informazioni in massa sul dispositivo utilizzando il metodo *getAllDevices()*. Tale metodo richiama le informazioni su tutti i dispositivi registrati nell'organizzazione, ciascuna richiesta può contenere un massimo di 512KB.
ja: 一括デバイス情報は、*getAllDevices()* メソッドを使用して取得できます。このメソッドは、組織の登録済みのすべてのデバイスに関する情報を取得します。各要求に含められるのは最大で 512 KB です。
ko: 벌크 디바이스 정보는 *getAllDevices()* 메소드를 통해 검색할 수 있습니다. 이 메소드는 조직에서 모든 등록된 디바이스의 정보를 검색하며, 각 요청에는 최대 512KB가 포함될 수 있습니다.

source: Response and Bookmarks
de: Antwort und Lesezeichen
es: Respuesta y marcadores
fr: Réponse et signets
it: Risposta e segnalibri
ja: 応答とブックマーク
ko: 응답 및 책갈피

source: The response contains parameters required by the application to retrieve the dictionary *results* from the response to get the array of devices returned. Other parameters in the response are required to make further calls, for example, the *_bookmark* element can be used to page through results. Issue the first request without specifying a bookmark, then take the bookmark returned in the response and provide it on the request for the next page. Repeat until the end of the result set indicated by the absence of a bookmark. Each request must use exactly the same values for the other parameters, or the results are undefined.
de: Die Antwort enthält Parameter, die von der Anwendung benötigt werden, um die Wörterverzeichnis*ergebnisse* aus der Antwort abzurufen und die zurückgegebene Gruppe von Geräten zu erhalten. Andere Parameter in der Antwort sind für weitere Aufrufe erforderlich, z. B. kann das Element *_bookmark* zum Blättern in den Ergebnissen verwendet werden. Setzen Sie die erste Anforderung ohne Angabe eines Lesezeichens ab, verwenden Sie dann das in der Antwort zurückgegebene Lesezeichen und geben Sie es in der Anforderung für die nächste Seite an. Wiederholen Sie diesen Vorgang, bis das Ende der Ergebnismenge erreicht ist. Dies wird dadurch gekennzeichnet, dass kein Lesezeichen vorhanden ist. Jede Anforderung muss genau dieselben Werte für die anderen Parameter verwenden, da andernfalls die Ergebnisse nicht definiert sind.
es: La respuesta contiene los parámetros que necesita la aplicación para recuperar el diccionario *results* de la respuesta, para obtener la matriz de los dispositivos devueltos. Se requieren otros parámetros en la respuesta para realizar más llamadas, por ejemplo, el elemento *_bookmark* puede utilizarse para paginar por los resultados. Emita la primera solicitud sin especificar un marcador y, a continuación, devuelva el marcador en la respuesta y proporciónelo en la solicitud de la página siguiente. Repita este paso hasta el final del conjunto de resultados indicado por la ausencia de un marcador. Cada solicitud debe utilizar exactamente los mismos valores para los otros parámetros o los resultados no estarán definidos.
fr: La réponse contient des paramètres dont l'application a besoin pour extraire les *résultats* du dictionnaire de la réponse et obtenir le tableau de terminaux renvoyés. D'autres paramètres de la réponse sont nécessaires pour effectuer d'autres appels, par exemple l'élément *_bookmark* permet de parcourir les pages de résultats. Soumettez la première demande sans indiquer de signet, puis utilisez le signet renvoyé dans la réponse et indiquez-le dans la demande pour la page suivante. Répétez l'opération jusqu'à la fin de l'ensemble de résultats indiquée par l'absence de signet. Chaque demande doit utiliser exactement les mêmes valeurs pour les autres paramètres. Sinon, les résultats ne sont pas définis.
it: La risposta contiene i parametri richiesti dall'applicazione per richiamare i *risultati* del dizionario dalla risposta per ottenere la schiera dei dispositivi restituiti. Nella risposta sono richiesti altri parametri per effettuare ulteriori chiamate, ad esempio l'elemento *_bookmark* può essere utilizzato per sfogliare i risultati. Emettere inizialmente la richiesta senza specificare un segnalibro, quindi fornire il segnalibro restituito nella risposta alla richiesta per la pagina successiva. Ripetere fino alla fine della serie di risultati, indicata dall'assenza di un segnalibro. Ciascuna richiesta deve utilizzare esattamente gli stessi valori per gli altri parametri, altrimenti i risultati saranno indefiniti.
ja: 応答には、応答からのディクショナリーの *results* を取得して返されるデバイスの配列を取得するために、アプリケーションで必要なパラメーターが含まれます。応答のその他のパラメーターは、*_bookmark* 要素などを使用して結果をページ送りするために、さらに呼び出しを実行する場合に必要です。最初の要求はブックマークを指定しないで発行し、次に応答で返されるブックマークを取得して、次のページの要求で指定します。ブックマークがなくなることで示される結果セットの終わりまで繰り返します。各要求は、他のパラメーターと同じ値を正確に使用する必要があります。そうしないと結果が未定義になります。
ko: 응답에는 리턴된 디바이스의 어레이를 가져오기 위해 응답에서 사전 *results*를 검색하는 데 애플리케이션에 필요한 매개변수가 포함됩니다. 응답의 기타 매개변수는 추가 호출을 작성하는 데 필요합니다. 예를 들어, *_bookmark* 요소를 사용하여 페이지별로 결과를 볼 수 있습니다. 책갈피를 지정하지 않고 첫 번째 요청을 발행한 다음 응답에 리턴된 책갈피를 가져와서 그 다음 페이지에 대해 요청 시 제공하십시오. 책갈피의 부재로 표시된 결과 세트의 끝까지 반복하십시오. 각 요청은 기타 매개변수에 대해 정확히 동일한 값을 사용해야 합니다. 그렇지 않으면 결과가 정의되지 않습니다.

source: In order to pass the *_bookmark* or any other condition, the overloaded method must be used. The overloaded method takes the parameters in the form of org.apache.http.message.BasicNameValuePair as shown below,
de: Für die Übergabe des Elements *_bookmark* oder einer anderen Bedingung muss die überladene Methode verwendet werden. Die überladene Methode verwendet die Parameter im Format org.apache.http.message.BasicNameValuePair, wie im Folgenden dargestellt,
es: Para poder pasar *_bookmark* o cualquier otra condición, debe utilizarse el método sobrecargado. El método sobrecargado utiliza parámetros con el formato org.apache.http.message.BasicNameValuePair como se muestra a continuación,
fr: Pour transmettre le paramètre *_bookmark* ou n'importe quelle autre condition, vous devez utiliser la méthode surchargée. La méthode surchargée utilise les paramètres sous la forme org.apache.http.message.PaireValeurNomDeBase, comme indiqué ci-dessous.
it: Per trasmettere *_bookmark* o qualsiasi altra condizione, è necessario utilizzare il metodo sottoposto a overload. Il metodo sottoposto a overload acquisisce i parametri nel formato org.apache.http.message.BasicNameValuePair, come mostrato di seguito.
ja: *_bookmark* またはその他の条件を渡すには、多重定義されたメソッドを使用する必要があります。多重定義されたメソッドは、以下に示すように org.apache.http.message.BasicNameValuePair の形式のパラメーターを取ります。
ko: *_bookmark* 또는 임의의 기타 조건을 전달하려면 과부하된 메소드를 사용해야 합니다. 과부하된 메소드는 아래에 표시된 대로 org.apache.http.message.BasicNameValuePair의 양식으로 매개변수를 가져옵니다.

source: Add Devices in bulk
de: Geräte über eine Massenoperation hinzufügen
es: Añadir dispositivos de forma masiva
fr: Ajout de terminaux en bloc
it: Aggiungere dispositivi in massa
ja: デバイスの一括追加
ko: 대량으로 디바이스 추가

source: The *addMultipleDevices()* method can be used to add one or more devices to your Internet of Things Foundation organization. The maximum size of a request is set to 512KB. In each request, you must first define the devices to be added using the *listOfDevices* variable, as shown in the following code snippet:
de: Die Methode *addMultipleDevices()* kann dazu verwendet werden, ein oder mehrere Geräte zur Internet of Things Foundation-Organisation hinzuzufügen. Die maximal zulässige Größe einer Anforderung beträgt 512 KB. In jeder Anforderung müssen Sie zuerst die hinzuzufügenden Geräte mit der Variablen *listOfDevices* definieren, wie mit dem folgenden Code-Snippet veranschaulicht wird:
es: Puede utilizarse el método *addMultipleDevices()* para añadir uno o varios dispositivos a la organización de Internet of Things Foundation. El tamaño máximo de una solicitud se establece en 512 KB. En cada solicitud, primero debe definir los dispositivos que se van a añadir utilizando la variable *listOfDevices*, como se muestra en el fragmento de código siguiente:
fr: La méthode *addMultipleDevices()* permet d'ajouter un ou plusieurs terminaux à votre organisation Internet of Things Foundation. La taille maximale d'une demande est 512 ko. Dans chaque demande, vous devez d'abord définir les terminaux à ajouter à l'aide de la variable * listOfDevices*, comme indiqué dans le fragment de code suivant :
it: Il metodo *addMultipleDevices()* può essere utilizzato per aggiungere uno o più dispositivi all'organizzazione Internet of Things Foundation. La dimensione massima di una richiesta è impostata su 512KB. In ogni richiesta, è necessario definire inizialmente i dispositivi da aggiungere utilizzando la variabile *listOfDevices*, come mostrato nel frammento di codice di seguito:
ja: *addMultipleDevices()* メソッドを使用すると、1 つ以上のデバイスを Internet of Things Foundation 組織に追加できます。要求の最大サイズは 512 KB に設定されます。各要求で、最初に次のコード・スニペットで示すように、*listOfDevices* 変数を使用して追加するデバイスを定義する必要があります。
ko: *addMultipleDevices()* 메소드는 하나 이상의 디바이스를 Internet of Things Foundation 조직에 추가하는 데 사용할 수 있습니다. 요청의 최대 크기는 512KB로 설정됩니다. 각 요청에서는 다음 코드 스니펫에 표시된 대로 *listOfDevices* 변수를 통해 추가될 디바이스를 먼저 정의해야 합니다.

source: This above code snippet should be inserted after the constructor code in a .py file.
de: Das oben dargestellte Code-Snippet muss in eine .py-Datei eingefügt werden, und zwar nach dem Konstruktorcode.
es: El fragmento de código anterior debe insertarse después del código de constructor en un archivo .py.
fr: Le fragment de code ci-dessus doit être inséré après le code du constructeur dans un fichier .py.
it: Il frammento di codice mostrato in precedenza deve essere inserito dopo il codice costruttore il un file .py.
ja: 上記のこのコード・スニペットは、.py ファイルのコンストラクター・コードの後に挿入する必要があります。
ko: 이러한 위의 코드 스니펫은 .py 파일에서 생성자 코드 다음에 삽입되어야 합니다.

source: The following sample shows an example of the format your final code, and is an example of using the *addMultipleDevices()* method to add two devices.
de: Im folgenden Beispiel ist das Format des endgültigen Codes dargestellt sowie die Verwendung der Methode *addMultipleDevices()* für das Hinzufügen zweier Geräte.
es: A continuación, se muestra un ejemplo del formato del código final que demuestra cómo utilizar el método *addMultipleDevices()* para añadir dos dispositivos.
fr: L'exemple suivant présente le format de votre code final et explique comment utiliser la méthode *addMultipleDevices()* pour ajouter deux terminaux.
it: Il seguente esempio rappresenta il formato del codice finale ed è una dimostrazione dell'utilizzo del metodo *addMultipleDevices()* per aggiungere due dispositivi.
ja: 次のサンプルに、最終コードのフォーマットの例を示しますが、これは *addMultipleDevices()* メソッドを使用して 2 つのデバイスを追加する例です。
ko: 다음 샘플은 최종 코드 형식의 예제를 보여주고 두 개의 디바이스를 추가하기 위한 *addMultipleDevices()* 메소드 사용의 예제입니다.

source: The response will contain the generated authentication tokens for each added device. These authentication tokens must be recorded when processing the response, as lost authentication tokens cannot be retrieved.
de: Die Antwort enthält die generierten Authentifizierungstoken für jedes hinzugefügte Gerät. Diese Authentifizierungstoken müssen beim Verarbeiten der Antwort erfasst werden, da verloren gegangene Authentifizierungstoken nicht wiederhergestellt werden können.
es: La respuesta contendrá las señales de autenticación generadas para cada dispositivo añadido. Estas señales de autenticación deben registrarse cuando se procesa la respuesta, ya que las señales de autenticación perdidas no podrán recuperarse.
fr: La réponse inclut les jetons d'authentification générés pour chaque terminal ajouté. Ces jetons d'authentification doivent être consignés lors du traitement de la réponse car les jetons d'authentification perdus ne peuvent pas être récupérés.
it: La risposta conterrà i token di autenticazione generati per ciascun dispositivo aggiunto. Tali token di autenticazione devono essere registrati durante l'elaborazione della risposta, in quanto i token di autenticazione persi non possono essere recuperati.
ja: 応答には、追加された各デバイス用に生成された認証トークンが含まれます。失われた認証トークンは取得できないので、応答を処理する際にはこれらの認証トークンを記録しておく必要があります。
ko: 응답에는 각 추가된 디바이스의 생성된 인증 토큰이 포함됩니다. 이러한 인증 토큰은 유실된 인증 토큰을 검색할 수 없으므로 응답 처리 시 기록되어야 합니다.

source: Delete Devices in bulk
de: Geräte über eine Massenoperation löschen
es: Suprimir dispositivos de forma masiva
fr: Suppression de terminaux en bloc
it: Eliminare dispositivi in massa
ja: デバイスの一括削除
ko: 대량으로 디바이스 삭제

source: The *deleteMultipleDevices()* method can be used to delete multiple devices from an Internet of Things Foundation organization, each request can contain a maximum of 512KB. In each request, you must first define the devices to be deleted using the *listOfDevices* variable, as shown in the following code snippet:
de: Die Methode *deleteMultipleDevices()* kann dazu verwendet werden, mehrere Geräte aus einer Internet of Things Foundation-Organisation zu löschen, wobei jede Anforderung maximal 512 KB enthalten kann. In jeder Anforderung müssen Sie zuerst die zu löschenden Geräte mit der Variablen *listOfDevices* definieren, wie mit dem folgenden Code-Snippet veranschaulicht wird:
es: Puede utilizarse el método *deleteMultipleDevices()* para suprimir varios dispositivos de una organización de Internet of Things Foundation, donde cada solicitud puede contener un máximo de 512 KB. En cada solicitud, primero debe definir los dispositivos que se van a suprimir utilizando la variable *listOfDevices*, como se muestra en el fragmento de código siguiente:
fr: La méthode *deleteMultipleDevices()* permet de supprimer plusieurs terminaux d'une organisation Internet of Things Foundation ; la taille maximale de chaque demande est 512 ko. Dans chaque demande, vous devez d'abord définir les terminaux à supprimer à l'aide de la variable *listOfDevices*, comme indiqué dans le fragment de code suivant :
it: Il metodo *deleteMultipleDevices()* può essere utilizzato per eliminare più dispositivi da un'organizzazione Internet of Things Foundation, ciascuna richiesta può contenere un massimo di 512KB. In ogni richiesta, è necessario definire inizialmente i dispositivi da eliminare utilizzando la variabile *listOfDevices*, come mostrato nel frammento di codice di seguito:
ja: *deleteMultipleDevices()* メソッドを使用すると、複数のデバイスを Internet of Things Foundation 組織から削除できます。各要求に含められるのは最大で 512 KB です。各要求で、最初に次のコード・スニペットで示すように、*listOfDevices* 変数を使用して削除するデバイスを定義する必要があります。
ko: *deleteMultipleDevices()* 메소드는 Internet of Things Foundation 조직에서 여러 디바이스를 삭제하는 데 사용할 수 있으며, 각 요청에는 최대 512KB가 포함될 수 있습니다. 각 요청에서는 다음 코드 스니펫에 표시된 대로 *listOfDevices* 변수를 통해 삭제될 디바이스를 먼저 정의해야 합니다.

source: The following sample shows an example of the format your final code, and is an example of using the *deleteMultipleDevices()* method to delete two devices.
de: Im folgenden Beispiel ist das Format des endgültigen Codes dargestellt sowie die Verwendung der Methode *deleteMultipleDevices()* für das Löschen zweier Geräte.
es: A continuación, se muestra un ejemplo del formato del código final que demuestra cómo utilizar el método *deleteMultipleDevices()* para suprimir dos dispositivos.
fr: L'exemple suivant présente le format de votre code final et explique comment utiliser la méthode *deleteMultipleDevices()* pour supprimer deux terminaux.
it: Il seguente esempio rappresenta il formato del codice finale ed è una dimostrazione dell'utilizzo del metodo *deleteMultipleDevices()* per eliminare due dispositivi.
ja: 次のサンプルに、最終コードのフォーマットの例を示しますが、これは *deleteMultipleDevices()* メソッドを使用して 2 つのデバイスを削除する例です。
ko: 다음 샘플은 최종 코드 형식의 예제를 보여주고 두 개의 디바이스를 삭제하기 위한 *deleteMultipleDevices()* 메소드 사용의 예제입니다.

source: Device Type Operations
de: Gerätetypenoperationen
es: Operaciones de tipos de dispositivo
fr: Opérations relatives aux types de terminaux
it: Operazioni con i tipi di dispositivo
ja: デバイス・タイプの操作
ko: 디바이스 유형 오퍼레이션

source: Device types can be used as templates for adding device information to devices as they are added to your organization. Applications can use the Internet of Things Foundation API to list, create, delete, view, or update device types in your organization.
de: Gerätetypen können als Vorlagen für das Hinzufügen von Geräteinformationen zu Geräten genutzt werden, wenn diese zur Organisation hinzugefügt werden. Anwendungen können die Internet of Things Foundation-API verwenden, um Gerätetypen in der Organisation aufzulisten, zu erstellen, zu löschen, anzuzeigen oder zu aktualisieren.
es: Los tipos de dispositivo pueden utilizarse como plantillas para añadir información de dispositivos cuando se añaden a la organización. Las aplicaciones pueden utilizar la API de Internet of Things Foundation para listar, crear, suprimir, ver o actualizar tipos de dispositivo en la organización.
fr: Les types de terminaux peuvent être utilisés comme modèles pour ajouter des informations aux terminaux que vous incluez dans votre organisation. Les applications peuvent utiliser l'API Internet of Things Foundation pour répertorier, créer, supprimer, afficher ou mettre à jour les types de terminaux de votre organisation.
it: I tipi di dispositivo possono essere utilizzati come modelli per aggiungere le informazioni sul dispositivo ai dispositivi mentre vengono aggiunti all'organizzazione. Le applicazioni possono utilizzare l'API di Internet of Things Foundation per elencare, creare, eliminare, visualizzare o aggiornare i tipi di dispositivo nell'organizzazione.
ja: デバイス・タイプは、組織に追加するときにデバイス情報を追加するテンプレートとして使用できます。アプリケーションは Internet of Things Foundation API を使用すると、組織のデバイス・タイプのリスト、作成、削除、表示、または更新を実行できます。
ko: 디바이스 유형은 해당 조직에 추가되므로 디바이스에 디바이스 정보를 추가하는 데 템플리트로 사용될 수 있습니다. 애플리케이션은 Internet of Things Foundation API를 사용하여 해당 조직에서 디바이스 유형을 나열하고 작성하며 삭제하고 보거나 업데이트할 수 있습니다.

source: Refer to the Device Types section of the `IBM IoT Foundation API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ documentation for information about the list of query parameters, the request & response model, and http status codes.
de: Der Abschnitt zu den Gerätetypen in der `IBM IoT Foundation-API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__-Dokumentation enthält Informationen zur Liste der Abfrageparameter, zum Anforderungs-/Antwortmodell und zu den HTTP-Statuscodes.
es: Consulte la sección Tipos de dispositivo de la documentación de la `API de IBM IoT Foundation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ para obtener información sobre la lista de parámetros de consulta, el modelo de solicitud y respuesta, y los códigos de estado http.
fr: Reportez-vous à la section relative aux types de terminaux dans la documentation de l'`API IBM IoT Foundation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ pour obtenir des informations sur la liste de paramètres de requête, le modèle de demande et de réponse et les code de statut HTTP.
it: Fare riferimento alla sezione Tipi di dispositivo della documentazione sull'`API di IBM IoT Foundation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ per informazioni sull'elenco dei parametri della query, sul modello di richiesta e risposta e sui codici stato HTTP.
ja: 照会パラメーター、要求と応答のモデル、および HTTP 状況コードのリストについての情報は、`「IBM IoT Foundation API」の「デバイス・タイプ (Device Types)」セクション <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ の資料を参照してください。
ko: 조회 매개변수, 요청 및 응답 모델과 http 상태 코드의 목록에 대한 정보는 `IBM IoT Foundation API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ 문서의 디바이스 유형 섹션을 참조하십시오.

source: Get all Device Types
de: Alle Gerätetypen abrufen
es: Obtener todos los tipos de dispositivo
fr: Extraction de tous les types de terminaux
it: Richiamare tutti i tipi di dispositivo
ja: すべてのデバイス・タイプの取得
ko: 모든 디바이스 유형 가져오기

source: The *getAllDeviceTypes()* method can be used to retrieve all device types in your Internet of Things Foundation organization. For example,
de: Die Methode *getAllDeviceTypes()* kann dazu verwendet werden, alle Gerätetypen in der Internet of Things Foundation-Organisation abzurufen. Beispiel:
es: Puede utilizarse el método *getAllDeviceTypes()* para recuperar todos los tipos de dispositivo en la organización de Internet of Things Foundation. Por ejemplo,
fr: La méthode *getAllDeviceTypes()* permet d'extraire tous les types de terminaux de votre organisation Internet of Things Foundation. Par exemple :
it: Il metodo *getAllDeviceTypes()* può essere utilizzato per richiamare tutti i tipi di dispositivo nell'organizzazione Internet of Things Foundation. Ad esempio,
ja: *getAllDeviceTypes()* メソッドを使用すると、Internet of Things Foundation 組織のすべてのデバイス・タイプを取得できます。次に例を示します。
ko: *getAllDeviceTypes()* 메소드는 Internet of Things Foundation 조직에서 모든 디바이스 유형을 검색하는 데 사용할 수 있습니다. 예를 들어, 다음과 같습니다.
