Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python_cli_for_api.po
Languages: de, es, fr, it, ja, ko

source: severity: This variable is optional. If used it corresponds to the severity of the diagnostic log, and should be 0, 1, or 2, corresponding to the informational, warning, and error categories.
de: severity: Diese Variable ist optional. Wenn sie verwendet wird, entspricht sie dem Schweregrad des Diagnoseprotokolls und muss den Wert 0, 1 oder 2 für die Kategorien 'Informationsnachricht', 'Warnung' bzw. 'Fehlernachricht' aufweisen.
es: severity: esta variable es opcional. Si se utiliza, corresponde a la gravedad del registro de diagnóstico y debe ser 0, 1 o 2, para las categorías informativa, de aviso y de error, respectivamente.
fr: severity : Cette variable est facultative. Si elle est utilisée, elle correspond au niveau de gravité du journal de diagnostic et doit avoir pour valeur 0, 1 ou 2 pour les catégories Informations, Avertissement et Erreur.
it: severity: Questa variabile è facoltativa. Se utilizzata, corrisponde alla severità del log di diagnostica e deve avere un valore tra 0, 1 o 2, che corrispondono alle categorie informativa, di avvertenza o di errore.
ja: severity: この変数はオプションです。使用すると、診断ログの重大度に対応し、0、1、または 2 がそれぞれ情報、警告、エラーのカテゴリーに対応します。
ko: 심각도: 이 변수는 선택사항입니다. 사용되는 경우 진단 로그의 심각도에 해당하고 정보용, 경고 및 오류 카테고리에 해당하는 0, 1 또는 2여야 합니다.

source: data: This variable is optional, and should contain diagnostic data.
de: data: Diese Variable ist optional und enthält Diagnosedaten.
es: data: esta variable es opcional y debe contener datos de diagnóstico.
fr: data : Cette variable est facultative et doit inclure des données de diagnostic.
it: data: Questa variabile è facoltativa e deve contenere dati di diagnostica.
ja: data: この変数はオプションで、診断データを含める必要があります。
ko: 데이터: 이 변수는 선택사항이고 진단 데이터를 포함해야 합니다.

source: timestamp: This variable is optional, and contains the date and time of the log entry in ISO8601 format. If this variable is not included, it is automatically added with the current date and time.
de: timestamp: Diese Variable ist optional und enthält das Datum und die Uhrzeit des Protokolleintrags im ISO8601-Format. Wird diese Variable nicht angegeben, wird der Eintrag automatisch mit dem aktuellen Datum und der aktuellen Uhrzeit hinzugefügt.
es: timestamp: esta variable es opcional y contiene la fecha y la hora de la entrada de registro en formato ISO8601. Si esta variable no se incluye, se añade automáticamente con la fecha y hora actuales.
fr: timestamp : Cette variable est facultative et inclut la date et l'heure de l'entrée de journal au format ISO8601. Si cette variable n'est pas incluse, elle est ajoutée automatiquement avec la date et l'heure en cours.
it: timestamp: Questa variabile è facoltativa e contiene la data e l'ora della voce di log nel formato ISO8601. Se questa variabile non è inclusa, viene aggiunta automaticamente con la data e l'ora correnti.
ja: timestamp: この変数はオプションで、ログのエントリーの日付と時刻が ISO8601 形式で含まれます。この変数が含まれないと、現在の日付と時刻が自動的に追加されます。
ko: 시간소인: 이 변수는 선택사항이고 ISO8601 형식에서 로그 항목의 날짜 및 시간을 포함합니다. 이 변수가 포함되지 않는 경우 현재 날짜 및 시간과 함께 자동으로 추가됩니다.

source: The other necessary paramteres required in the method are the deviceTypeId and deviceId for the specific device.
de: Darüber hinaus sind in der Methode die Parameter 'deviceTypeId' und 'deviceId' für das jeweilige Gerät erforderlich.
es: Los otros parámetros necesarios en el método son deviceTypeId y deviceId para el dispositivo específico.
fr: Les autres paramètres obligatoires pour la méthode sont deviceTypeId et deviceId pour le terminal spécifique.
it: Gli altri parametri necessari richiesti nel metodo sono deviceTypeId e deviceId per lo specifico dispositivo.
ja: メソッドで要求されるその他の必要なパラメーターは、特定のデバイスの deviceTypeId と deviceId です。
ko: 메소드에 필요한 기타 필수 매개변수는 특정 디바이스에 대해 deviceTypeId 및 deviceId입니다.

source: The code sample below contains an example of the method.
de: Das unten aufgeführte Codebeispiel enthält ein Beispiel der Methode.
es: El ejemplo de código siguiente es un ejemplo del método.
fr: Le code ci-dessous présente un exemple d'utilisation de la méthode.
it: L'esempio di codice riportato di seguito contiene una dimostrazione del metodo.
ja: 以下のコード・サンプルに、メソッドの例が含まれます。
ko: 아래의 코드 샘플은 메소드의 예제를 포함합니다.

source: Retrieve a specific Diagnostic log
de: Bestimmtes Diagnoseprotokoll abrufen
es: Recuperar un registro de diagnóstico específico
fr: Extraction d'un journal de diagnostic spécifique
it: Richiamare uno specifico log di diagnostica
ja: 特定の診断ログの取得
ko: 특정 진단 로그 검색

source: The *getDiagnosticLog()* method is used to retrieve a specific diagnostic log for a specified device based on the log id. The required parameters for this method are the deviceTypeId, deviceId, and logId.
de: Die Methode *getDiagnosticLog()* wird dazu verwendet, ein bestimmtes Diagnoseprotokoll für ein angegebenes Gerät auf der Basis der Protokoll-ID abzurufen. Für diese Methode sind die Parameter 'deviceTypeId', 'deviceId' und 'logId' erforderlich.
es: El método *getDiagnosticLog()* se utiliza para recuperar un registro de diagnóstico específico para un determinado dispositivo basándose en el ID de registro. Los parámetros necesarios para este método son deviceTypeId, deviceId y logId.
fr: La méthode *getDiagnosticLog()* permet d'extraire un journal de diagnostic spécifique d'un terminal indiqué en fonction de l'ID journal. Les paramètres obligatoires pour cette méthode sont deviceTypeId, deviceId et logId.
it: Il metodo *getDiagnosticLog()* viene utilizzato per richiamare uno specifico log di diagnostica per un determinato dispositivo in base all'ID del log. I parametri richiesti per questo metodo sono deviceTypeId, deviceId e logId.
ja: *getDiagnosticLog()* メソッドを使用すると、ログ ID に基づいて、指定されたデバイスの特定の診断ログが取得されます。このメソッドの必須パラメーターは、deviceTypeId、deviceId、および logId です。
ko: *getDiagnosticLog()* 메소드는 로그 ID에 기반하여 지정된 디바이스에 대해 특정 진단 로그를 검색하는 데 사용됩니다. 이 메소드의 필수 매개변수는 deviceTypeId, deviceId 및 logId입니다.

source: Delete a Diagnostic log
de: Diagnoseprotokoll löschen
es: Suprimir un registro de diagnóstico
fr: Suppression d'un journal de diagnostic
it: Eliminare un log di diagnostica
ja: 診断ログの削除
ko: 진단 로그 삭제

source: The *deleteDiagnosticLog()* can be used to delete a specific diagnostic log. In order to specify a diagnostic log, the deviceTypeId, deviceId, and logId parameters should be supplied.
de: Die Methode *deleteDiagnosticLog()* kann dazu verwendet werden, ein bestimmtes Diagnoseprotokoll zu löschen. Zur Angabe eines Diagnoseprotokolls müssen die Parameter 'deviceTypeId', 'deviceId' und 'logId' angegeben werden.
es: Puede utilizar *deleteDiagnosticLog()* para suprimir un registro de diagnóstico específico. Para poder especificar un registro de diagnóstico, deben proporcionarse los parámetros deviceTypeId, deviceId y logId.
fr: La méthode *deleteDiagnosticLog()* permet de supprimer un journal de diagnostic spécifique. Pour indiquer un journal de diagnostic, vous devez utiliser les paramètres deviceTypeId, deviceId et logId.
it: *deleteDiagnosticLog()* può essere utilizzato per eliminare uno specifico log di diagnostica. Per specificare un log di diagnostica, è necessario fornire i parametri deviceTypeId, deviceId e logId.
ja: *deleteDiagnosticLog()* を使用すると、特定の診断ログを削除できます。診断ログを指定するには、deviceTypeId、deviceId、および logId のパラメーターを指定する必要があります。
ko: *deleteDiagnosticLog()*는 특정 진단 로그를 삭제하는 데 사용할 수 있습니다. 진단 로그를 지정하려면 deviceTypeId, deviceId 및 logId 매개변수가 제공되어야 합니다.

source: Retrieve Device Error Codes
de: Gerätefehlercodes abrufen
es: Recuperar códigos de error de dispositivo
fr: Extraction des codes d'erreur d'un terminal
it: Richiamare i codici di errore del dispositivo
ja: デバイスのエラー・コードの取得
ko: 디바이스 오류 코드 검색

source: The *getAllDiagnosticErrorCodes()* method is used to retrieve all diagnostic error codes associated with a specific device.
de: Die Methode *getAllDiagnosticErrorCodes()* wird dazu verwendet, alle Diagnosefehlercodes abzurufen, die einem bestimmten Gerät zugeordnet sind.
es: El método *getAllDiagnosticErrorCodes()* se utiliza para recuperar todos los códigos de error de diagnóstico asociados con un dispositivo específico.
fr: La méthode *getAllDiagnosticErrorCodes()* permet d'extraire tous les codes d'erreur de diagnostic associés à un terminal spécifique.
it: Il metodo *getAllDiagnosticErrorCodes()* viene utilizzato per richiamare tutti i codici di errore di diagnostica associati a uno specifico dispositivo.
ja: *getAllDiagnosticErrorCodes()* メソッドを使用すると、特定のデバイスに関連付けられたすべての診断エラー・コードが取得されます。
ko: *getAllDiagnosticErrorCodes()* 메소드는 특정 디바이스와 연관된 모든 진단 오류 코드를 검색하는 데 사용됩니다.

source: Clear Diagnostic Error Codes
de: Diagnosefehlercodes löschen
es: Borrar códigos de error de diagnóstico
fr: Effacement des codes d'erreur de diagnostic
it: Cancellare i codici di errore di diagnostica
ja: 診断エラー・コードの消去
ko: 진단 오류 코드 지우기

source: The *clearAllErrorCodes()* method is used to clear the list of error codes associated with the device. The list is replaced with a single error code of zero.
de: Die Methode *clearAllErrorCodes()* wird dazu verwendet, die Liste der Fehlercodes, die dem Gerät zugeordnet sind, zu löschen. Die Liste wird durch den einzelnen Fehlercode 0 ersetzt.
es: El método *clearAllErrorCodes()* se utiliza para borrar la lista de códigos de error asociados con el dispositivo. La lista se sustituye por un código de error individual igual a cero.
fr: La méthode *clearAllErrorCodes()* permet d'effacer la liste des codes d'erreur associés au terminal. La liste est remplacée par le code d'erreur unique 0.
it: Il metodo *clearAllErrorCodes()* viene utilizzato per cancellare l'elenco dei codici di errore associati al dispositivo. L'elenco viene sostituito da un singolo codice di errore con valore zero.
ja: *clearAllErrorCodes()* メソッドを使用すると、デバイスに関連付けられたエラー・コードのリストがクリアされます。リストは単一エラー・コードのゼロに置き換えられます。
ko: *clearAllErrorCodes()* 메소드는 디바이스와 연관된 오류 코드의 목록을 지우는 데 사용됩니다. 이 목록은 0의 단일 오류 코드로 바뀝니다.

source: Add single Diagnostic ErrorCode
de: Einzelnen Diagnosefehlercode hinzufügen
es: Añadir ErrorCode de diagnóstico individual
fr: Ajout d'un code d'erreur de diagnostic unique
it: Aggiungere un singolo codice di errore di diagnostica
ja: 単一の診断 ErrorCode の追加
ko: 단일 진단 ErrorCode 추가

source: The *addErrorCode()* method is used to add an error code to the list of error codes associated with the device. The list may be pruned as the new entry is added. The parameters required in the method are deviceTypeId, deviceId, and errorCode. The errorCode parameter contains the following variables:
de: Die Methode *addErrorCode()* wird dazu verwendet, einen Fehlercode zur Liste der Fehlercodes hinzuzufügen, die dem Gerät zugeordnet sind. Die Liste kann beim Hinzufügen des neuen Eintrags bereinigt werden. In dieser Methode sind die Parameter 'deviceTypeId', 'deviceId' und 'errorCode' erforderlich. Der Parameter 'errorCode' enthält die folgenden Variablen:
es: El método *addErrorCode()* se utiliza para añadir un código de error a la lista de códigos de error asociados con el dispositivo. La lista puede borrarse cuando se añade la nueva entrada. Los parámetros necesarios en el método son deviceTypeId, deviceId y errorCode. El parámetro errorCode contiene las siguientes variables:
fr: La méthode *addErrorCode()* permet d'ajouter un code d'erreur à la liste des codes d'erreur associés au terminal. Des entrées de la liste peuvent être supprimées au fur et à mesure que de nouvelles entrées sont ajoutées. Les paramètres obligatoires pour la méthode sont deviceTypeId, deviceId et errorCode. Le paramètre errorCode contient les variables suivantes :
it: Il metodo *addErrorCode()* viene utilizzato per aggiungere un codice di errore all'elenco dei codici di errore associati al dispositivo. Con l'aggiunta di una nuova voce, l'elenco potrebbe essere ridotto. I parametri richiesti nel metodo sono deviceTypeId, deviceId e errorCode. Il parametro errorCode contiene le seguenti variabili:
ja: *addErrorCode()* メソッドを使用すると、エラー・コードがデバイスに関連付けられたエラー・コードのリストに追加されます。新しいエントリーが追加されると、リストが整理されることがあります。メソッドで必要なパラメーターは、deviceTypeId、deviceId、および errorCode です。errorCode パラメーターには、次の変数が含まれます。
ko: *addErrorCode()* 메소드는 디바이스와 연관된 오류 코드의 목록에 오류 코드를 추가하는 데 사용됩니다. 목록은 새 항목이 추가되면서 프루닝될 수 있습니다. 메소드에 필요한 매개변수는 deviceTypeId, deviceId 및 errorCode입니다. errorCode 매개변수는 다음 변수를 포함합니다.

source: errorCode: This variable is mandatory and should be set as an integer. This sets the number of the error code to be created.
de: errorCode: Diese Variable ist obligatorisch und muss als ganze Zahl definiert werden. Hiermit wird die Nummer des zu erstellenden Fehlercodes festgelegt.
es: errorCode: esta variable es obligatoria y debe establecerse como un entero. Establece el número del código de error que se va a crear.
fr: errorCode : Cette variable est obligatoire et doit correspondre à un entier. Elle définit le nombre de codes d'erreur à créer.
it: errorCode: Questa variabile è obbligatoria e deve essere impostata su un numero intero. Ha lo scopo di impostare il numero del codice di errore da creare.
ja: errorCode: この変数は必須で、整数として設定する必要があります。これは、作成するエラー・コードの数を設定します。
ko: errorCode: 이 변수는 필수이며 정수로 설정되어야 합니다. 이는 작성될 오류 코드의 수를 설정합니다.

source: Connection problem determination
de: Problembestimmung bei Verbindungsproblemen
es: Determinación de problemas de conexión
fr: Identification d'un problème de connexion
it: Determinazione di un problema di connessione
ja: 接続の問題判別
ko: 연결 문제점 판별

source: The *getDeviceConnectionLogs()* method is used to list connection log events for a device. This information can be used to help diagnose connectivity problems between the device and the Internet of Things Foundation service. The entries record successful connection, unsuccessful connection attempts, intentional disconnection and server-initiated disconnection events.
de: Die Methode *getDeviceConnectionLogs()* wird dazu verwendet, Verbindungsprotokollereignisse für ein Gerät aufzulisten. Diese Informationen können dazu verwendet werden, Konnektivitätsprobleme zwischen dem Gerät und dem Internet of Things Foundation-Service zu diagnostizieren. Mit den Einträgen werden erfolgreiche Verbindungen, nicht erfolgreiche Verbindungsversuche, absichtliche Verbindungstrennungsereignisse und vom Server initiierte Verbindungstrennungsereignisse aufgezeichnet.
es: El método *getDeviceConnectionLogs()* se utiliza para listar los sucesos de registro de conexión de un dispositivo. Esta información puede utilizarse para diagnosticar problemas de conectividad entre el dispositivo y el servicio Internet of Things Foundation. Las entradas registran los sucesos de conexión satisfactoria, intentos de conexión no satisfactorios, desconexión intencional y desconexión iniciada por el servidor.
fr: La méthode *getDeviceConnectionLogs()* permet d'afficher la liste des événements du journal des connexions d'un terminal. Ces informations peuvent être utilisées pour diagnostiquer les problèmes de connectivité entre le terminal et le service Internet of Things Foundation. Les entrées consignent des événements signalant les connexions réussies, les échecs des tentatives de connexion, les déconnexions intentionnelles et les déconnexions initiées par le serveur.
it: Il metodo *getDeviceConnectionLogs()* viene utilizzato per elencare gli eventi del log di connessione per un dispositivo. Queste informazioni possono essere utilizzate per agevolare la diagnosi dei problemi di connettività tra il dispositivo e il servizio di Internet of Things Foundation. Le voci registrano le connessioni riuscite, i tentativi di connessione non riusciti, le disconnessioni intenzionali e gli eventi di disconnessione avviati dal server.
ja: *getDeviceConnectionLogs()* メソッドを使用すると、デバイスの接続ログ・イベントがリストされます。この情報を使用すると、デバイスと Internet of Things Foundation サービスの間の接続の問題を診断できます。エントリーは、成功した接続、失敗した接続試行、意図的な切断、サーバーが開始した切断イベントを記録します。
ko: *getDeviceConnectionLogs()* 메소드는 디바이스에 대해 연결 로그 이벤트를 나열하는 데 사용됩니다. 이 정보를 사용하여 디바이스 및 Internet of Things Foundation 서비스 간의 연결 문제점을 진단하는데 도움을 받을 수 있습니다. 항목은 성공적인 연결, 실패한 연결 시도, 의도된 연결 끊기 및 서버 시작 연결 끊기 이벤트를 기록합니다.

source: The response includes a list of log entries, containing log messages and timestamps.
de: Die Antwort enthält eine Liste mit Protokolleinträgen, die Protokollnachrichten und Zeitmarken umfasst.
es: La respuesta incluye una lista de entradas de registro, que contienen mensajes de registro e indicaciones de fecha y hora.
fr: La réponse inclut une liste d'entrées de journal incluant les messages et les horodatages du journal.
it: La risposta include un elenco di voci di log che contengono messaggi di log e date/ore.
ja: 応答には、ログ・メッセージとタイム・スタンプを含むログ・エントリーのリストが含まれます。
ko: 응답에는 로그 메시지 및 시간소인을 포함하여 로그 항목의 목록이 포함됩니다.

source: Historical Event Retrieval
de: Abrufen historischer Ereignisse
es: Recuperación de sucesos históricos
fr: Extraction des événements d'historique
it: Richiamo degli eventi cronologici
ja: 履歴イベントの取得
ko: 히스토리 이벤트 검색

source: These operations can be used to view events from all devices, view events from a device type or to view events for a specific device.
de: Diese Operationen können dazu verwendet werden, Ereignisse aller Geräte, Ereignisse eines bestimmten Gerätetyps und Ereignisse eines bestimmten Geräts anzuzeigen.
es: Estas operaciones pueden utilizarse para ver sucesos procedentes de todos los dispositivos, ver sucesos procedentes de un tipo de dispositivo o ver sucesos de un dispositivo específico.
fr: Ces opérations permettent d'afficher les événements de tous les terminaux, d'un type de terminal ou d'un terminal spécifique.
it: Queste operazioni possono essere utilizzate per visualizzare gli eventi da tutti i dispositivi, per visualizzare gli eventi da un tipo di dispositivo o per visualizzare gli eventi per un dispositivo specifico.
ja: これらの操作を使用すると、全デバイスのイベントの表示、1 つのデバイス・タイプのイベントの表示、特定のデバイスのイベントの表示を行うことができます。
ko: 이러한 오퍼레이션은 모든 디바이스에서 이벤트를 보고 디바이스 유형에서 이벤트를 보거나 특정 디바이스에 대해 이벤트를 보는 데 사용할 수 있습니다.

source: Refer to the Historical Event Retrieval section of the `IBM IoT Foundation Connect API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ for information about the list of query parameters, the request & response model and http status code.
de: Der Abschnitt zum Abrufen historischer Ereignisse in der `IBM IoT Foundation Connect-API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__-Dokumentation enthält Informationen zur Liste der Abfrageparameter, zum Anforderungs-/Antwortmodell und zum HTTP-Statuscode.
es: Consulte la sección Recuperación de sucesos históricos de la `API de IBM IoT Foundation Connect <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ para obtener información sobre la lista de parámetros de consulta, el modelo de solicitud y respuesta, y el código de estado http.
fr: Reportez-vous à la section décrivant l'extraction des événements d'historique dans la page `API IBM IoT Foundation Connect <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ pour obtenir des informations sur la liste de requêtes, le modèle de demande et de réponse et le code de statut http.
it: Fare riferimento alla sezione Richiamo evento cronologico dell'`API di IBM IoT Foundation Connect <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ per informazioni sull'elenco dei parametri di query, sul modello di richiesta e di risposta e sul codice stato HTTP.
ja: 照会パラメーター、要求と応答のモデル、および HTTP 状況コードのリストについての情報は、`「IBM IoT Foundation Connect API」の「履歴イベントの取得」セクション <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ を参照してください。
ko: 조회 매개변수, 요청 및 응답 모델과 http 상태 코드의 목록에 대한 정보는 `IBM IoT Foundation 연결 API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__의 히스토리 이벤트 검색 절을 참조하십시오.

source: View events from all devices
de: Ereignisse aller Geräte anzeigen
es: Ver los sucesos de todos los dispositivos
fr: Affichage des événements de tous les terminaux
it: Visualizzare eventi da tutti i dispositivi
ja: すべてのデバイスのイベントを表示
ko: 모든 디바이스에서 이벤트 보기

source: Method getHistoricalEvents() can be used to view events across all devices registered to the organization.
de: Die Methode 'getHistoricalEvents()' kann dazu verwendet werden, Ereignisse aller Geräte anzuzeigen, die für die Organisation registriert sind.
es: El método getHistoricalEvents() puede utilizarse para ver sucesos en todos los dispositivos registrados en la organización.
fr: La méthode getHistoricalEvents() permet d'afficher les événements de tous les terminaux enregistrés dans l'organisation.
it: Il metodo getHistoricalEvents() può essere utilizzato per visualizzare gli eventi tramite tutti i dispositivi registrati con l'organizzazione.
ja: getHistoricalEvents() メソッドを使用すると、組織に登録されたすべてのデバイスのイベントを表示できます。
ko: 메소드 getHistoricalEvents()는 조직에 등록된 모든 디바이스 간에 이벤트를 보는 데 사용할 수 있습니다.
