Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python_cli_for_api.po
Languages: de, es, fr, it, ja, ko

source: Get Devices of a particular Device Type
de: Geräte eines bestimmten Gerätetyps abrufen
es: Obtener dispositivos de un determinado tipo de dispositivo
fr: Extraction des terminaux d'un type spécifique
it: Richiamare i dispositivi di uno specifico tipo di dispositivo
ja: 特定のデバイス・タイプの取得
ko: 특정한 디바이스 유형의 디바이스 가져오기

source: The *retrieveDevices()* method can be used to retrieve all the devices of a particular device type in an organization from Internet of Things Foundation. For example,
de: Die Methode *retrieveDevices()* kann dazu verwendet werden, alle Geräte eines bestimmten Gerätetyps in einer Organisation aus Internet of Things Foundation abzurufen. Beispiel:
es: Puede utilizarse el método *retrieveDevices()* para recuperar todos los dispositivos de un determinado tipo de dispositivo en una organización de Internet of Things Foundation. Por ejemplo,
fr: La méthode *retrieveDevices()* permet d'extraire tous les terminaux d'un type spécifique dans une organisation Internet of Things Foundation. Par exemple :
it: Il metodo *retrieveDevices()* può essere utilizzato per richiamare tutti i dispositivi di uno specifico tipo in un'organizzazione da Internet of Things Foundation. Ad esempio,
ja: *retrieveDevices()* メソッドを使用すると、Internet of Things Foundation から組織の特定のデバイス・タイプをすべて取得できます。次に例を示します。
ko: *retrieveDevices()* 메소드는 Internet of Things Foundation에서 조직에 있는 특정한 디바이스 유형의 모든 디바이스를 검색하는 데 사용할 수 있습니다. 예를 들어, 다음과 같습니다.

source: In order to pass the *_bookmark* or any other condition, the overloaded method must be used. The overloaded method takes the parameters in the form of dictionary as shown below,
de: Für die Übergabe des Elements *_bookmark* oder einer anderen Bedingung muss die überladene Methode verwendet werden. Die überladene Methode verwendet die Parameter im Wörterverzeichnisformat, wie im Folgenden dargestellt,
es: Para poder pasar *_bookmark* o cualquier otra condición, debe utilizarse el método sobrecargado. El método sobrecargado utiliza parámetros con formato de diccionario como se muestra a continuación,
fr: Pour transmettre le paramètre *_bookmark* ou n'importe quelle autre condition, vous devez utiliser la méthode surchargée. La méthode surchargée utilise les paramètres sous la forme d'un dictionnaire, comme indiqué ci-dessous.
it: Per trasmettere *_bookmark* o qualsiasi altra condizione, è necessario utilizzare il metodo sottoposto a overload. Il metodo sottoposto a overload acquisisce i parametri nel formato di un dizionario, come mostrato di seguito.
ja: *_bookmark* またはその他の条件を渡すには、多重定義されたメソッドを使用する必要があります。多重定義されたメソッドは、以下に示すディクショナリーの形式でパラメーターを取得します。
ko: *_bookmark* 또는 임의의 기타 조건을 전달하려면 과부하된 메소드를 사용해야 합니다. 과부하된 메소드는 아래에 표시된 대로 사전의 양식으로 매개변수를 가져옵니다.

source: The above snippet sorts the response based on device id and uses the bookmark to page through the results.
de: Mit dem oben dargestellten Snippet wird die Antwort auf der Basis der Geräte-ID sortiert und das Lesezeichen verwendet, um in den Ergebnissen zu blättern.
es: El fragmento de código anterior ordena la repuesta basándose en el ID de dispositivo y utiliza el marcador para paginar por los resultados.
fr: Le fragment ci-dessus trie la réponse en fonction de l'ID terminal et utilise un signet pour parcourir les pages de résultats.
it: Il frammento riportato in precedenza ordina la risposta in base all'ID del dispositivo e utilizza il segnalibro per sfogliare i risultati.
ja: 上記のスニペットは、デバイス ID に基づいて応答をソートし、ブックマークを使用して結果をページ送りします。
ko: 위의 스니펫은 디바이스에 기반하여 응답을 정렬하고 책갈피를 사용하여 페이지별로 결과를 봅니다.

source: Add a Device
de: Gerät hinzufügen
es: Añadir un dispositivo
fr: Ajout d'un terminal
it: Aggiungere un dispositivo
ja: デバイスの追加
ko: 디바이스 추가

source: The *registerDevice()* method is used to add a device to an Internet of Things Foundation organization. The *registerDevice()* method adds a single device to your Internet of Things Foundation organization. The parameters which can be set when adding a device are:
de: Die Methode *registerDevice()* wird dazu verwendet, ein Gerät zu einer Internet of Things Foundation-Organisation hinzuzufügen. Mit der Methode *registerDevice()* wird ein einzelnes Gerät zur Internet of Things Foundation-Organisation hinzugefügt. Die folgenden Parameter können beim Hinzufügen eines Geräts festgelegt werden:
es: El método *registerDevice()* se utiliza para añadir un dispositivo a una organización de Internet of Things Foundation. El método *registerDevice()* añade un único dispositivo a la organización de Internet of Things Foundation. Los parámetros que pueden establecerse cuando se añade un dispositivo son:
fr: La méthode *registerDevice()* permet d'ajouter un terminal à une organisation Internet of Things Foundation. Elle ajoute un terminal unique à votre organisation Internet of Things Foundation. Les paramètres qui peuvent être définis lors de l'ajout d'un terminal sont les suivants :
it: Il metodo *registerDevice()* viene utilizzato per aggiungere un dispositivo a un'organizzazione Internet of Things Foundation. Il metodo *registerDevice()* aggiunge un singolo dispositivo all'organizzazione Internet of Things Foundation. I parametri che è possibile impostare durante l'aggiunta di un dispositivo sono:
ja: *registerDevice()* メソッドを使用すると、Internet of Things Foundation 組織にデバイスが追加されます。*registerDevice()* メソッドは、Internet of Things Foundation 組織に 1 つのデバイスを追加します。デバイスを追加する際に設定できるパラメーターは、次のとおりです。
ko: *registerDevice()* 메소드는 Internet of Things Foundation 조직에 디바이스를 추가하는 데 사용됩니다. *registerDevice()* 메소드는 Internet of Things Foundation 조직에 단일 디바이스를 추가합니다. 디바이스 추가 시 설정할 수 있는 매개변수는 다음과 같습니다.

source: deviceTypeId: *Optional*. Assigns a device type to the device. Where there is a clash between variables defined by the device type and variables defined by under deviceInfo, the device specific variables will take precedence.
de: deviceTypeId: *Optional*. Weist dem Gerät einen Gerätetyp zu. Wenn zwischen den durch den Gerätetyp definierten Variablen und den unter 'deviceInfo' definierten Variablen ein Konflikt besteht, haben die gerätespezifischen Variablen Vorrang.
es: deviceTypeId: *Optional*. Asigna un tipo de dispositivo al dispositivo. Cuando hay un conflicto entre las variables definidas por el tipo de dispositivo y las variables definidas por deviceInfo, las variables específicas del dispositivo tendrán prioridad.
fr: deviceTypeId: *Facultatif*. Affecte un type de terminal au terminal. Lorsqu'il y a un conflit entre les variables définies par le type de terminal et les variables définies par deviceInfo, les variables propres au terminal ont priorité.
it: deviceTypeId: *Facoltativo*. Assegna un tipo al dispositivo. Nel caso in cui vi siano incongruenze tra le variabili definite dal tipo di dispositivo e le variabili definite in deviceInfo, le variabili specifiche del dispositivo avranno precedenza.
ja: deviceTypeId: *Optional* です。デバイス・タイプをデバイスに割り当てます。デバイス・タイプによって定義された変数と deviceInfo で定義された変数が競合する場合は、デバイス固有の変数が優先されます。
ko: deviceTypeId: *Optional*. 디바이스 유형을 디바이스에 지정합니다. 디바이스 유형에서 정의된 변수 및 deviceInfo에서 정의된 변수 간에 충돌이 있는 경우 디바이스 특정 변수가 우선합니다.

source: deviceId: *Mandatory*.
de: deviceId: *Obligatorisch*.
fr: deviceId : *Obligatoire*.
it: deviceId: *Obbligatorio*.
ja: deviceId: *Mandatory* です。

source: authToken: *Optional*. If no authentication token is supplied, one will be generated and included in the response.
de: authToken: *Optional*. Wenn kein Authentifizierungstoken angegeben wird, wird eines generiert und in die Antwort eingefügt.
es: authToken: *Optional*. Si no se suministra ninguna señal de autenticación, se generará una y se incluirá en la respuesta.
fr: authToken : *Facultatif*. Si aucun jeton d'authentification n'est indiqué, un jeton est généré et inclus dans la réponse.
it: authToken: *Facoltativo*. Se non viene fornito alcun token di autenticazione, un token verrà generato e incluso nella risposta.
ja: authToken: *Optional* です。認証トークンが指定されない場合は生成され、応答に含められます。
ko: authToken: *Optional*. 인증 토큰이 제공되지 않은 경우 생성되어 응답에 포함됩니다.

source: deviceInfo: *Optional*. This parameter is optional, and can contain a number of variables, including: serialNumber, manufacturer, model, deviceClass, description, firmware and hardware versions, and descriptiveLocation.
de: deviceInfo: *Optional*. Dieser Parameter ist optional und kann eine Reihe von Variablen enthalten, wie z. B. Seriennummer, Hersteller, Modell, Geräteklasse, Beschreibung, Firmware- und Hardwareversion sowie beschreibender Standort.
es: deviceInfo: *Optional*. Este parámetro es opcional y puede contener varias variables, entre ellas: serialNumber, fabricante, modelo, deviceClass, descripción, versiones de firmware y hardware, y descriptiveLocation.
fr: deviceInfo: *Facultatif*. Ce paramètre est facultatif et peut inclure un certain nombre de variables, notamment serialNumber, manufacturer, model, deviceClass, description, firmware and hardware versions et descriptiveLocation.
it: deviceInfo: *Facoltativo*. Questo parametro è facoltativo e può contenere alcune variabili, tra le quali: numero di serie, produttore, modello, classe dispositivo, descrizione, versioni di firmware e hardware e ubicazione descrittiva.
ja: deviceInfo: *Optional* オプションです。このパラメーターはオプションであり、serialNumber、製造者、モデル、deviceClass、説明、ファームウェアとハードウェアのバージョン、descriptiveLocation などの多数の変数を含めることができます。
ko: deviceInfo: *Optional*. 이 매개변수는 선택사항이며 serialNumber, 제조업체, 모델, deviceClass, 설명, 펌웨어 및 하드웨어 버전과 descriptiveLocation을 포함하여 다수의 변수를 포함할 수 있습니다.

source: metadata: *Optional*. Metadata can optionally be added in the form of custom field:value string pairs. An example is given in the code sample below.
de: metadata: *Optional*. Metadaten können optional in Form von angepassten 'Feld:Wert'-Zeichenfolgepaaren hinzugefügt werden. Das nachfolgende Codebeispiel veranschaulicht dies.
es: metadata: *Optional*. Los metadatos pueden añadirse de manera opcional en forma de pares de serie campo:valor personalizados. A continuación, se muestra un ejemplo de código.
fr: metadata : *Facultatif*. Vous pouvez ajouter des métadonnées sous la forme de paires de chaînes personnalisées zone:valeur. Un exemple est présenté dans le code ci-dessous.
it: metadata: *Facoltativo*. I metadati possono essere aggiunti facoltativamente sotto forma di coppie di stringhe campo:valore personalizzate. Il codice di seguito fornisce un esempio.
ja: metadata: *Optional* です。メタデータは、カスタムの field:value ストリングのペアの形式で、オプションで追加できます。以下のコード・サンプルで例を示します。
ko: metadata: *Optional*. 메타데이터는 사용자 정의 필드:값 문자열 쌍의 양식으로 선택적으로 추가될 수 있습니다. 예제가 아래 코드 샘플에 제공됩니다.

source: location: *Optional*. This parameter contains the longitude, latitude, elevation, accuracy, and mesauredDateTime variables.
de: location: *Optional*. Dieser Parameter enthält die Variablen für Längengrad, Breitengrad, Höhe, Genauigkeit und Datum/Uhrzeit der Messung.
es: location: *Optional*. Este parámetro contiene las variables longitude, latitude, elevation, accuracy y mesauredDateTime.
fr: location : *Facultatif*. Ce paramètre inclut les variables longitude, latitude, elevation, accuracy et measuredTimeStamp.
it: location: *Facoltativo*. Questo parametro contiene le variabili longitudine, latitudine, altitudine, precisione e data e ora misurate.
ja: location: *Optional* です。このパラメーターには、経度、緯度、高度、正確度、および mesauredDateTime の変数が含まれます。
ko: location: *Optional*. 이 매개변수는 경도, 위도, 고도, 정확성 및 mesauredDateTime 변수를 포함합니다.

source: For more information on the parameters presented here, and the response format and codes, please see the relevant section of `API documentation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Devices/post_device_types_typeId_devices>`__.
de: Weitere Informationen zu den hier dargestellten Parametern sowie zum Antwortformat und den Antwortcodes finden Sie im relevanten Abschnitt in der `API-Dokumentation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Devices/post_device_types_typeId_devices>`__.
es: Para obtener más información sobre los parámetros presentados, y los códigos y el formato de respuesta, visite la sección correspondiente de la `Documentación de la API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Devices/post_device_types_typeId_devices>`__.
fr: Pour plus d'informations sur les paramètres présentés ici et le format et les codes de réponse, reportez-vous à la section appropriée dans la `documentation de l'API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Devices/post_device_types_typeId_devices>`__.
it: Per ulteriori informazioni sui parametri presentati in questa sezione e sul formato della risposta e i codici, consultare la relativa sezione della `documentazione API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Devices/post_device_types_typeId_devices>`__.
ja: ここに示すパラメーター、および応答フォーマットとコードの詳細情報は、API の資料<https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Devices/post_device_types_typeId_devices>__を参照してください。
ko: 여기에 표시된 매개변수 및 응답 형식과 코드에 대한 자세한 정보는 `API 문서 <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Devices/post_device_types_typeId_devices>`__의 관련 섹션을 참조하십시오.

source: When using the *registerDevice()* method, you must define the mandatory deviceID parameter, and any of the optional parameters you require for your device, then call the method using the parameters you've selected.
de: Bei der Verwendung der Methode *registerDevice()* müssen Sie den obligatorischen Parameter 'deviceID' sowie alle optionalen Parameter, die für das jeweilige Gerät erforderlich sind, definieren und anschließend die Methode mit den ausgewählten Parametern aufrufen.
es: Cuando se utiliza el método *registerDevice()*, debe definir el parámetro deviceID obligatorio y los parámetros opcionales que requiera para su dispositivo y, a continuación, invocar el método utilizando los parámetros que ha seleccionado.
fr: Lorsque vous utilisez la méthode *registerDevice()*, vous devez définir le paramètre obligatoire deviceID et tous les paramètres facultatifs dont votre terminal a besoin, puis appeler la méthode à l'aide des paramètres sélectionnés.
it: Quando si utilizza il metodo *registerDevice()*, è necessario definire il parametro deviceID obbligatorio ed eventuali parametri facoltativi necessari per il dispositivo, quindi richiamare il metodo utilizzando i parametri selezionati.
ja: *registerDevice()* メソッドを使用する場合、必須の deviceID パラメーター、およびデバイスに要求するオプションのパラメーターを定義してから、選択したパラメーターを使用してメソッドを呼び出す必要があります。
ko: *registerDevice()* 메소드 사용 시 필수 deviceID 매개변수 및 디바이스에 대해 필요한 임의의 선택적 매개변수를 정의한 다음 선택한 매개변수를 사용하는 메소드를 호출해야 합니다.

source: The following code sample should be inserted after the constructor code in a .py file. This code demonstrates defining the deviceId, authToken, metadata, deviceInfo parameters, and location parameters and then using the method with those parameters and adding a device type.
de: Das folgende Codebeispiel muss in einer .py-Datei nach dem Konstruktorcode eingefügt werden. Dieser Code veranschaulicht die Definition der Parameter für die Geräte-ID, das Authentifizierungstoken, die Metadaten, die Geräteinformationen und den Standort sowie die anschließende Verwendung der Methode mit diesen Parametern und das Hinzufügen eines Gerätetyps.
es: El siguiente ejemplo de código debe insertarse después del código de constructor en un archivo .py. Este código demuestra la definición de los parámetros deviceId, authToken, metadata y deviceInfo, y de los parámetros de ubicación, así como el uso del método con esos parámetros y la adición de un tipo de dispositivo.
fr: L'exemple de code suivant doit être inséré après le code du constructeur dans un fichier .py. Il décrit la définition des paramètres deviceId, authToken, metadata, deviceInfo et location, puis explique l'utilisation de la méthode avec ces paramètres et l'ajout d'un type de terminal.
it: Il seguente codice di esempio deve essere inserito dopo il codice del costruttore in un file .py. Questo codice dimostra la definizione dei parametri deviceId, authToken, metadata e deviceInfo e dei parametri dell'ubicazione, quindi l'utilizzo del metodo con tali parametri e l'aggiunta di un tipo di dispositivo.
ja: 次のコード・サンプルは、.py ファイルのコンストラクター・コードの後に挿入する必要があります。このコードは、deviceId、authToken、メタデータ、deviceInfo のパラメーター、およびロケーションのパラメーターの定義について示してから、これらのパラメーターと共にメソッドを使用して、デバイス・タイプを追加する方法を示します。
ko: 다음 코드 샘플은 .py 파일에서 생성자 코드 다음에 삽입되어야 합니다. 이 코드는 deviceId, authToken,메타데이터, deviceInfo 매개변수 및 위치 매개변수 정의를 보여준 다음 해당 매개변수가 포함된 메소드 사용 및 디바이스 유형 추가를 보여줍니다.

source: Delete a Device
de: Gerät löschen
es: Suprimir un dispositivo
fr: Suppression d'un terminal
it: Eliminare un dispositivo
ja: デバイスの削除
ko: 디바이스 삭제

source: The *deleteDevice()* method is used to remove a device from an Internet of Things Foundation organization. When deleting a device using this method, the parameters which must be specified in the method are the deviceTypeId, and the deviceId.
de: Die Methode *deleteDevice()* wird dazu verwendet, ein Gerät von einer Internet of Things Foundation-Organisation zu entfernen. Beim Löschen eines Geräts mithilfe dieser Methode müssen in der Methode die Parameter 'deviceTypeId' und 'deviceId' angegeben werden.
es: El método *deleteDevice()* se utiliza para suprimir un dispositivo de una organización de Internet of Things Foundation. Cuando se suprime un dispositivo con este método, los parámetros que deben especificarse en el método son deviceTypeId y deviceId.
fr: La méthode *deleteDevice()* permet de supprimer un terminal d'une organisation Internet of Things Foundation. Lorsque vous supprimez un terminal à l'aide de cette méthode, les paramètres à indiquer dans la méthode sont les paramètres deviceTypeId et deviceId.
it: Il metodo *deleteDevice()* viene utilizzato per rimuovere un dispositivo da un'organizzazione Internet of Things Foundation. Quando si elimina un dispositivo utilizzando questo metodo, i parametri che è necessario specificare nel metodo sono deviceTypeId e deviceId.
ja: *deleteDevice()* メソッドを使用すると、Internet of Things Foundation 組織からデバイスが削除されます。このメソッドを使用してデバイスを削除する場合、メソッドに指定する必要があるパラメーターは、deviceTypeId と deviceId です。
ko: *deleteDevice()* 메소드는 Internet of Things Foundation 조직에서 디바이스를 제거하는 데 사용됩니다. 이 메소드를 통해 디바이스를 삭제하는 경우 메소드에 지정되어야 하는 매개변수는 deviceTypeId 및 deviceId입니다.

source: The following code snippet provides an example of the format required for this method.
de: Das folgende Code-Snippet ist ein Beispiel des für diese Methode erforderlichen Formats.
es: El siguiente fragmento de código proporciona un ejemplo del formato necesario para este método.
fr: Le fragment de code suivant fournit un exemple présentant le format requis pour cette méthode.
it: Il seguente frammento di codice fornisce un esempio del formato richiesto per questo metodo.
ja: 次のコード・スニペットは、このメソッドに必要な形式の例を示します。
ko: 다음 코드 스니펫은 이 메소드에 필요한 형식의 예제를 제공합니다.

source: Get a Device
de: Gerät abrufen
es: Obtener un dispositivo
fr: Extraction d'un terminal
it: Richiamare un dispositivo
ja: デバイスの取得
ko: 디바이스 가져오기

source: The *getDevice()* method can be used to retrieve a device from an Internet of Things Foundation organization. When retrieving device details using this method, the parameters which must be specified in the method are the deviceTypeId, and the deviceId.
de: Die Methode *getDevice()* kann dazu verwendet werden, ein Gerät von einer Internet of Things Foundation-Organisation abzurufen. Beim Abrufen von Gerätedetails mithilfe dieser Methode müssen in der Methode die Parameter 'deviceTypeId' und 'deviceId' angegeben werden.
es: Puede utilizarse el método *getDevice()* para recuperar un dispositivo de una organización de Internet of Things Foundation. Cuando se recuperan detalles de dispositivo con este método, los parámetros que deben especificarse en el método son deviceTypeId y deviceId.
fr: La méthode *getDevice()* permet d'extraire un terminal d'une organisation Internet of Things Foundation. Lorsque vous extrayez les détails d'un terminal à l'aide de cette méthode, les paramètres à indiquer dans la méthode sont les paramètres deviceTypeId et deviceId.
it: Il metodo *getDevice()* può essere utilizzato per richiamare un dispositivo da un'organizzazione Internet of Things Foundation. Quando si richiamano i dettagli di un dispositivo utilizzando questo metodo, i parametri che è necessario specificare nel metodo sono deviceTypeId e deviceId.
ja: *getDevice()* メソッドを使用すると、Internet of Things Foundation 組織からデバイスを取得できます。このメソッドを使用してデバイス詳細情報を取得する場合、メソッドに指定する必要があるパラメーターは、deviceTypeId と deviceId です。
ko: *getDevice()* 메소드는 Internet of Things Foundation 조직에서 디바이스를 검색하는 데 사용할 수 있습니다. 이 메소드를 통해 디바이스 세부사항을 검색하는 경우 메소드에 지정되어야 하는 매개변수는 deviceTypeId 및 deviceId입니다.

source: Get all Devices
de: Alle Geräte abrufen
es: Obtener todos los dispositivos
fr: Extraction de tous les terminaux
it: Richiamare tutti i dispositivi
ja: すべてのデバイスの取得
ko: 모든 디바이스 가져오기

source: The *getAllDevices()* method can be used to retrieve all devices within an Internet of Things Foundation organization.
de: Die Methode *getAllDevices()* kann dazu verwendet werden, alle Geräte in einer Internet of Things Foundation-Organisation abzurufen.
es: Puede utilizarse el método *getAllDevices()* para recuperar todos los dispositivos en una organización de Internet of Things Foundation.
fr: La méthode *getAllDevices()* permet d'extraire tous les terminaux d'une organisation Internet of Things Foundation.
it: Il metodo *getAllDevices()* può essere utilizzato per richiamare tutti i dispositivi in un'organizzazione Internet of Things Foundation.
ja: *getAllDevices()* メソッドを使用すると、Internet of Things Foundation 組織内のすべてのデバイスを取得できます。
ko: *getAllDevices()* 메소드는 Internet of Things Foundation 조직 내에서 모든 디바이스를 검색하는 데 사용할 수 있습니다.

source: Update a Device
de: Gerät aktualisieren
es: Actualizar un dispositivo
fr: Mise à jour d'un terminal
it: Aggiornare un dispositivo
ja: デバイスの更新
ko: 디바이스 업데이트
