Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python_cli_for_api.po
Languages: de, es, fr, it, ja, ko

source: The *updateDevice()* method is used to modify one or more properties of a device. Any property in the deviceInfo or metadata parameters can be updated. In order to update a device property, it must be defined above the method. The status parameter should contain "alert": True. The Alert property controls whether a device will display error codes in the Internet of Things Foundation user interface, and should be set by default to 'True'.
de: Die Methode *updateDevice()* wird dazu verwendet, eine oder mehrere Eigenschaften eines Geräts zu modifizieren. Jede beliebige Eigenschaft des Parameters 'deviceInfo' bzw. 'metadata' kann aktualisiert werden. Zum Aktualisieren einer Geräteeigenschaft muss dieser oberhalb der Methode definiert sein. Der Statusparameter muss die Angabe "alert": True enthalten. Die Alerteigenschaft steuert, ob für ein Gerät Fehlercodes in der Internet of Things Foundation-Benutzerschnittstelle angezeigt werden; für diese Eigenschaft muss standardmäßig 'True' festgelegt werden.
es: El método *updateDevice()* se utiliza para modificar una o varias propiedades de un dispositivo. Cualquier propiedad en los parámetros deviceInfo o metadata puede actualizarse. Para poder actualizar una propiedad de dispositivo, debe definirse encima del método. El parámetro de estado debe contener "alert": True. La propiedad Alert controla si un dispositivo mostrará códigos de error en la interfaz de usuario de Internet of Things Foundation, y si debe establecerse de forma predeterminada en 'True'.
fr: La méthode *updateDevice()* permet de modifier une ou plusieurs propriétés d'un terminal. N'importe quelle propriété des paramètres deviceInfo ou metadata peut être mise à jour. Pour mettre à jour une propriété d'un terminal, vous devez la définir au-dessus de la méthode. Le paramètre status doit inclure "alert": True. La propriété Alert détermine si un terminal doit afficher des codes d'erreur dans l'interface utilisateur d'Internet of Things Foundation et doit correspondre par défaut à 'True'.
it: Il metodo *updateDevice()* viene utilizzato per modificare una o più proprietà di un dispositivo. È possibile aggiornare qualsiasi proprietà nei parametri deviceInfo o metadata. Per aggiornare una proprietà del dispositivo, è necessario che la proprietà sia definita sopra il metodo. Il parametro dello stato deve contenere "alert": True. La proprietà Alert determina se un dispositivo mostra i codici di errore nell'interfaccia utente di Internet of Things Foundation e deve essere impostata su 'True' per impostazione predefinita.
ja: *updateDevice()* メソッドを使用すると、デバイスの 1 つ以上のプロパティーが変更されます。deviceInfo またはメタデータのパラメーターのプロパティーを更新できます。デバイスのプロパティーを更新するには、上記のメソッドで定義する必要があります。ステータス・パラメーターに "alert": True を含める必要があります。Alert プロパティーは、デバイスが Internet of Things Foundation のユーザー・インターフェースのエラー・コードを表示するかどうかを制御し、デフォルトの 'True' に設定する必要があります。
ko: *updateDevice()* 메소드는 디바이스의 하나 이상의 특성을 수정하는 데 사용됩니다. deviceInfo 또는 메타데이터 매개변수의 특성을 업데이트할 수 있습니다. 디바이스 특성을 업데이트하려면 메소드 위에 정의되어야 합니다. 상태 매개변수는 "경보": True를 포함해야 합니다. 경보 특성은 디바이스가 Internet of Things Foundation 사용자 인터페이스에서 오류 코드를 표시하는지 여부를 제어하고 기본적으로 'True'로 설정되어야 합니다.

source: In this sample, the following code identifies a specific device, and updates several properties under the deviceInfo parameter.
de: In diesem Beispiel wird durch den folgenden Code ein bestimmtes Gerät identifiziert und eine Reihe von Eigenschaften unter dem Parameter 'deviceInfo' aktualisiert.
es: En este ejemplo, el siguiente código identifica un dispositivo específico y actualiza varias propiedades en el parámetro deviceInfo.
fr: Dans cet exemple, le code suivant identifie un terminal spécifique et met à jour plusieurs propriétés sous le paramètre deviceInfo.
it: In questo esempio, il codice mostrato di seguito identifica uno specifico dispositivo e aggiorna diverse proprietà nel parametro deviceInfo.
ja: このサンプルでは、次のコードが特定のデバイスを識別し、deviceInfo パラメーターのいくつかのプロパティーを更新します。
ko: 이 샘플에서 다음 코드가 특정 디바이스를 식별하고 deviceInfo 매개변수에서 몇몇 특성을 업데이트합니다.

source: Get Location Information
de: Positionsinformationen abrufen
es: Obtener información de ubicación
fr: Extraction des informations d'emplacement
it: Richiamare le informazioni sull'ubicazione
ja: ロケーション情報の取得
ko: 위치 정보 가져오기

source: The *getDeviceLocation()* method can be used to retrieve the location information of a device. The parameters required for retrieving the location data are deviceTypeId and deviceId.
de: Die Methode *getDeviceLocation()* kann dazu verwendet werden, die Standortinformationen eines Geräts abzurufen. Zum Abrufen von Standortdaten sind die Parameter 'deviceTypeId' und 'deviceId' erforderlich.
es: Puede utilizarse el método *getDeviceLocation()* para recuperar la información de ubicación de un dispositivo. Los parámetros necesarios para recuperar los datos de ubicación son deviceTypeId y deviceId.
fr: La méthode *getDeviceLocation()* permet d'extraire les informations d'emplacement d'un terminal. Les paramètres nécessaires pour extraire les données d'emplacement sont deviceTypeId et deviceId.
it: Il metodo *getDeviceLocation()* può essere utilizzato per richiamare le informazioni sull'ubicazione di un dispositivo. I parametri richiesti per richiamare i dati sull'ubicazione sono deviceTypeId e deviceId.
ja: *getDeviceLocation()* メソッドを使用すると、デバイスのロケーション情報を取得できます。ロケーション・データの取得に必要なパラメーターは、deviceTypeId と deviceId です。
ko: *getDeviceLocation()* 메소드는 디바이스의 위치 정보를 검색하는 데 사용할 수 있습니다. 위치 데이터를 검색하는 데 필요한 매개변수는 deviceTypeId 및 deviceId입니다.

source: The response to this method contains the longitude, latitude, elevation, accuracy, measuredTimeStamp, and updatedTimeStamp properties.
de: Die Antwort auf diese Methode enthält die Eigenschaften für Längengrad, Breitengrad, Höhe, Genauigkeit, Datum/Uhrzeit der Messung und Datum/Uhrzeit der Aktualisierung.
es: La respuesta a este método contiene las propiedades longitude, latitude, elevation, accuracy, measuredTimeStamp y updatedTimeStamp.
fr: La réponse à cette méthode inclut les propriétés longitude, latitude, elevation, accuracy, measuredTimeStamp et updatedTimeStamp.
it: La risposta a questo metodo contiene le proprietà longitudine, latitudine, altitudine, precisione, data e ora misurate e data e ora aggiornate.
ja: このメソッドの応答には、経度、緯度、高度、正確度、measuredTimeStamp、および updatedTimeStamp のプロパティーが含まれます。
ko: 이 메소드에 대한 응답은 경도, 위도, 고도, 정확성, measuredTimeStamp 및 updatedTimeStamp 특성을 포함합니다.

source: Update Location Information
de: Positionsinformationen aktualisieren
es: Actualizar información de ubicación
fr: Mise à jour des informations d'emplacement
it: Aggiornare le informazioni sull'ubicazione
ja: ロケーション情報の更新
ko: 위치 정보 업데이트

source: The *updateDeviceLocation()* method is used to modify the location information for a device. Simlarly to updating device properties, the deviceLocation parameter must be defined with the changes you wish to apply. The code sample below demonstrates changing the location data for a given device.
de: Die Methode *updateDeviceLocation()* wird dazu verwendet, die Standortinformationen für ein Gerät zu modifizieren. Ähnlich wie bei der Aktualisierung von Geräteeigenschaften muss für die anzuwendenden Änderungen der Parameter 'deviceLocation' angegeben werden. Das nachfolgende Codebeispiel veranschaulicht die Änderung von Standortdaten für ein bestimmtes Gerät.
es: El método *updateDeviceLocation()* se utiliza para modificar la información de ubicación de un dispositivo. De forma parecida a la actualización de las propiedades de dispositivo, el parámetro deviceLocation debe definirse con los cambios que desee aplicar. El siguiente ejemplo de código demuestra el cambio de los datos de ubicación de un determinado dispositivo.
fr: La méthode *updateDeviceLocation()* permet de modifier les informations d'emplacement d'un terminal. Comme pour la mise à jour des propriétés d'un terminal, le paramètre deviceLocation doit être défini avec les modifications que vous souhaitez appliquer. L'exemple de code ci-dessous décrit la modification des données d'emplacement d'un terminal donné.
it: Il metodo *updateDeviceLocation()* viene utilizzato per modificare le informazioni sull'ubicazione per un dispositivo. In modo simile all'aggiornamento delle proprietà di un dispositivo, è necessario definire il parametro deviceLocation con le modifiche che si desidera applicare. L'esempio di codice riportato di seguito dimostra la modifica dell'ubicazione per un determinato dispositivo.
ja: *updateDeviceLocation()* メソッドを使用すると、デバイスのロケーション情報が変更されます。デバイスのプロパティーの更新と同様に、適用しようとしている変更で deviceLocation パラメーターを定義する必要があります。以下のコード・サンプルは、指定されたデバイスのロケーション・データの変更について示します。
ko: *updateDeviceLocation()* 메소드는 디바이스의 위치 정보를 수정하는 데 사용됩니다. 디바이스 특성 업데이트와 유사하게 deviceLocation 매개변수는 적용하려는 변경사항과 함께 정의되어야 합니다. 아래의 코드 샘플이 제공된 디바이스에 대해 위치 데이터 변경을 보여줍니다.

source: If no date is supplied, the entry is added with the current date and time.
de: Wird kein Datum angegeben, wird der Eintrag mit dem aktuellen Datum und der aktuellen Uhrzeit hinzugefügt.
es: Si no se suministra ninguna fecha, la entrada se añade con la fecha y hora actual.
fr: Si aucune date n'est indiquée, l'entrée est ajoutée avec la date et l'heure en cours.
it: Se non viene fornita alcuna data, la voce viene aggiunta con la data e l'ora correnti.
ja: 日付が指定されない場合、現在の日付と時刻を使用してエントリーが追加されます。
ko: 날짜가 제공되지 않는 경우 현재 날짜 및 시간이 포함된 항목이 추가됩니다.

source: Get Device Management Information
de: Gerätemanagementinformationen abrufen
es: Obtener información de gestión de dispositivos
fr: Extraction des informations de gestion d'un terminal
it: Richiamare le informazioni di gestione del dispositivo
ja: デバイス管理情報の取得
ko: 디바이스 관리 정보 가져오기

source: The *getDeviceManagementInformation()* method is used to get the device management information for a device. The response contains the last activity date-time, the device's dormant status (true/false), support for device and firmware actions, and firmware data. For a comprehensive list of response content, please see the relevant API documentation.
de: Die Methode *getDeviceManagementInformation()* wird dazu verwendet, die Gerätemanagementinformationen für ein Gerät abzurufen. Die Antwort enthält Datum und Uhrzeit der letzten Aktivität, den Ruhestatus des Geräts (true/false), Unterstützung für Geräte- und Firmwareaktionen sowie Firmwaredaten. Eine umfassende Liste der Antwortinhalte finden Sie in der relevanten API-Dokumentation.
es: El método *getDeviceManagementInformation()* se utiliza para obtener la información de gestión de dispositivos para un dispositivo. La respuesta contiene la fecha y la hora de la última actividad, el estado inactivo del dispositivo (true/false), soporte para las acciones del firmware y el dispositivo, y datos de firmware. Para ver una lista completa del contenido de la respuesta, consulte la documentación de la API correspondiente.
fr: La méthode *getDeviceManagementInformation()* permet d'obtenir les informations de gestion d'un terminal. La réponse inclut la date/heure de la dernière activité, le statut de veille du terminal (true/false), la prise en charge des actions sur le terminal et le microprogramme et les données du microprogramme. Pour obtenir une liste exhaustive du contenu de la réponse, reportez-vous à la documentation de l'API appropriée.
it: Il metodo *getDeviceManagementInformation()* viene utilizzato per richiamare le informazioni di gestione per un dispositivo. La risposta contiene la data e l'ora dell'ultima attività, lo stato inattivo del dispositivo (true/false), il supporto per il dispositivo e le azioni firmware e i dati del firmware. Per un elenco completo del contenuto della risposta, consultare la relativa documentazione sull'API.
ja: *getDeviceManagementInformation()* メソッドを使用すると、デバイスのデバイス管理情報が取得されます。応答には、最後のアクティビティーの日付/時刻、デバイスの休止状況 (true/false)、デバイスとファームウェアのアクションのサポート、およびファームウェアのデータが含まれます。応答コンテンツの総合的なリストは、関連する API 資料を参照してください。
ko: *getDeviceManagementInformation()* 메소드는 디바이스의 디바이스 관리 정보를 가져오는 데 사용됩니다. 응답에는 마지막 활동 날짜-시간, 디바이스의 유휴 상태(true/false), 디바이스 및 펌웨어 조치에 대한 지원 및 펌웨어 데이터가 포함됩니다. 응답 컨텐츠의 전체 목록은 관련 API 문서를 참조하십시오.

source: The following code sample will return the device management information for a device with the deviceId "00aabbccde03", with deviceTypeId "iotsample-arduino".
de: Mit dem folgenden Codebeispiel werden die Gerätemanagementinformationen für ein Gerät mit der Geräte-ID "00aabbccde03" und der Gerätetyp-ID "iotsample-arduino" zurückgegeben.
es: El siguiente ejemplo de código devolverá información de gestión de dispositivos para un dispositivo con deviceId "00aabbccde03" y deviceTypeId "iotsample-arduino".
fr: L'exemple de code suivant renvoie les informations de gestion d'un terminal dont le paramètre deviceId correspond à "00aabbccde03" et le paramètre deviceTypeId correspond à "iotsample-arduino".
it: Il seguente esempio di codice restituirà le informazioni di gestione del dispositivo per un dispositivo con deviceId "00aabbccde03", con deviceTypeId "iotsample-arduino".
ja: 次のコード・サンプルは、deviceId "00aabbccde03"、deviceTypeId "iotsample-arduino" が指定されたデバイスのデバイス管理情報を返します。
ko: 다음 코드 샘플이 deviceId "00aabbccde03" 및 deviceTypeId "iotsample-arduino"와 함께 디바이스에 대해 디바이스 관리 정보를 리턴합니다.

source: Device diagnostic operations
de: Gerätediagnoseoperationen
es: Operaciones de diagnóstico de dispositivo
fr: Opérations de diagnostic d'un terminal
it: Operazioni di diagnostica del dispositivo
ja: デバイスの診断操作
ko: 디바이스 진단 오퍼레이션

source: Applications can use device diagnostic operations to clear logs, retrieve all or specific logs for a device, add log information, delete logs, clear error codes, get device error codes, and add an error codes.
de: Anwendungen können Gerätediagnoseoperationen verwenden, um Protokolle zu löschen, alle oder bestimmte Protokolle für ein Gerät abzurufen, Protokollinformationen hinzuzufügen, Protokolle zu löschen, Fehlercodes zu löschen, Gerätefehlercodes abzurufen und Fehlercodes hinzuzufügen.
es: Las aplicaciones pueden utilizar las operaciones de diagnóstico de dispositivos para borrar registros, recuperar todos los registros o registros específicos para un dispositivo, añadir información de registro, suprimir registros, borrar códigos de error, obtener códigos de error de dispositivo y añadir un código de error.
fr: Les applications peuvent utiliser les opérations de diagnostic d'un terminal pour effacer des journaux, extraire une partie ou l'ensemble des journaux d'un terminal, ajouter des informations de journal, supprimer des journaux, effacer des codes d'erreur, obtenir des codes d'erreur d'un terminal et ajouter des codes d'erreur.
it: Le applicazioni possono utilizzare le operazioni di diagnostica del dispositivo per cancellare i log, richiamare tutti o alcuni log specifici per un dispositivo, aggiungere informazioni relative ai log, eliminare i log, cancellare i codici di errore, richiamare i codici di errore del dispositivo e aggiungere codici di errore.
ja: アプリケーションはデバイスの診断操作を使用して、ログ消去、デバイスのすべてまたは特定のログの取得、ログ情報の追加、ログの削除、エラー・コードのクリア、デバイスのエラー・コードの取得、およびエラー・コードの追加を実行できます。
ko: 애플리케이션은 디바이스 진단 오퍼레이션을 사용하여 로그를 지우고 디바이스에 대해 모든 또는 특정 로그를 검색하며 로그 정보를 추가하고 로그를 삭제하며 오류 코드를 지우고 디바이스 오류 코드를 가져오고 오류 코드를 추가할 수 있습니다.

source: For more detailed information on query and response models, response codes, and query paramters, please see the relevant API documentation.
de: Detailliertere Informationen zu Abfrage- und Antwortmodellen, Antwortcodes und Abfrageparametern finden Sie in der entsprechenden API-Dokumentation.
es: Para obtener información detallada sobre los modelos de consulta y respuesta, los códigos de respuesta y los parámetros de consulta, consulte la documentación de la API correspondiente.
fr: Pour plus d'informations sur les modèles de requête et de réponse, les codes de réponse et les paramètres de requête, reportez-vous à la documentation de l'API appropriée.
it: Per informazioni più dettagliate sulle query e sui modelli di risposta, sui codici di risposta e i parametri delle query, consultare la relativa documentazione sull'API.
ja: 照会と応答モデル、応答コード、および照会パラメーターの詳細情報は、関連する API 資料を参照してください。
ko: 조회 및 응답 모델, 응답 코드, 조회 매개변수에 대한 자세한 정보는 관련 API 문서를 참조하십시오.

source: Get Diagnostic logs
de: Diagnoseprotokolle abrufen
es: Obtener registros de diagnóstico
fr: Extraction des journaux de diagnostic
it: Richiamare i log di diagnostica
ja: 診断ログの取得
ko: 진단 로그 가져오기

source: The *getAllDiagnosticLogs()* method is used to retrieve all diagnostic logs for a specific device. The *getAllDiagnosticLogs()* method requires the deviceTypeId and deviceId parameters.
de: Die Methode *getAllDiagnosticLogs()* wird dazu verwendet, alle Diagnoseprotokolle für ein bestimmtes Gerät abzurufen. Die Methode *getAllDiagnosticLogs()* benötigt die Parameter 'deviceTypeId' und 'deviceId'.
es: El método *getAllDiagnosticLogs()* se utiliza para recuperar todos los registros de diagnóstico de un dispositivo específico. El método *getAllDiagnosticLogs()* requiere los parámetros deviceTypeId y deviceId.
fr: La méthode *getAllDiagnosticLogs()* permet d'extraire tous les journaux de diagnostic d'un terminal spécifique. Elle requiert l'utilisation des paramètres deviceTypeId et deviceId.
it: Il metodo *getAllDiagnosticLogs()* viene utilizzato per richiamare tutti i log di diagnostica per un dispositivo specifico. Il metodo *getAllDiagnosticLogs()* richiede i parametri deviceTypeId e deviceId.
ja: *getAllDiagnosticLogs()* メソッドを使用すると、特定のデバイスのすべての診断ログが取得されます。*getAllDiagnosticLogs()* メソッドは、deviceTypeId パラメーターと deviceId パラメーターを必要とします。
ko: *getAllDiagnosticLogs()* 메소드는 특정 디바이스에 대해 모든 진단 로그를 검색하는 데 사용됩니다. *getAllDiagnosticLogs()* 메소드는 deviceTypeId 및 deviceId 매개변수를 요구합니다.

source: The response model for this method contains the logId, message, severity, data, and timestamp.
de: Das Antwortmodell für diese Methode enthält Variablen 'logID', 'message', 'severity', 'data' und 'timestamp'.
es: El modelo de respuesta de este método contiene los parámetros logId, message, severity, data y timestamp.
fr: Le modèle de réponse de cette méthode inclut les paramètres logId, message, severity, data et timestamp.
it: Il modello di risposta per questo metodo contiene ID del log, messaggio, severità, dati e data/ora.
ja: このメソッドの応答モデルには、logId、メッセージ、重大度、データおよびタイム・スタンプが含まれます。
ko: 이 메소드의 응답 모델에는 logId, 메시지, 심각도, 데이터 및 시간소인이 포함됩니다.

source: Clear Diagnostic logs for a Device
de: Diagnoseprotokolle für ein Gerät löschen
es: Borrar registros de diagnóstico para un dispositivo
fr: Effacement des journaux de diagnostic d'un terminal
it: Cancellare i log di diagnostica per un dispositivo
ja: デバイスの診断ログのクリア
ko: 디바이스의 진단 로그 지우기

source: The *clearAllDiagnosticLogs()* method is used to delete all diagnostic logs for a specific device. The required parameters are deviceTypeId and deviceId. Care should be taken when deleting logs, as logs cannot be recovered once deleted.
de: Die Methode *clearAllDiagnosticLogs()* wird dazu verwendet, alle Diagnoseprotokolle für ein bestimmtes Gerät zu löschen. Die Parameter 'deviceTypeId' und 'deviceId' sind erforderlich. Beim Löschen von Protokollen muss vorsichtig vorgegangen werden, da gelöschte Protokolle nicht wiederhergestellt werden können.
es: El método *clearAllDiagnosticLogs()* se utiliza para suprimir todos los registros de diagnóstico de un dispositivo específico. Los parámetros necesarios son deviceTypeId y deviceId. Tenga cuidado cuando suprima registros, ya que no pueden recuperarse una vez suprimidos.
fr: La méthode *clearAllDiagnosticLogs()* permet de supprimer tous les journaux de diagnostic d'un terminal spécifique. Les paramètres obligatoires sont deviceTypeId et deviceId. Supprimez les journaux avec précaution car les journaux supprimés ne peuvent pas être récupérés.
it: Il metodo *clearAllDiagnosticLogs()* viene utilizzato per cancellare tutti i log di diagnostica per un dispositivo specifico. I parametri richiesti sono deviceTypeId e deviceId. È necessario prestare attenzione quando si eliminano i log, in quanto una volta eliminati, i log non possono essere recuperati.
ja: *clearAllDiagnosticLogs()* メソッドを使用すると、特定のデバイスのすべての診断ログが削除されます。必須パラメーターは、deviceTypeId と deviceId です。ログは削除すると復旧できないので、ログの削除の際は注意してください。
ko: *clearAllDiagnosticLogs()* 메소드는 특정 디바이스에 대해 모든 진단 로그를 삭제하는 데 사용됩니다. 필수 매개변수는 deviceTypeId 및 deviceId입니다. 로그는 한 번 삭제되면 복구할 수 없으므로 로그 삭제 시 주의해야 합니다.

source: Add a Diagnostic log
de: Diagnoseprotokoll hinzufügen
es: Añadir un registro de diagnóstico
fr: Ajout d'un journal de diagnostic
it: Aggiungere un log di diagnostica
ja: 診断ログの追加
ko: 진단 로그 추가

source: The *addDiagnosticLog()* method is used to add an entry in the diagnostic log of the device. The log may be pruned as the new entry is added. If no date is supplied, the entry is added with the current date and time. To use this method, first define a 'logs' parameter with the following variables:
de: Die Methode *addDiagnosticLog()* wird dazu verwendet, einen Eintrag im Diagnoseprotokoll des Geräts hinzuzufügen. Das Protokoll kann beim Hinzufügen des neuen Eintrags bereinigt werden. Wird kein Datum angegeben, wird der Eintrag mit dem aktuellen Datum und der aktuellen Uhrzeit hinzugefügt. Zur Verwendung dieser Methode definieren Sie zuerst den Parameter 'logs' mit den folgenden Variablen:
es: El método *addDiagnosticLog()* se utiliza para añadir una entrada en el registro de diagnóstico del dispositivo. El registro puede borrarse cuando se añade la nueva entrada. Si no se suministra ninguna fecha, la entrada se añade con la fecha y hora actual. Para utilizar este método, defina primero un parámetro 'logs' con las siguientes variables:
fr: La méthode *addDiagnosticLog()* permet d'ajouter une entrée dans le journal de diagnostic d'un terminal. Des entrées du journal peuvent être supprimées au fur et à mesure que de nouvelles entrées sont ajoutées. Si aucune date n'est indiquée, l'entrée est ajoutée avec la date et l'heure en cours. Pour utiliser cette méthode, définissez d'abord le paramètre 'logs' avec les variables suivantes :
it: Il metodo *addDiagnosticLog()* viene utilizzato per aggiungere una voce al log di diagnostica del dispositivo. Con l'aggiunta di una nuova voce, il log potrebbe essere ridotto. Se non viene fornita alcuna data, la voce viene aggiunta con la data e l'ora correnti. Per utilizzare questo metodo, definire inizialmente un parametro 'logs' con le seguenti variabili:
ja: *addDiagnosticLog()* メソッドを使用すると、デバイスの診断ログのエントリーが追加されます。新しいエントリーが追加されると、ログが整理されることがあります。日付が指定されない場合、現在の日付と時刻を使用してエントリーが追加されます。このメソッドを使用するには、最初に 'logs' パラメーターに次の変数を指定して定義します。
ko: *addDiagnosticLog()* 메소드는 디바이스의 진단 로그에서 항목을 추가하는 데 사용됩니다. 로그는 새 항목이 추가되면서 프루닝될 수 있습니다. 날짜가 제공되지 않는 경우 현재 날짜 및 시간이 포함된 항목이 추가됩니다. 이 메소드를 사용하려면 먼저 'logs' 매개변수를 다음 변수와 함께 정의하십시오.

source: message: This variable is mandatory, and contains the new diagnostic message.
de: message: Diese Variable ist obligatorisch und enthält die neue Diagnosenachricht.
es: message: esta variable es obligatoria y contiene el nuevo mensaje de diagnóstico.
fr: message : Cette variable est obligatoire et contient le nouveau message de diagnostic.
it: message: Questa variabile è obbligatoria e contiene il nuovo messaggio di diagnostica.
ja: message: この変数は必須で、新しい診断メッセージを含みます。
ko: 메시지: 이 변수는 필수이며 새 진단 메시지를 포함합니다.
