Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: IBM Internet of Things Foundation for Python
es: IBM Internet of Things Foundation para Python
fr: IBM Internet of Things Foundation pour Python
it: IBM Internet of Things Foundation per Python

source: This python module has enables you to interact with the `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ using Python.
de: Dieses Python-Modul ermöglicht die Interaktion mit `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ über Python.
es: Este módulo Python permite interactuar con `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ utilizando Python.
fr: Ce module Python permet d'interagir avec `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ à l'aide de Python.
it: Questo modulo python consente di interagire con `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ utilizzando Python.
ja: この python モジュールでは、Python を使用して `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ と対話できます。
ko: 이 python 모듈은 사용자가 Python을 통해 `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__과 상호작용할 수 있도록 합니다.
pt_br: Este módulo python que permite interagir com o `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ usando o Python.
zh_cn: 此 Python 模块使您能够使用 Python 与 `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ 进行交互。
zh_tw: 此 Python 模組可讓您使用 Python 與 `IBM Internet of Things Foundation<https://internetofthings.ibmcloud.com>`__ 互動。

source: The following versions of Python are compatible with this module:
de: Die folgenden Python-Versionen sind mit diesem Modul kompatibel:
es: Las siguientes versiones de Python son compatibles con este módulo:
fr: Les versions suivantes de Python sont compatibles avec ce module :
it: Le seguenti versioni di Python sono compatibili con questo modulo:
ja: 次のバージョンの Python がこのモジュールと互換性があります。
ko: Python의 다음 버전이 이 모듈과 호환 가능합니다.
pt_br: As versões a seguir do Python são compatíveis com este módulo:
zh_cn: 以下 Python 版本与此模块兼容：
zh_tw: 以下是與此模組相容的 Python 版本：

source: Note: Support for MQTT over SSL requires at least Python v2.7.9 or v3.4, and openssl v1.0.1
de: Hinweis: Unterstützung für MQTT über SSL erfordert mindestens Python v2.7.9 oder v3.4 und openssl v1.0.1
es: Nota: el soporte para MQTT sobre SSL necesita como mínimo Python v2.7.9 o v3.4 y openssl v1.0.1
fr: Remarque : La prise en charge de MQTT sur SSL requiert au moins Python version 2.7.9 ou 3.4 et openssl version 1.0.1
it: Nota: il supporto per MQTT su SSL richiede almeno Python v2.7.9 o v3.4, e openssl v1.0.1
ja: 注: MQTT over SSL をサポートするには、Python v2.7.9 または v3.4 以上、openssl v1.0.1 以上のバージョンが必要です。
ko: 참고: SSL에서 MQTT를 지원하려면 최소한 Python v2.7.9 또는 v3.4 및 openssl v1.0.1이 필요함
pt_br: Nota: Suporte para MQTT over SSL requer pelo menos Python v2.7.9 ou v3.4 e openssl v1.0.1
zh_cn: 注：对 MQTT over SSL 的支持至少需要 Python V2.7.9 或 V3.4 和 openssl V1.0.1
zh_tw: 附註：若要支援透過 SSL 的 MQTT，至少需要 Python 2.7.9 版或 3.4 版，以及 OpenSSL 1.0.1 版

source: For information on how to use the IBM Internet of Things Foundation Python module with devices, applications, and APIs, please refer to the following documentation.
de: Informationen zur Verwendung des Python-Moduls von IBM Internet of Things Foundation mit Geräten, Anwendungen und APIs finden Sie in der folgenden Dokumentation.
es: Para obtener información sobre cómo utilizar el módulo Python de IBM Internet of Things Foundation con dispositivos, aplicaciones y API, consulte la siguiente documentación.
fr: Pour plus d'informations sur l'utilisation du module Python d'IBM Internet of Things Foundation avec des terminaux, des applications et des API, reportez-vous à la documentation suivante :
it: Per informazioni su come utilizzare il modulo Python di IBM Internet of Things Foundation con dispositivi, applicazioni e API, fare riferimento alla seguente documentazione.
ja: IBM Internet of Things Foundation の Python モジュールをデバイス、アプリケーション、API と共に使用する方法の詳細情報は、次の資料を参照してください。
ko: IBM Internet of Things Foundation Python 모듈을 디바이스, 애플리케이션 및 API와 함께 사용하는 방법에 대한 정보는 다음 문서를 참조하십시오.
pt_br: Para obter informações sobre como utilizar o IBM Internet of Things Foundation módulo Python com dispositivos, aplicativos e APIs, consulte a documentação a seguir.
zh_cn: 有关如何将 IBM Internet of Things Foundation Python 模块与设备、应用程序和 API 配合使用的信息，请参阅以下文档。
zh_tw: 如需如何將 IBM Internet of Things Foundation Python 模組與裝置、應用程式和 API 搭配使用的相關資訊，請參閱下列文件。

source: `Device Client <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__
de: `Geräteclient <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__
es: `Cliente de dispositivo<https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__
fr: `Client de terminal <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__
it: `Client dispositivo <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__
ja: `デバイス・クライアント <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__
ko: `디바이스 클라이언트 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__
pt_br: `Cliente do Dispositivo <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__
zh_cn: `设备客户机 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__
zh_tw: `裝置用戶端 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__

source: `Application Client <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
de: `Anwendungsclient <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
es: `Cliente de aplicaciones<https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
fr: `Client d'application <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
it: `Client applicazione <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
ja: `アプリケーション・クライアント <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
ko: `애플리케이션 클라이언트 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
pt_br: `Aplicativo Cliente <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
zh_cn: `应用程序客户机 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
zh_tw: `應用程式用戶端 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__

source: `API Client <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_api.html>`__
es: `Cliente de API <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_api.html>`__
fr: `Client d'API <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_api.html>`__
it: `Client API <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_api.html>`__
ja: `API クライアント <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_api.html>`__
ko: `API 클라이언트 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_api.html>`__
pt_br: `Cliente da API <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_api.html>`__
zh_cn: `API 客户机 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_api.html>`__
zh_tw: `API 用戶端 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_api.html>`__

source: Dependencies
de: Abhängigkeiten
es: Dependencias
fr: Dépendances
it: Dipendenze
ja: 従属関係
ko: 종속 항목
pt_br: Dependências
zh_cn: 依赖关系
zh_tw: 相依關係

source: The following libraries and modules are required in order to use the Internet of Things Foundation Python module.
de: Die folgenden Bibliotheken und Module sind für die Verwendung des Python-Moduls von Internet of Things Foundation erforderlich.
es: Los siguientes módulos y bibliotecas son necesarios para poder utilizar el módulo Python de Internet of Things Foundation.
fr: Les bibliothèques et les modules suivants sont nécessaires pour utiliser le module Python d'Internet of Things Foundation.
it: Per utilizzare il modulo Python di Internet of Things Foundation, sono richiesti i seguenti moduli e librerie.
ja: Internet of Things Foundation の Python モジュールを使用するには、次のライブラリーとモジュールが必要です。
ko: Internet of Things Foundation Python 모듈을 사용하려면 다음 라이브러리 및 모듈이 필요합니다.
pt_br: As bibliotecas e módulos a seguir são necessários para utilizar o módulo Python do Internet of Things Foundation.
zh_cn: 需要以下库和模块才能使用 Internet of Things Foundation Python 模块。
zh_tw: 必須有下列程式庫和模組，才能使用 Internet of Things Foundation Python 模組。

source: The `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ implements the MQTT protocol required for communicating with the Internet of Things Foundation.
de: Mit `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ wird das MQTT-Protokoll implementiert, das für die Kommunikation mit Internet of Things Foundation erforderlich ist.
es: `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ implementa el protocolo MQTT necesario para comunicarse con Internet of Things Foundation.
fr: `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ met en oeuvre le protocole MQTT nécessaire pour communiquer avec Internet of Things Foundation.
it: `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ implementa il protocollo MQTT richiesto per la comunicazione con Internet of Things Foundation.
ja: `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ は、Internet of Things Foundation との通信に必要な MQTT プロトコルを実装します。
ko: `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__에서는 Internet of Things Foundation과 통신하는 데 필요한 MQTT 프로토콜을 구현합니다.
pt_br: O `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ implementa o protocolo MQTT necessários para comunicação com o Internet of Things Foundation.
zh_cn: `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ 可实现与 Internet of Things Foundation 通信所需的 MQTT 协议。
zh_tw: `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ 會實作與 Internet of Things Foundation 通訊所需的 MQTT 通訊協定。

source: `ISO8601 <https://pypi.python.org/pypi/iso8601>`__. This module parses ISO8601 date strings into datetime objects.
de: `ISO8601 <https://pypi.python.org/pypi/iso8601>`__. Mit diesem Modul werden ISO8601-Datumszeichenfolgen in Objekte für Datum/Uhrzeit geparst.
es: `ISO8601 <https://pypi.python.org/pypi/iso8601>`__. Este módulo analiza series de fecha ISO8601 en objetos de fecha y hora.
fr: `ISO8601 <https://pypi.python.org/pypi/iso8601>`__. Ce module analyse les chaînes de date ISO8601 pour obtenir des objets datetime.
it: `ISO8601 <https://pypi.python.org/pypi/iso8601>`__. Questo modulo analizza le stringhe delle date ISO8601 in oggetti datetime.
ja: `ISO8601 <https://pypi.python.org/pypi/iso8601>`__。このモジュールは、ISO8601 日付ストリングを日時オブジェクトに解析します。
ko: `ISO8601 <https://pypi.python.org/pypi/iso8601>`__. 이 모듈은 ISO8601 날짜 문자열을 datetime 오브젝트로 구문 분석합니다.
pt_br: `ISO8601 <https://pypi.python.org/pypi/iso8601>`__. Este módulo analisa cadeias de datas ISO8601 em objetos data/hora.
zh_cn: `ISO8601 <https://pypi.python.org/pypi/iso8601>`__。此模块可将 ISO8601 日期字符串解析为日期时间对象。
zh_tw: `ISO8601 <https://pypi.python.org/pypi/iso8601>`__。此模組會將 ISO8601 日期字串剖析為日期時間物件。

source: The `pytz <https://pypi.python.org/pypi/pytz>`__ library enables accurate timezone calculations.
de: Die Bibliothek `pytz <https://pypi.python.org/pypi/pytz>`__ ermöglicht präzise Berechnungen von Zeitzonen.
es: La biblioteca `pytz <https://pypi.python.org/pypi/pytz>`__ habilita cálculos de huso horario precisos.
fr: La bibliothèque `pytz <https://pypi.python.org/pypi/pytz>`__ permet les calculs de fuseaux horaires.
it: La libreria `pytz <https://pypi.python.org/pypi/pytz>`__ abilita i calcoli accurati sui fusi orari.
ja: `pytz <https://pypi.python.org/pypi/pytz>`__ ライブラリーでは、正確なタイム・ゾーンの計算が可能になります。
ko: `pytz <https://pypi.python.org/pypi/pytz>`__ 라이브러리를 통해 시간대를 정확하게 계산할 수 있습니다.
pt_br: A biblioteca `pytz <https://pypi.python.org/pypi/pytz>`__ permite cálculos de fuso horário precisos.
zh_cn: `pytz <https://pypi.python.org/pypi/pytz>`__ 库支持精准的时区计算。
zh_tw: `pytz <https://pypi.python.org/pypi/pytz>`__ 程式庫可啟用精確的時區計算。

source: The `requests <https://pypi.python.org/pypi/requests>`__ library is a python HTTP library, enabling HTTP communication with the Internet of Things Foundation using python.
de: Bei der Bibliothek `Anforderungen <https://pypi.python.org/pypi/requests>`__ handelt es sich um eine HTTP-Python-Bibliothek, die die HTTP-Kommunikation mit Internet of Things Foundation über Python ermöglicht.
es: La biblioteca de `solicitudes <https://pypi.python.org/pypi/requests>`__ es una biblioteca HTTP de Python, que permite la comunicación HTTP con Internet of Things Foundation utilizando Python.
fr: La bibliothèque `requests <https://pypi.python.org/pypi/requests>`__ est une bibliothèque HTTP Python qui permet les communications HTTP avec Internet of Things Foundation à l'aide de Python.
it: La libreria `requests <https://pypi.python.org/pypi/requests>`__ è una libreria HTTP python che abilita la comunicazione HTTP con Internet of Things Foundation utilizzando python.
ja: `requests <https://pypi.python.org/pypi/requests>`__ ライブラリーは python HTTP ライブラリーであり、python を使用して Internet of Things Foundation との HTTP 通信を有効にします。
ko: `요청 <https://pypi.python.org/pypi/requests>`__ 라이브러리는 python HTTP 라이브러리이며, python을 통해 Internet of Things Foundation과의 HTTP 통신을 가능하게 합니다.
pt_br: A biblioteca de `solicitação <https://pypi.python.org/pypi/requests>`__ é uma biblioteca HTTP python, permitindo a comunicação HTTP com o Internet of Things Foundation usando python.
zh_cn: `requests <https://pypi.python.org/pypi/requests>`__ 库是 Python HTTP 库，支持使用 Python 与 Internet of Things Foundation 进行 HTTP 通信。
zh_tw: `要求<https://pypi.python.org/pypi/requests>`__程式庫是一個 Python HTTP 程式庫，可讓您使用 Python 與 Internet of Things Foundation 進行 HTTP 通訊。

source: Installation
es: Instalación
it: Installazione
ja: インストール
ko: 설치
pt_br: Instalação
zh_cn: 安装
zh_tw: 安裝

source: Install the latest version of the library by using the following code in the command line:
de: Installieren Sie die neueste Version der Bibliothek mithilfe des folgenden Codes über die Befehlszeile:
es: Instale la versión más reciente de la biblioteca utilizando el código siguiente en la línea de mandatos:
fr: Installez la dernière version de la bibliothèque à l'aide du code suivant sur la ligne de commande :
it: Installare la versione più recente della libreria utilizzando il seguente codice nella riga comandi:
ja: コマンド・ラインで次のコードを使用して、最新バージョンのライブラリーをインストールします。
ko: 명령행에서 다음 코드를 사용하여 라이브러리의 최신 버전을 설치하십시오.
pt_br: Instale a versão mais recente da biblioteca utilizando o código a seguir na linha de comandos:
zh_cn: 在命令行中使用以下代码安装最新版本的库：
zh_tw: 在指令行中使用下列程式碼，以安裝最新版的程式庫：

source: Uninstall
de: Deinstallation
es: Desinstalar
fr: Désinstallation
it: Disinstallazione
ja: アンインストール
ko: 설치 제거
pt_br: Desinstalação
zh_cn: 卸载
zh_tw: 解除安裝

source: Uninstall the module by using the following code in the command line:
de: Deinstallieren Sie das Modul mithilfe des folgenden Codes über die Befehlszeile:
es: Desinstale el módulo utilizando el código siguiente en la línea de mandatos:
fr: Désinstallez le module en utilisant le code suivant sur la ligne de commande :
it: Disinstallare il modulo utilizzando il seguente codice nella riga comandi:
ja: コマンド・ラインで次のコードを使用して、モジュールをアンインストールします。
ko: 명령행에서 다음 코드를 사용하여 모듈을 설치 제거하십시오.
pt_br: Desinstale o módulo utilizando o código a seguir na linha de comandos:
zh_cn: 在命令行中使用以下代码卸载此模块：
zh_tw: 在指令行中使用下列程式碼，將模組解除安裝：

source: Migrating from v0.0.x to v0.1.x
de: Migration von v0.0.x auf v0.1.x
es: Migración de v0.0.x a v0.1.x
fr: Migration de la version 0.0.x vers la version 0.1.x
it: Migrazione da v0.0.x a v0.1.x
ja: v0.0.x から v0.1.x へのマイグレーション
ko: v0.0.x에서 v0.1.x로 마이그레이션
pt_br: Migrando da v0.0.x para a v0.1.x
zh_cn: 从 V0.0.x 迁移到 V0.1.x
zh_tw: 將 0.0.x 版移轉至 0.1.x 版

source: There is a significant change between the 0.0.x releases and 0.1.x that will require changes to client code. The library now supports multiple message formats, so users should update calls to deviceClient.publishEvent, appClient.publishEvent and appClient.publishCommand to also supply the desired message format.
de: Zwischen den 0.0.x-Releases und 0.1.x gab es eine wesentliche Änderung, die Änderungen am Client-Code erforderlich macht. Die Bibliothek unterstützt nun mehrere Nachrichtenformate. Daher sollten Benutzer Aufrufe von 'deviceClient.publishEvent', 'appClient.publishEvent' und 'appClient.publishCommand' so aktualisieren, dass das gewünschte Nachrichtenformat bereitgestellt wird.
es: Hay un cambio significativo entre los releases 0.0.x y 0.1.x que necesitará cambios en el código de cliente. La biblioteca ahora da soporte a varios formatos de mensaje, para que los usuarios puedan actualizar las llamadas a deviceClient.publishEvent, appClient.publishEvent y appClient.publishCommand, así como suministrar el formato de mensaje que deseen.
fr: Les modifications importantes apportées entre la version 0.0.x et la version 0.1.x nécessitent la modification du code client. La bibliothèque prend désormais en charge plusieurs formats de message ; les utilisateurs doivent donc mettre à jour les appels à deviceClient.publishEvent, appClient.publishEvent et appClient.publishCommand pour indiquer le format de message choisi.
it: C'è stato un cambiamento significativo tra le release 0.0.x e 0.1.x che richiederà delle modifiche al codice client. La libreria ora supporta più formati di messaggi, pertanto gli utenti devono aggiornare le chiamate a deviceClient.publishEvent, appClient.publishEvent e appClient.publishCommand in modo che forniscano il formato del messaggio desiderato.
ja: 0.0.x リリースと 0.1.x の間には、クライアント・コードの変更を必要とする重大な変更点があります。ライブラリーは複数のメッセージ・フォーマットを適切にサポートするようになったので、ユーザーが deviceClient.publishEvent、appClient.publishEvent、および appClient.publishCommand への呼び出しを更新して、必要なメッセージ・フォーマットも提供することができます。
ko: 0.0.x 릴리스와 0.1.x 사이에는 클라이언트 코드를 변경해야 하는 중요한 변경사항이 있습니다. 라이브러리는 이제 여러 메시지 형식을 지원하므로 사용자는 deviceClient.publishEvent, appClient.publishEvent 및 appClient.publishCommand에 대한 호출을 업데이트하여 원하는 메시지 형식도 제공해야 합니다.
pt_br: Há uma mudança significativa entre as liberações 0.0.x e 0.1.x que exigirá mudanças no código do cliente. A biblioteca agora suporta vários formatos de mensagens, então os usuários devem atualizar as chamadas para deviceClient.publishEvent, appClient.publishEvent e appClient.publishCommand para fornecer também o formato de mensagem desejado.
zh_cn: 0.0.x 发行版和 0.1.x 之间进行了重要更改，后者需要对客户机代码进行更改。此库现在支持多种消息格式，因此用户应更新对 deviceClient.publishEvent、appClient.publishEvent 和 appClient.publishCommand 的调用，以同时提供所需消息格式。
zh_tw: 0.0.x 版和 0.1.x 之間有重大變更，需要變更用戶端程式碼。目前程式庫支援多種訊息格式，因此使用者應更新對 deviceClient.publishEvent、appClient.publishEvent 和 appClient.publishCommand 的呼叫，以同時提供所需的訊息格式。

source: Sample code v0.0.9:
de: Beispielcode v0.0.9:
es: Código de ejemplo v0.0.9:
fr: Exemple de code de la version 0.0.9 :
it: Codice di esempio v0.0.9:
ja: サンプル・コード v0.0.9:
ko: 샘플 코드 v0.0.9:
pt_br: Código de amostra v0.0.9:
zh_cn: 样本代码 V0.0.9：
zh_tw: 範例程式碼 0.0.9 版：

source: Sample code v0.1.1:
de: Beispielcode v0.1.1:
es: Código de ejemplo v0.1.1:
fr: Exemple de code de la version 0.1.1 :
it: Codice di esempio v0.1.1:
ja: サンプル・コード v0.1.1:
ko: 샘플 코드 v0.1.1:
pt_br: Código de amostra v0.1.1:
zh_cn: 样本代码 V0.1.1：
zh_tw: 範例程式碼 0.1.1 版：

source: Also, as part of this change, events and commands sent as format "json" will not be assumed to meet the `IOTF JSON Payload Specification <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__. The default client behaviour will be to parse commands and events with format "json" as a generic JSON object only. Only messages sent as format "json-iotf" will default to being decoded in this specification.
de: Im Rahmen dieser Änderung wird darüber hinaus nicht davon ausgegangen, dass Ereignisse und Befehle, die im Format "json" gesendet werden, die `IOTF-JSON-Spezifikationen für Nutzdaten <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__ erfüllen. Das standardmäßige Clientverhalten besteht im Parsing von Befehlen und Ereignissen mit dem Format "json" lediglich als generisches JSON-Objekt. Nur Nachrichten, die im Format "json-iotf" gesendet werden, werden standardmäßig in dieser Spezifikation decodiert.
es: Asimismo, como parte de este cambio, no se supondrá que los sucesos y mandatos enviados con formato "json" cumplen con la `Especificación de carga útil JSON de IOTF <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__. El comportamiento predeterminado del cliente será analizar los mandatos y sucesos con formato "json" solo como objeto JSON genérico. Solo los mensajes enviados con formato "json-iotf" se descodificarán de forma predeterminada según esta especificación.
fr: A la suite de ces modifications, le système considère que les événements et les commandes envoyés au format "json" ne respectent pas la spécification `IOTF JSON Payload <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__. Le comportement par défaut du client consiste à analyser les commandes et les événements au format "json" comme des objets JSON génériques. Seuls les messages envoyés au format "json-iotf" sont décodés par défaut conformément à cette spécification.
it: Inoltre, come parte di questa modifica, non si presumerà che gli eventi e i comandi inviati in formato "json" rispettino la `specifica payload JSON IOTF <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__. Il funzionamento predefinito del client sarà quello di analizzare i comandi e gli eventi con il formato "json" solo come oggetti JSON generici. Solo i messaggi inviati in formato "json-iotf" saranno, per impostazione predefinita, decodificati in base a questa specifica.
ja: また、この変更の一環として、"json" 形式として送信されたイベントおよびコマンドは、`IOTF JSON ペイロードの仕様 <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__ を満たしていると想定されなくなります。デフォルトのクライアントの動作では、"json" 形式のコマンドやイベントが一般 JSON オブジェクトのみとして解析されます。"json-iotf" 形式として送信されたメッセージだけが、デフォルトでこの仕様に基づいてデコードされます。
ko: 또한 이 변경의 일부로서 "json" 형식으로 전송된 명령 및 이벤트는 `IOTF JSON 페이로드 스펙 <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__을 충족하는 것으로 가정하지 않습니다. 기본 클라이언트 동작은 "json" 형식을 가진 이벤트 및 명령을 일반적인 JSON 오브젝트로만 구문 분석하는 것입니다. "json-iotf" 형식으로 전송된 메시지만 기본적으로 이 스펙에서 디코딩됩니다.
pt_br: Além disso, como parte dessa mudança, os eventos e comandos enviados como formato "json" não serão assumidos para atender à `IOTF Especificação de Carga Útil JSON <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__. O comportamento do cliente padrão será analisar comandos e eventos com o formato "json" apenas como um objeto JSON genérico. Apenas mensagens enviadas no formato "json-iotf" serão decodificadas por padrão nesta especificação.
zh_cn: 此外，作为此更改的一部分，以“json”格式发送的事件和命令将被认为不符合 `IOTF JSON 有效内容规范 <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__。缺省客户机行为是仅将格式为“json”的命令和事件解析为通用 JSON 对象。只有以格式“json-iotf”发送的消息将缺省为按此规范进行解码。
zh_tw: 而且，在這次變更中，不會採用以 "json" 格式傳送的事件和指令來符合 `IOTF JSON 內容規格<https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__。預設用戶端行為是只將 "json" 格式的指令和事件剖析成通用的 JSON 物件。只有以 "json-iotf" 格式傳送的訊息會預設為以此規格解碼。
