Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python_sample_doc.po
Languages: de, fr, ja, pt_br, zh_tw

source: Python Client Library - Devices
de: Python-Clientbibliothek - Geräte
fr: Bibliothèque client Python - Terminaux
ja: Python クライアント・ライブラリー - デバイス
pt_br: Biblioteca do Cliente Python - Dispositivos
zh_tw: Python 用戶端程式庫 - 裝置

source: Introduction
de: Einführung
ja: 概要
pt_br: Introdução
zh_tw: 簡介

source: This client library describes how to use devices with the python ibmiotf module. For help with getting started with this module, see `Python Client Library - Introduction <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.
de: Diese Clientbibliothek beschreibt die Verwendung von Geräten mit dem Python-ibmiotf-Modul. Hilfe bei den ersten Schritten mit diesem Modul siehe `Python-Clientbibliothek - Einführung <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.
fr: Cette bibliothèque client explique comment utiliser des terminaux avec le module Python ibmiotf. Pour obtenir de l'aide lors de la mise en route de ce module, reportez-vous à la section `Bibliothèque client Python - Introduction <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.
ja: このクライアント・ライブラリーは、python ibmiotf モジュールでデバイスを使用する方法について記述しています。このモジュールを始めるにあたって、ヘルプとなる `Python クライアント・ライブラリー - 概要 <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__ を参照してください。
pt_br: Esta biblioteca do cliente descreve como usar dispositivos com o módulo ibmiotf python. Para obter ajuda sobre como iniciar este módulo, consulte `Biblioteca do Cliente Python - Introdução <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.
zh_tw: 此用戶端程式庫說明如何搭配 Python ibmiotf 模組來使用裝置。開始使用此模組時如需協助，請參閱 `Python 用戶端程式庫 - 簡介 <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__。

source: The client library is divided into two sections, both included within the library. This section contains information on how devices publish events and handle commands using the Python ibmiotf module, and the Applications section contains information on how applications can use the ibmiotf module to interact with devices.
de: Die Clientbibliothek ist in zwei Abschnitte unterteilt, die beide in der Bibliothek enthalten sind. Dieser Abschnitt enthält Informationen dazu, wie Geräte Ereignisse publizieren und Befehle mit dem Python-Modul ibmiotf verarbeiten. Der Abschnitt mit den Anwendungen enthält Informationen, wie Anwendungen das ibmiotf-Modul zur Interaktion mit Geräte verwenden können.
fr: La bibliothèque client est divisée en deux sections, placées chacune dans la bibliothèque. Cette section contient des informations expliquant comment les terminaux publient des événements et traitent des commandes à l'aide du module Python ibmiotf. La section Applications contient des informations décrivant comment les applications peuvent utiliser le module ibmiotf pour interagir avec des terminaux.
ja: このクライアント・ライブラリーは、それぞれがライブラリー内に組み込まれた 2 つのセクションに分割されます。このセクションにはデバイスが Python ibmiotf モジュールを使用してイベントをパブリッシュしコマンドを処理する方法に関する情報が、アプリケーション・セクションにはアプリケーションが ibmiotf モジュールを使用してデバイスと対話する方法に関する情報が含まれます。
pt_br: A biblioteca do cliente é dividida em duas seções, ambas incluídas dentro da biblioteca. Esta seção contém informações sobre como os dispositivos publicam eventos e manipulam comandos usando o módulo ibmiotf Python; a seção Aplicativos contém informações sobre como os aplicativos podem usar o módulo ibmiotf para interagir com dispositivos.
zh_tw: 用戶端程式庫分成兩個區段，都內含在程式庫中。這個區段包含裝置如何使用 Python ibmiotf 模組發佈事件及處理指令的相關資訊，「應用程式」區段則包含應用程式如何使用 ibmiotf 模組與裝置互動的相關資訊。

source: This section lists the code samples which are bundled with the ibmiotf python module, and gives and introduction to their function and purpose.
de: Dieser Abschnitt listet die Codebeispiele auf, die im Python-ibmiotf-Modul als Bundle vorhanden sind, und gibt eine Einführung in deren Funktion und Zweck.
fr: Cette section répertorie les exemples de code fournis avec le module Python ibmiotf et contient une présentation de leur fonctionnement et de leur finalité.
ja: このセクションでは、ibmiotf python モジュールに組み込まれるコード・サンプルをリストし、それらの機能と目的の概要を示します。
pt_br: Esta seção lista as amostras de código que são empacotadas com o módulo python ibmiotf e fornece uma introdução à sua função e finalidade.
zh_tw: 此區段列出與 Python ibmiotf 模組結合的程式碼範例，並簡介其函數和用途。

source: The bluemixZoneDemo Sample
de: Beispiel bluemixZoneDemo
fr: Exemple bluemixZoneDemo
ja: bluemixZoneDemo サンプル
pt_br: A Amostra bluemixZoneDemo
zh_tw: bluemixZoneDemo 範例

source: The cli Sample
de: Beispiel cli
fr: Exemple cli
ja: cli サンプル
pt_br: A Amostra cli
zh_tw: cli 範例

source: The customMessageFormat
de: customMessageFormat
fr: customMessageFormat
ja: customMessageFormat
pt_br: O customMessageFormat
zh_tw: customMessageFormat

source: The helloWorld Sample
de: Beispiel helloWorld
fr: Exemple helloWorld
ja: helloWorld サンプル
pt_br: A Amostra helloWorld
zh_tw: helloWorld 範例

source: The psutil Sample
de: Beispiel psutil
fr: Exemple psutil
ja: psutil サンプル
pt_br: A Amostra psutil
zh_tw: psutil 範例

source: The simpleApp Sample
de: Beispiel simpleApp
fr: Exemple simpleApp
ja: simpleApp サンプル
pt_br: A Amostra simpleApp
zh_tw: simpleApp 範例
