Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/device_mgmt/operations/index.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: Device Management Introduction
de: Einheitenmanagement - Einführung
es: Introducción a la gestión de dispositivos
fr: Gestion des terminaux - Introduction
it: Introduzione alla gestione dispositivo
ja: デバイス管理の概要
ko: 디바이스 관리 소개
pt_br: Introdução ao gerenciamento de dispositivos
zh_cn: 设备管理简介
zh_tw: 裝置管理簡介

source: Introduction
de: Einführung
es: Introducción
it: Introduzione
ja: 概要
ko: 소개
pt_br: Introdução
zh_cn: 简介
zh_tw: 簡介

source: The Device Management capabilities in the Internet of Things Foundation create a new class of connected devices, Managed Devices.
de: De Funktionalität des Einheitenmanagements im Internet of Things Foundation erstellen eine neue Klasse miteinander verbundender Einheiten, den verwalteten Einheiten.
es: Las prestaciones de gestión de dispositivos de Internet of Things Foundation crean una nueva clase de dispositivos conectados, los Dispositivos gestionados.
fr: Les fonctionnalités de gestion des terminaux d'Internet of Things Foundation créent une classe de terminaux connectés, appelés Terminaux gérés.
it: Le funzionalità di gestione dispositivo in Internet of Things Foundation creano una nuova classe di dispositivi connessi, i dispositivi gestiti.
ja: Internet of Things Foundation のデバイス管理機能は、接続デバイスの新しいクラスである管理対象デバイスを作成します。
ko: Internet of Things Foundation의 디바이스 관리 기능은 새로운 클래스의 연결된 디바이스 즉, 관리 디바이스를 작성합니다.
pt_br: Os recursos de gerenciamento de dispositivos no Internet of Things Foundation criam uma nova classe de dispositivos conectados, os dispositivos gerenciados.
zh_cn: Internet of Things Foundation 中的“设备管理”功能可创建新一类的已连接设备，即“受管设备”。
zh_tw: Internet of Things Foundation 中的「裝置管理」功能會建立一個新的已連接裝置類別，稱為「受管理裝置」。

source: Managed Devices must, by definition, contain a management agent which can understand the Internet of Things Foundation Device Management Protocol, and send a Manage Device request to the IoT Foundation Device Management server. Managed devices can access the device management operations as explained later in this document.
de: Verwaltete Einheiten müssen per Definition, einen Managementagent enthalten, der das Internet of Things Foundation-Verwaltungseinheitenprotokoll versteht, und eine Anforderung zum Verwalten von Einheiten zum IoT Foundation Device Management-Server senden kann. Verwaltete Einheiten können auf die Einheitenmanagementoperationen zugreifen (wie später in diesem Dokument beschrieben).
es: Los dispositivos gestionados deben, por definición, contener un agente de gestión que pueda entender el protocolo de gestión de dispositivos de Internet of Things Foundation y enviar solicitudes de dispositivos gestionados al servidos de gestión de dispositivos de IoT. Los dispositivos gestionados pueden acceder a las operaciones de gestión de dispositivos como se explica más adelante en el presente documento.
fr: Par définition, les terminaux gérés doivent inclure un agent de gestion capable de comprendre le protocole de gestion des terminaux Internet of Things Foundation, et envoyer une demande de gestion des terminaux au serveur IoT Foundation correspondant. Les terminaux gérés peuvent accéder aux opérations de gestion des terminaux, comme expliqué ultérieurement dans ce document.
it: I dispositivi gestiti devono, per definizione, contenere un agent di gestione che possa comprendere il protocollo di gestione dispositivo di Internet of Things Foundation e inviare una richiesta di gestione dispositivo al server di gestione dispositivo di IoT Foundation. I dispositivi gestiti possono accedere alle operazioni di gestione dispositivo come illustrato in seguito in questo documento.
ja: 定義上、管理対象デバイスには、Internet of Things Foundation デバイス管理プロトコルを理解できる管理エージェントが含まれている必要があります。また、管理デバイス・リクエストを IoT Foundation デバイス管理サーバーに送信する必要があります。本書内で後述していますが、管理対象デバイスは、デバイス管理操作にアクセスすることができます。
ko: 관리 디바이스에는 의미상 Internet of Things Foundation 디바이스 관리 프로토콜을 이해하고 IoT Foundation 디바이스 관리 서버에 디바이스 관리 요청을 보낼 수 있는 관리 에이전트가 있어야 합니다. 관리 디바이스는 디바이스 관리 오퍼레이션에 액세스할 수 있으며 이 오퍼레이션에 대해서는 이 문서의 후반부에 설명되어 있습니다.
pt_br: Por definição, os dispositivos gerenciados devem conter um agente de gerenciamento que possa entender o protocolo de gerenciamento de dispositivos do Internet of Things Foundation e enviar uma solicitação de gerenciamento de dispositivo ao servidor de gerenciamento de dispositivos do IoT Foundation. Os dispositivos gerenciados podem acessar as operações de gerenciamento de dispositivos, como é explicado posteriormente neste documento.
zh_cn: 根据定义，受管设备必须包含一个管理代理程序，该代理程序可理解“Internet of Things Foundation 设备管理协议”，并可向“IoT Foundation 设备管理”服务器发送“管理设备”请求。如本文档后续部分所述，受管设备可以访问设备管理操作。
zh_tw: 依定義，「受管理裝置」必須包含一個管理代理程式，其可瞭解「Internet of Things Foundation 裝置管理通訊協定」，及傳送「管理裝置」要求至「IoT Foundation 裝置管理」伺服器。受管理裝置可以存取裝置管理作業，如本文件中稍後說明。

source: The Device Management Protocol defines a set of supported operations. A device management agent can support a subset of the operations, but the Manage device and Unmanage device operations must be supported. A device supporting firmware action operations must also support observation.
de: Das Einheitenmanagementprotokoll definiert eine Gruppe unterstützter Operationen. Von einem Einheitenmanagementagenten kann eine Teilmenge der Operationen unterstützt werden, die Operationen 'Einheit verwalten' und 'Einheit nicht verwalten' müssen jedoch unterstützt werden. Von einer Einheit, von der Operationen für Firmwareaktionen unterstützt werden, muss auch eine Beobachtung unterstützt werden.
es: El protocolo de gestión de dispositivos define un conjunto de operaciones admitidas. Un agente de gestión de dispositivos puede admitir un subconjunto de operaciones, pero las operaciones Gestionar el dispositivo o No gestionar el dispositivo deben ser compatibles. Un dispositivo que admita operaciones de acción de firmware debe admitir también la observación.
fr: Le protocole de gestion des terminaux définit un ensemble d'opérations prises en charge. Un agent de gestion des terminaux peut prendre en charge un sous-ensemble de ces opérations mais les opérations de gestion d'un terminal et d'annulation de la gestion d'un terminal doivent être prises en charge. Un terminal qui prend en charge les opérations impliquant des actions sur le microprogramme doit également prendre en charge l'action d'observation.
it: Il protocollo di gestione dispositivo definisce un insieme di operazioni supportate. Un agent di gestione dispositivo può supportare un sottoinsieme delle operazioni, ma le operazioni Gestisci dispositivo e Annulla gestione dispositivo devono essere supportate. Un dispositivo che supporta le operazioni Azioni firmware deve anche supportate le osservazioni.
ja: デバイス管理プロトコルとは、サポートされる一連の操作を定義したものです。デバイス管理エージェントはこれらの操作のサブセットをサポートできますが、「デバイスを管理」操作と「デバイスを管理解除」操作のサポートは必須です。また、ファームウェア・アクション操作をサポートするデバイスでは、監視もサポートする必要があります。
ko: 디바이스 관리 프로토콜이 지원되는 오퍼레이션 세트를 정의합니다. 디바이스 관리 에이전트는 오퍼레이션의 서브세트를 지원하지만, 디바이스 관리 및 디바이스 관리 해제 오퍼레이션이 지원되어야 합니다. 펌웨어 조치 오퍼레이션을 지원하는 디바이스도 관찰을 지원해야 합니다.
pt_br: O Protocolo de Gerenciamento de Dispositivo define um conjunto de operações suportadas. Um agente de gerenciamento de dispositivo pode suportar um subconjunto de operações, mas as operações Gerenciar dispositivo e Não gerenciar dispositivo devem ser suportadas. Um dispositivo que suporta operações de ação de firmware deve suportar também a observação.
zh_cn: 设备管理协议定义了一组受支持的操作。设备管理代理程序可以支持其中一部分操作，但必须支持“管理设备”和“取消管理设备”操作。支持固件操作的设备还必须支持观察。
zh_tw: 「裝置管理通訊協定」定義一組支援的作業。裝置管理代理程式可以支援部分作業，但必須支援「管理裝置」及「取消管理裝置」作業。支援韌體動作作業的裝置也必須支援觀察。

source: The Device Management Protocol is built on top of MQTT. For details specific to how Device Management Protocol interacts with MQTT please see `MQTT for Managed Devices <../../messaging/managed_devices.html>`__
de: Das Einheitenmanagementprotokoll baut auf MQTT auf. Details zur Interaktion des Einheitenmanagementprotokolls mit MQTT für verwaltete Einheiten finden Sie unter <../../messaging/managed_devices.html>`__.
es: El protocolo de gestión de dispositivos está construido en la parte superior de MQTT. Para obtener detalles concretos de cómo interactúa el protocolo de gestión de dispositivos con MQTT, consulte 'MQTT para dispositivos gestionados <../../messaging/managed_devices.html>'__
fr: Le protocole de gestion des terminaux se trouve au-dessus de MQTT. Pour plus d'informations sur l'interaction du protocole de gestion des terminaux avec MQTT, reportez-vous à la rubrique `Connectivité MQTT des terminaux gérés <../../messaging/managed_devices.html>`__
it: Il protocollo di gestione dispositivo si basa su MQTT. Per dettagli specifici su come il protocollo di gestione dispositivo interagisce con MQTT, fare riferimento a `MQTT per dispositivi gestiti <../../messaging/managed_devices.html>`__
ja: デバイス管理プロトコルは、MQTT を基礎として作成されています。デバイス管理プロトコルと MQTT の対話方法に関する詳細については、`管理対象デバイスの MQTT 接続<../../messaging/managed_devices.html>`__ を参照してください
ko: 디바이스 관리 프로토콜이 MQTT의 맨 위에 빌드됩니다. 디바이스 관리 프로토콜이 MQTT와 상호작용하는 방법에 특정한 세부사항은 `관리 디바이스에 대한 MQTT <../../messaging/managed_devices.html>`__의 내용을 참조하십시오.
pt_br: O Protocolo de Gerenciamento de Dispositivo é construído sobre o MQTT. Para obter detalhes específicos sobre como o Protocolo de Gerenciamento de Dispositivo interage com o MQTT consulte `MQTT para Dispositivos Gerenciados <../../messaging/managed_devices.html>`__
zh_cn: 设备管理协议基于 MQTT 构建。有关设备管理协议如何与 MQTT 进行交互的特定详细信息，请参阅 `MQTT for Managed Devices <../../messaging/managed_devices.html>`__
zh_tw: 「裝置管理通訊協定」是建置在 MQTT 之上。如需「裝置管理通訊協定」如何與 MQTT 互動的特定詳細資訊，請參閱 `適用於受管理裝置的 MQTT <../../messaging/managed_devices.html>`__

source: Device Initiated
de: Einheit initiiert
es: Dispositivo iniciado
fr: Opérations lancées par le terminal
it: Avviato dal dispositivo
ja: デバイスから開始されるもの
ko: 시작된 디바이스
pt_br: Iniciado pelo Dispositivo
zh_cn: 已启动设备
zh_tw: 由裝置起始

source: These operations are initiated by the device. ``manage`` and ``unmanage`` operations must be supported by all managed devices. All other operations are optional.
de: Diese Operationen werden durch die Einheit initiiert. Die Operationen ``manage`` und ``unmanage`` müssen von allen verwalteten Einheiten unterstützt werden. Alle anderen Operationen sind optional.
es: El dispositivo inicia estas operaciones. Las operaciones 'manage' y 'unmanage' deben ser compatibles con todos los dispositivos gestionados. Todas las demás operaciones son opcionales.
fr: Ces opérations sont lancées par le terminal. Les opérations de``gestion`` et d'``annulation de la gestion`` doivent être prises en charge par tous les terminaux gérés. Toutes les autres opérations sont facultatives.
it: Queste operazioni sono avviate dal dispositivo. Le operazioni ``manage`` e ``unmanage`` devono essere supportate da tutti i dispositivi gestiti. Tutte le altre operazioni sono facoltative.
ja: これらの操作はデバイスから開始されます。「管理 (manage)」および「管理解除 (unmanage)」操作は、すべての管理対象デバイスでサポートされる必要があります。その他のすべての操作はオプションです。
ko: 이러한 오퍼레이션은 디바이스에서 시작됩니다. ``관리`` 및 ``관리 해제`` 오퍼레이션이 모든 관리 디바이스에서 지원되어야 합니다. 모든 기타 오퍼레이션은 선택적입니다.
pt_br: Estas operações são iniciadas pelo dispositivo. As operações ``manage`` e ``unmanage`` devem ser suportadas por todos os dispositivos gerenciados. Todas as outras operações são opcionais.
zh_cn: 这些操作由设备启动。所有受管设备都必须支持“管理”和“取消管理”操作。其他所有操作为可选操作。
zh_tw: 這些作業是由裝置起始。所有受管理裝置都必須支援「管理」及「取消管理」作業。所有其他作業都是選用的。

source: Management Operations
de: Managementoperationen
es: Operaciones de gestión
fr: Opérations de gestion
it: Operazioni di gestione
ja: 管理操作
ko: 관리 오퍼레이션
pt_br: Operações de Gerenciamento
zh_cn: 管理操作
zh_tw: 管理作業

source: These operations control whether device management features are enabled for the device.
de: Diese Operationen steuern, welche Einheitenmanagementfunktionen für die Einheit aktiviert sind.
es: Estas operaciones controlan si las funciones de gestión de dispositivos están habilitadas para el dispositivo.
fr: Ces opérations déterminent si les fonctions de gestion des terminaux sont activées pour le terminal.
it: Queste operazioni controllano se le funzioni di gestione dispositivo sono abilitate per il dispositivo.
ja: これらの操作は、デバイスのデバイス管理機能を有効にするかどうかを制御します。
ko: 이러한 오퍼레이션은 디바이스 관리 기능이 디바이스에 대해 사용으로 설정되었는지 여부를 제어합니다.
pt_br: Estas operações controlam se os recursos de gerenciamento de dispositivo estão ativados para o dispositivo.
zh_cn: 这些操作用于控制是否为设备启用设备管理功能。
zh_tw: 這些作業控制是否針對裝置啟用裝置管理特性。

source: Operation
es: Operación
fr: Opération
it: Operazione
ja: 操作
ko: 오퍼레이션
pt_br: Operação
zh_cn: 操作
zh_tw: 作業

source: Device Support
de: Einheitenunterstützung
es: Soporte de dispositivo
fr: Prise en charge des terminaux
it: Supporto dispositivo
ja: デバイス・サポート
ko: 디바이스 지원
pt_br: Suporte de Dispositivo
zh_cn: 设备支持
zh_tw: 裝置支援

source: Required
de: Erforderlich
es: Obligatorio
fr: Obligatoire
it: Richiesto
ja: 必須
ko: 필수
pt_br: Necessárias
zh_cn: 必需
zh_tw: 必要項目

source: Device Property Changes
de: Änderung bei den Einheiteneigenschaften
es: Cambios en la propiedad del dispositivo
fr: Modifications des propriétés d'un terminal
it: Modifiche proprietà dispositivo
ja: デバイス・プロパティー変更
ko: 디바이스 특성 변경
pt_br: Mudanças nas Propriedades do Dispositivo
zh_cn: 设备属性更改
zh_tw: 裝置內容變更

source: These optional operations, if implemented, allow the device to submit updated device-specific information to the service.
de: Diese optionalen Operationen (falls implementiert) ermöglichen es der Einheit, aktualisierte, einheitenspezifische Informationen an den Service zu übergeben.
es: Estas operaciones opcionales, si se implementan, permiten al dispositivo enviar información específica de dispositivo actualizada al servicio.
fr: Si elles sont mises en oeuvre, ces opérations facultatives permettent au terminal de soumettre au service des informations mises à jour propres au terminal.
it: Queste operazioni facoltative, se implementate, consentono al dispositivo di inoltrare le informazioni aggiornate specifiche del dispositivo al servizio.
ja: これらの操作はオプションですが、これらを実装すると、デバイスは更新されたデバイス固有情報をサービスに送信できます。
ko: 이러한 선택적 오퍼레이션이 구현되면 이를 통해 디바이스가 업데이트된 디바이스별 정보를 서비스에 제출할 수 있습니다.
pt_br: Estas operações opcionais, se implementadas, permitem que o dispositivo envie informações atualizadas específicas do dispositivo para o serviço.
zh_cn: 如果实施这些可选操作，那么它们将允许设备向服务提交更新后的设备特有信息。
zh_tw: 如果實作這些選用作業，可讓裝置提交更新的裝置特定資訊給服務。

source: Optional
es: Opcional
fr: Facultatif
it: Facoltativo
ja: オプション
ko: 선택사항
pt_br: Opcional
zh_cn: 可选
zh_tw: 選用

source: Optional, required for devices supporting firmware update
de: Optional, erforderlich für Einheiten, von denen ein Firmware-Update unterstützt wird
es: Opcional, necesario para los dispositivos compatibles con actualización de firmware
fr: Facultatif. Obligatoire pour les terminaux qui prennent en charge la mise à jour du microprogramme
it: Facoltativo, richiesto perché i dispositivi supportino l'aggiornamento firmware
ja: オプション。ファームウェア更新をサポートするデバイスでは必須
ko: 선택사항이며, 펌웨어 업데이트를 지원하는 디바이스에 필수
pt_br: Opcional, necessária para dispositivos que suportam a atualização de firmware
zh_cn: 可选（对于支持固件更新的设备而言是必需的）
zh_tw: 選用，若裝置支援韌體更新則是必要的

source: Add and Clear Diagnostic Information
de: Diagnoseinformationen hinzufügen und löschen
es: Añadir y borrar información de diagnóstico
fr: Ajouter et effacer des informations de diagnostic
it: Aggiungi e cancella informazioni di diagnostica
ja: 診断情報の追加と消去
ko: 진단 정보 추가 및 지우기
pt_br: Incluir e Limpar Informações de Diagnóstico
zh_cn: 添加和清除诊断信息
zh_tw: 新增及清除診斷資訊

source: Devices can add new device-specific diagnostic information, for example, a new error code, log message, or to clear all existing error codes or log messages from the Internet of Things Foundation.
de: Von Einheiten können neue einheitenspezifische Diagnoseinformationen hinzugefügt werden; Beispiel: ein neuer Fehlercode, eine Protokollnachricht oder Informationen zum Löschen aller vorhandenen Fehlercodes oder Protokolleinträge von Internet of Things Foundation.
es: Los dispositivos pueden añadir información de diagnóstico nueva, por ejemplo, un nuevo código de error, un mensaje de registro o para borrar todos los códigos de error o mensajes de registro existentes de Internet of Things Foundation.
fr: Les terminaux peuvent ajouter de nouvelles informations de diagnostic propres à un terminal, par exemple un nouveau code d'erreur ou un message de journal, ou effacer tous les codes d'erreur ou les messages d'erreur existants dans Internet of Things Foundation.
it: I dispositivi possono aggiungere nuove informazioni di diagnostica specifiche del dispositivo, ad esempio, un nuovo codice di errore, il messaggio di log, oppure per cancellare tutti i codici di errore esistenti o i messaggi di log da Internet of Things Foundation.
ja: デバイスはデバイス固有の新しい診断情報 (新しいエラー・コード、ログ・メッセージなど) を追加できます。また、既存のすべてのエラー・コードやログ・メッセージを Internet of Things Foundation から消去できます。
ko: 디바이스가 새 디바이스별 진단 정보(예: 새 오류 코드, 로그 메시지)를 추가할 수 있거나 Internet of Things Foundation에서 모든 기존 오류 코드 또는 로그 메시지를 지웁니다.
pt_br: Os dispositivos podem incluir novas informações de diagnóstico específicas do dispositivo, por exemplo, um novo código de erro, uma mensagem de log ou limpar do Internet of Things Foundation todos os códigos de erro e mensagens de log existentes.
zh_cn: 在 Internet of Things Foundation 中，设备可以添加新的设备特有诊断信息（例如，新错误代码或日志消息），也可以清除所有现有错误代码或日志消息。
zh_tw: 裝置可以新增裝置特定的診斷資訊（例如，新的錯誤碼、日誌訊息），或清除來自 Internet of Things Foundation 的所有現有錯誤碼或日誌訊息。

source: Service Initiated
de: Service initiiert
es: Servicio iniciado
fr: Opérations lancées par le service
it: Avviato dal servizio
ja: サービスから開始されるもの
ko: 시작된 서비스
pt_br: Iniciado pelo Serviço
zh_cn: 已启动服务
zh_tw: 由服務起始

source: These operations are initiated by the Internet of Things Foundation, a managed device does not need to support handling any of these operations.
de: Diese Operationen werden von Internet of Things Foundation initiiert; von einer verwalteten Einheit muss die Verarbeitung solcher Operationen nicht unterstützt werden.
es: Estas operaciones son iniciadas por Internet of Things Foundation, un dispositivo gestionado no necesita compatibilidad con el manejo de estas operaciones.
fr: Ces opérations sont lancées par Internet of Things Foundation. Un terminal géré n'a pas à prendre en charge ces opérations.
it: Queste operazioni sono avviate da Internet of Things Foundation, un dispositivo gestito non necessita di supportare la gestione di alcuna di queste operazioni.
ja: これらの操作は Internet of Things Foundation から開始されるため、管理対象デバイスがこれらの操作のハンドリングをサポートする必要はありません。
ko: 이러한 오퍼레이션은 Internet of Things Foundation에서 시작되고, 관리 디바이스가 이러한 오퍼레이션 처리를 지원하지 않아도 됩니다.
pt_br: Estas operações são iniciadas pelo Internet of Things Foundation, um dispositivo gerenciado que não precisa suportar a manipulação de nenhuma dessas operações.
zh_cn: 这些操作由 Internet of Things Foundation 启动，受管设备不需要具备处理其中任何操作的能力。
zh_tw: 這些作業是由 Internet of Things Foundation 起始；受管理裝置不需要支援處理任何作業。

source: Update Attributes
de: Attribute aktualisieren
es: Actualizar atributos
fr: Mettre à jour des attributs
it: Aggiorna attributi
ja: 属性の更新
ko: 속성 업데이트
pt_br: Atualizar Atributos
zh_cn: 更新属性
zh_tw: 更新屬性

source: Devices should update attributes, such as metadata, location, or device information, upon a request from the Internet of Things Foundation.
de: Von den Einheiten müssen Attribute, wie Metadaten, Position oder Einheitendaten, auf Anforderung von Internet of Things Foundation aktualisiert werden.
es: Los dispositivos deben actualizar atributos, como los metadatos, la ubicación o la información del dispositivo tras una solicitud procedente de Internet of Things Foundation.
fr: Les terminaux doivent mettre à jour un certain nombre d'attributs, comme les métadonnées, l'emplacement ou les informations des terminaux, à la demande d'Internet of Things Foundation.
it: I dispositivi devono aggiornare gli attributi, come i metadati, l'ubicazione o informazioni sul dispositivo, su richiesta da Internet of Things Foundation.
ja: デバイスは、Internet of Things Foundation からのリクエストに応じてメタデータ、ロケーション、デバイス情報などの属性を更新する必要があります。
ko: Internet of Things Foundation에서 요청 시 메타데이터, 위치 또는 디바이스 정보 등의 속성을 디바이스가 업데이트해야 합니다.
pt_br: Os dispositivos devem atualizar atributos, como metadados, locais ou informações sobre o dispositivo, a pedido do Internet of Things Foundation.
zh_cn: 设备应根据来自 Internet of Things Foundation 的请求来更新属性（如元数据、位置或设备信息）。
zh_tw: 裝置應該在 Internet of Things Foundation 要求時更新屬性（例如 meta 資料、位置或裝置資訊）。

source: Attribute Observations
de: Attributbeobachtungen
es: Observaciones de atributo
fr: Observations des attributs
it: Osservazioni attributo
ja: 属性の監視
ko: 속성 관찰
pt_br: Observações de Atributo
zh_cn: 属性观察
zh_tw: 屬性觀察

source: These actions request devices to notify (or stop notifying) the service to changes in one or more attributes on the device.
de: Durch diese Aktionen werden Einheiten aufgefordert, Services über Änderungen in mindestens einem Attribut auf einer Einheit zu benachrichtigen (oder die Benachrichtigung zu stoppen).
es: Estas acciones solicitan a los dispositivos que notifiquen (o dejar de notificar) al servicio sobre los cambios en uno o varios atributos del dispositivo.
fr: Ces actions demandent aux terminaux de signaler (ou d'arrêter de signaler) au service les modifications apportées à un ou à plusieurs de leurs attributs.
it: Queste azioni richiedono ai dispositivi di notificare (o arrestare la notifica) al servizio le modifiche in uno o più attributi sul dispositivo.
ja: これらのアクションは、デバイスの 1 つ以上の属性の変更をサービスに通知する (または通知を停止する) ようにデバイスに要求します。
ko: 이러한 조치는 디바이스에서 하나 이상의 속성의 변경사항에 대해 서비스에 알리도록(또는 알림을 중지하도록) 디바이스에 요청합니다.
pt_br: Estas ações solicitam que os dispositivos notifiquem (ou parem de notificar) o serviço sobre mudanças feitas em um ou mais atributos no dispositivo.
zh_cn: 这些操作请求让设备向服务通知（或停止通知）设备上一个或多个属性的更改。
zh_tw: 這些動作會要求裝置在變更裝置上的一或多個屬性時，通知（或停止通知）服務。

source: Initiate an action
de: Aktion initiieren
es: Iniciar una acción
fr: Lancer une action
it: Avvia un'azione
ja: アクションの開始
ko: 조치 시작
pt_br: Iniciar uma ação
zh_cn: 启动操作
zh_tw: 起始動作

source: This action requests the device to initiate one of the following actions: reboot, factory reset, download firmware, or update firmware.
de: Von dieser Aktion wird die Initiierung einer der folgenden Aktionen durch die Einheit angefordert: Neustart, Factory-Reset, Firmware-Download oder Firmware-Upload.
es: Esta acción solicita al dispositivo que inicie una de las siguientes acciones: reinicio, restablecimiento a configuración de fábrica, descarga de firmware o actualización de firmware.
fr: Cette action demande au terminal de lancer l'une des actions suivantes : Réamorcer, Réinitialiser avec les paramètres d'usine, Télécharger le microprogramme ou Mettre à jour le microprogramme.
it: Questa azione richiede al dispositivo di avviare una delle seguenti azioni: riavvio, reimpostazione ai valori di fabbrica, scaricamento o aggiornamento del firmware.
ja: このアクションは、リブート、ファクトリー・リセット、ファームウェア・ダウンロード、またはファームウェア更新のいずれかのアクションを開始するようにデバイスに要求します。
ko: 이 조치에서는 다음 조치 중 하나를 시작하도록 디바이스에 요청합니다. 다시 부팅, 팩토리 재설정, 펌웨어 다운로드 또는 펌웨어 업데이트
pt_br: Esta ação solicita que o dispositivo inicie uma das seguintes ações: reinicialização, reconfiguração de fábrica, download de firmware ou atualização de firmware.
zh_cn: 该操作请求让设备启动以下某个操作：重新引导、恢复工厂设置、下载固件或更新固件。
zh_tw: 此動作要求裝置起始下列其中一個動作：重新開機、重設為原廠設定、下載韌體，或更新韌體。

source: Type
de: Typ
es: Tipo
it: Tipo
ja: タイプ
ko: 유형
pt_br: Tipo
zh_cn: 类型
zh_tw: 類型

source: Device action
de: Einheitenaktion
es: Acción de dispositivo
fr: Action sur le terminal
it: Azione dispositivo
ja: デバイス・アクション
ko: 디바이스 조치
pt_br: Ação do dispositivo
zh_cn: 设备操作
zh_tw: 裝置動作

source: Firmware action
de: Firmwareaktion
es: Acción de firmware
fr: Action sur le microprogramme
it: Azione firmware
ja: ファームウェア・アクション
ko: 펌웨어 조치
pt_br: Ação do firmware
zh_cn: 固件操作
zh_tw: 韌體動作

source: Return Codes
de: Rückkehrcodes
es: Códigos de devolución
fr: Codes retour
it: Codici di ritorno
ja: 戻りコード
ko: 리턴 코드
pt_br: Códigos de Retorno
zh_cn: 返回码
zh_tw: 回覆碼
