Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/device_mgmt/operations/index.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: There are several return codes which are sent in response to the actions listed above.
de: Als Antwort auf die nachfolgend aufgelisteten Aktionen werden mehrere Rückkehrcodes gesendet.
es: Hay siete códigos de devolución que se envían en respuesta a las acciones listadas anteriormente.
fr: Plusieurs codes retour peuvent être envoyés en réponse aux actions indiquées ci-dessus.
it: Esistono diversi codici di ritorno inviati in risposta alle azioni elencate in precedenza.
ja: 上記のアクションに対する応答として送信される戻りコードはいくつかあります。
ko: 위에 나열된 조치에 대한 응답으로 전송되는 여러 개의 리턴 코드가 있습니다.
pt_br: Há diversos códigos de retorno que são enviados em resposta às ações listadas acima.
zh_cn: 上述操作的响应中会发送多种返回码。
zh_tw: 您可傳送多個回覆碼，以回應上述列出的動作。

source: 200: Operation succeeded
de: 200: Operation erfolgreich
es: 200: La operación ha finalizado correctamente
fr: 200 : Réussite de l'opération
it: 200: Operazione riuscita
ja: 200: 操作が成功しました
ko: 200: 오퍼레이션 성공
pt_br: 200: Operação bem-sucedida
zh_cn: 200：操作成功
zh_tw: 200：作業成功

source: 202: Accepted (for initiating commands)
de: 202: Akzeptiert (für initiierte Befehle)
es: 202: Aceptado (para iniciar mandatos)
fr: 202 : Accepté (pour le lancement de commandes)
it: 202: Accettato (per avviare i comandi)
ja: 202: 受け入れられました (開始コマンドの場合)
ko: 202: 허용(명령 시작용)
pt_br: 202: Aceito (para a inicialização de comandos)
zh_cn: 202：已接受（针对正在启动的命令）
zh_tw: 202：已接受（針對起始指令）

source: 204: Changed (for attribute updates)
de: 204: Geändert (für Attributaktualisierungen)
es: 204: Modificado (para actualizaciones de atributo)
fr: 204 : Modifié (pour les mises à jour d'attributs)
it: 204: Modificato (per gli aggiornamenti attributo)
ja: 204: 変更されました (属性更新の場合)
ko: 204: 변경(속성 업데이트용)
pt_br: 204: Alterado (para atualizações de atributos)
zh_cn: 204：已更改（针对属性更新）
zh_tw: 204：已變更（針對屬性更新）

source: 400: Bad request, for example, if a device is not in the appropriate state for this command
de: 400: Falsche Anforderung (Beispiel: Eine Einheit befindet sich nicht im entsprechenden Status für einen bestimmten Befehl)
es: 400: Solicitud incorrecta, por ejemplo, si el estado del dispositivo no es correcto para este mandato
fr: 400 : Demande erronée, par exemple si un terminal ne se trouve pas dans l'état approprié pour cette commande
it: 400: Richiesta errata, ad esempio, se un dispositivo non si trova nello stato appropriato per questo comando
ja: 400: 不適切なリクエストです (デバイスがこのコマンドに適した状態にない場合など)
ko: 400: 잘못된 요청입니다. 예를 들어, 디바이스가 이 명령에 대해 적합한 상태가 아닌 경우가 있습니다.
pt_br: 400: Solicitação inválida, por exemplo, se um dispositivo não estiver no estado adequado para este comando
zh_cn: 400：错误请求（例如，当设备的状态不适合执行该命令时）
zh_tw: 400：不當的要求，例如，如果裝置不在此指令適用的狀態中

source: 404: Attribute was not found, this code is also used if the operation was published to an invalid topic.
de: 404: Attribut wurde nicht gefunden; dieser Code wird auch dann verwendet, wenn die Operation in einem ungültigen Attribut publiziert wurde.
es: 404: El atributo no se ha encontrado, este código también se utiliza si la operación se ha publicado para un tema no válido.
fr: 404 : Attribut introuvable. Ce code est également utilisé si l'opération a été publiée dans un sujet non valide.
it: 404: L'attributo non è stato trovato, questo codice viene utilizzato anche se l'operazione è stata pubblicata in un argomento non valido.
ja: 404: 属性が見つかりません。このコードは、操作が無効なトピックにパブリッシュされた場合にも使用されます。
ko: 404: 속성을 찾을 수 없습니다. 이 코드는 오퍼레이션이 올바르지 않은 주제에 공개되는 경우에도 사용됩니다.
pt_br: 404: O atributo não foi localizado, esse código também será usado se a operação for publicada para um tópico inválido.
zh_cn: 404：未找到属性，如果操作被发布至无效主题，那么也会使用此代码。
zh_tw: 404：找不到屬性，如果作業發佈到無效的主題，也會使用此訊息碼。

source: 409: Resource could not be updated due to a conflict, for example, the resource is being updated by two simultaneous requests, so update could be retried later
de: 409: Ressource wegen Konflikt nicht aktualisiert (Beispiel: Wenn eine Ressource von zwei simultanen Anforderungen aktualisiert wird, kann eine Aktualisierung später erneut versucht werden)
es: 409: El recurso no se puede actualizar debido a un conflicto, por ejemplo, dos solicitudes simultáneas están actualizando el recurso, por lo tanto, la actualización se puede intentar más tarde
fr: 409 : La ressource n'a pas pu être mise à jour en raison d'un conflit, par exemple lorsqu'elle est mise à jour par deux demandes simultanées. La tentative de mise à jour peut donc être effectuée ultérieurement.
it: 409: La risorsa non può essere aggiornata a causa di un conflitto, ad esempio, la risorsa viene aggiornata da due richieste simultanee, quindi l'aggiornamento può essere ritentato più tardi
ja: 409: (2 つのリクエストが同時にリソースを更新しようとしたなどの理由で) 競合のためにリソースを更新できませんでした。更新は後で再試行されます
ko: 409: 충돌로 인해 자원을 업데이트할 수 없습니다. 예를 들어, 2개의 동시 요청에서 자원이 업데이트 중이어서 업데이트를 나중에 다시 시도할 수 없습니다.
pt_br: 409: O recurso não pôde ser atualizado devido a um conflito, por exemplo, o recurso está sendo atualizado por duas solicitações simultâneas, portanto, é possível tentar novamente fazer a atualização mais tarde
zh_cn: 409：由于发生冲突而无法更新资源（例如，两个并发请求正在更新该资源，因此可以稍后重试更新）
zh_tw: 409：由於衝突而無法更新資源，例如，資源由兩個同時執行的要求更新，因此稍後可能會再重試更新

source: 500: Unexpected device error
de: 500: Nicht erwarteter Einheitenfehler
es: 500: Error de dispositivo inesperado
fr: 500 : Erreur inattendue du terminal
it: 500: Errore del dispositivo imprevisto
ja: 500: 予期しないデバイス・エラー
ko: 500: 예상치 못한 디바이스 오류
pt_br: 500: Erro de dispositivo inesperado
zh_cn: 500：意外的设备错误
zh_tw: 500：非預期的裝置錯誤

source: 501: Operation not implemented
de: 501: Operation nicht implementiert
es: 501: Operación no implementada
fr: 501 : Opération non mise en oeuvre
it: 501: Operazione non implementata
ja: 501: 操作が実装されていません
ko: 501: 오퍼레이션이 구현되지 않음
pt_br: 501: Operação não implementada
zh_cn: 501：未实施操作
zh_tw: 501：未實作作業
