Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/libraries/nodejs.po
Languages: es

source: Node.js for Application Developers
es: Node.js para desarrolladores de aplicaciones

source: See `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_ in GitHub
es: Consulte `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_ en GitHub

source: See the `samples for device <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_ in Github
es: Consulte los `ejemplos de dispositivos <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_ en Github.

source: See `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_ on NPM
es: Consulte `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_ en NPM

source: Application
es: Aplicación

source: *ApplicationClient* is application client for the Internet of Things Foundation service. This section contains information on how applications interact with devices.
es: *ApplicationClient* es el cliente de aplicaciones para el servicio de Internet of Things Foundation. Esta sección contiene información sobre cómo interactúan las aplicaciones con los dispositivos.

source: The constructor builds the application client instance. It accepts an configuration json containing the following :
es: El constructor crea la instancia del cliente de aplicaciones. Acepta un json de configuración que contenga lo siguiente:

source: org - Your organization ID
es: org: El ID de la organización

source: id - The unique ID of your application within your organization.
es: id: El ID exclusivo de la aplicación en la organización.

source: auth-key - API key
es: auth-key: La clave de API.

source: auth-token - API key token
es: auth-token: La señal de la clave de API.

source: type - use 'shared' to enable shared subscription
es: type: Utilice 'shared' para habilitar la suscripción compartida.

source: If you want to use quickstart, then send only the first two properties.
es: Si desea utilizar quickstart, envíe solo las dos primeras propiedades.

source: Using a configuration file
es: Utilización de un archivo de configuración

source: Instead of passing the configuration json directly, you can also use a configuration file. Use the following code snippet
es: En lugar de pasar el json de configuración directamente, puede también utilizar un archivo de configuración. Utilice el fragmento de código siguiente:

source: The configuration file must be in the format of
es: El archivo de configuración de aplicación debe estar en el formato siguiente:

source: Connecting to the IoT Platform
es: Conexión a IoT Platform

source: Connect to the IBM Watson Internet of Things Platform by calling the *connect*
es: Conéctese a IBM Watson Internet of Things Platform llamando a la función *connect*.

source: After the successful connection to the IoT Platform service, the application client sends a *connect* event. So all the logic can be implemented inside this callback function.
es: Tras una conexión correcta al servicio de IoT Platform, el cliente de aplicaciones envía un suceso *connect*. De esta forma, la lógica puede implementarse dentro de esta función de devolución de llamada.

source: The Application Client automatically tries to reconnect when it loses connection. When the reconnection is successful, the client emits *reconnect* event.
es: El cliente de aplicaciones intenta volver a conectar de forma automática cuando pierde la conexión. Cuando la reconexión se realiza correctamente, el cliente emite el suceso *reconnect*.

source: Logging
es: Registro

source: By default, all the logs of ```warn``` are logged. If you want to enable more logs, use the *log.setLevel* function. Supported log levels - *trace, debug, info, warn, error*.
es: De forma predeterminada, se registran todos los registros de ```warn```. Si desea habilitar más registros, utilice la función *log.setLevel*. Los niveles de registro soportados son *trace, debug, info, warn, error*.

source: Shared Subscription
es: Suscripción compartida

source: Use this feature to build scalable applications which will load balance messages across multiple instances of the application. To enable this, pass 'type' as 'shared' in the configuration.
es: Utilice esta característica para crear aplicaciones escalables que cargarán mensajes de equilibrio de carga en varias instancias de la aplicación. Para habilitarla, pase 'type' como 'shared' en la configuración.

source: Handling errors
es: Manejo de errores

source: When the application clients encounters an error, it emits an *error* event.
es: Cuando el cliente de aplicaciones encuentra un error, emite un suceso *error*.

source: Subscribing to device events
es: Suscripción a sucesos de dispositivo

source: Events are the mechanism by which devices publish data to the IoT Platform. The device controls the content of the event and assigns a name for each event it sends.
es: Los sucesos son el mecanismo mediante el cual los dispositivos publican datos en IoT Platform. El dispositivo controla el contenido del suceso y asigna un nombre a cada suceso que envía.

source: When an event is received by the IoT Platform, the credentials of the connection on which the event was received are used to determine from which device the event was sent. Using this architecture, it is impossible for a device to impersonate another device.
es: Cuando IoT Platform recibe un suceso, se utilizan las credenciales de la conexión en la que se ha recibido dicho suceso para determinar desde qué dispositivo se ha enviado. Cuando se utiliza esta arquitectura, es imposible que un dispositivo pueda suplantar a otro.

source: By default, applications will subscribe to all events from all connected devices. Use the type, id, event and msgFormat parameters to control the scope of the subscription. A single client can support multiple subscriptions. The code samples below give examples of how to subscribe to devices dependent on device type, id, event and msgFormat parameters.
es: De forma predeterminada, las aplicaciones se suscribirán a todos los sucesos de todos los dispositivos conectados. Utilice los parámetros type, id, event y msgFormat para controlar el alcance de la suscripción. Un cliente individual puede admitir varias suscripciones. Las muestras de código siguientes proporcionan ejemplos de cómo suscribirse a dispositivos dependientes de los parámetros type, id, event y msgFormat de dispositivo.

source: To subscribe to all events from all devices
es: Para suscribirse a todos los sucesos de todos los dispositivos

source: To subscribe to all events from all devices of a specific type
es: Para suscribirse a todos los sucesos de todos los dispositivos de un tipo específico

source: To subscribe to a specific event from all devices
es: Para suscribirse a un suceso específico de todos los dispositivos

source: To subscribe to a specific event from two or more different devices
es: Para suscribirse a un suceso específico de dos o más dispositivos diferentes

source: To subscribe to all events published by a device in json format
es: Para suscribirse a todos los sucesos publicados por un dispositivo en formato json

source: Handling events from devices
es: Manejo de sucesos de dispositivos

source: To process the events received by your subscriptions you need to implement a device event callback method. The ibmiotf application client emits the event *deviceEvent*. This function has the following properties:
es: Para procesar los sucesos recibidos por las suscripciones que necesita para implementar un método de devolución de llamada de sucesos. El cliente de aplicaciones ibmiotf emite el suceso *deviceEvent*. Esta función tiene las propiedades siguientes:

source: payload - Device event payload
es: payload - Carga útil del suceso de dispositivo

source: topic - Original topic
es: topic - Tema original

source: Subscribing to device status
es: Suscripción al estado de dispositivo

source: By default, this will subscribe to status updates for all connected devices. Use the type and id parameters to control the scope of the subscription. A single client can support multiple subscriptions.
es: De forma predeterminada, la suscripción será a las actualizaciones de estado para todos los dispositivos conectados. Utilice los parámetros type e id para controlar el alcance de la suscripción. Un cliente individual puede admitir varias suscripciones.

source: Subscribe to status updates for all devices
es: Suscribirse a actualizaciones de estado para todos los dispositivos

source: Subscribe to status updates for all devices of a specific type
es: Suscribirse a actualizaciones de estado para todos los dispositivos de un tipo específico

source: Subscribe to status updates for two different devices
es: Suscribirse a actualizaciones de estado para dos dispositivos diferentes

source: Handling status updates from devices
es: Manejo de actualizaciones de estado de dispositivos

source: To process the status updates received by your subscriptions you need to implement an device status callback method. The ibmiotf application client emits the event *deviceStatus*. This function has the following properties:
es: Para procesar las actualizaciones de estado recibidas por las suscripciones que necesita para implementar un método de devolución de llamada de estado de dispositivo. El cliente de aplicaciones ibmiotf emite el suceso *deviceStatus*. Esta función tiene las propiedades siguientes:

source: payload - Device status payload
es: payload - Carga útil del estado de dispositivo

source: Publishing events from devices
es: Publicación de sucesos desde dispositivos

source: Applications can publish events as if they originated from a Device. The function requires:
es: Las aplicaciones pueden publicar sucesos como si se originaran en un dispositivo. La función requiere:

source: Publishing commands to devices
es: Publicación de mandatos en dispositivos

source: Applications can publish commands to connected devices. The function requires:
es: Las aplicaciones pueden publicar mandatos en dispositivos conectados. La función requiere:

source: Command Type
es: Tipo de mandato

source: Disconnect Client
es: Desconectar cliente

source: Disconnects the client and releases the connections
es: Desconecta el cliente y libera las conexiones
