Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/extensions/jasper.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: Jaspers operations can be viewed or updated in the device drilldown menu for any devices which are connected to both your Internet of Things Foundation platform organization and Jasper, and have been configured as explained above. The supported Jasper operations are:
de: Jasper-Operationen können im Geräte-Drilldown-Menü für alle Geräte angezeigt oder aktualisiert werden, die sowohl mit der Organisation der Internet of Things Foundation-Plattform als auch mit Jasper verbunden sind und anhand der oben beschriebenen Schritte konfiguriert wurden. Die folgenden Jasper-Operationen werden unterstützt:
es: Las operaciones de Jasper pueden verse o actualizarse en el menú Obtener detalles de dispositivo para los dispositivos que se conectan a la organización de la plataforma de Internet of Things Foundation y Jasper, y se han configurado como se ha explicado antes. Las operaciones de Jasper soportadas son:
fr: Les opérations de Jasper peuvent être affichées ou mises à jour dans le menu d'exploration des terminaux, qui sont à la fois connectés à l'organisation de la plateforme Internet of Things Foundation et à Jasper et qui ont été configurées comme indiqué ci-dessus. Les opérations Jasper prises en charge sont les suivantes :
it: È possibile visualizzare o aggiornare le operazioni di Jasper nel menu drill down dispositivo per i dispositivi connessi sia all'organizzazione della piattaforma di Internet of Things Foundation che a Jasper e configurati come mostrato in precedenza. Le operazioni Jasper supportate sono:
ja: Internet of Things Foundation プラットフォーム組織と Jasper の両方に接続されており、前述のように構成されているデバイスでは、デバイス・ドリルダウン・メニューで Jasper 操作を表示または更新できます。サポートされている Jasper 操作を以下に示します。
ko: Internet of Things Foundation 플랫폼 조직 및 Jasper 둘 다에 연결되고 위에 설명된 대로 구성된 디바이스에 대해 디바이스 드릴다운 메뉴에서 Jasper 오퍼레이션을 보거나 업데이트할 수 있습니다. 지원되는 Jasper 오퍼레이션은 다음과 같습니다.
pt_br: As operações Jaspers podem ser visualizadas ou atualizadas no menu de drilldown de dispositivo para quaisquer dispositivos que estão conectados à organização de plataforma do Internet of Things Foundation e Jasper e foram configurados conforme explicado acima. As operações Jasper suportadas são:
zh_cn: 对于同时连接到 Internet of Things Foundation 平台组织和 Jasper，且已按照上文所述进行配置的任何设备，都可以在设备向下钻取菜单中查看或更新 Jasper 操作。支持的 Jasper 操作为：
zh_tw: Jasper 作業可在任何裝置（同時連接至 Internet of Things Foundation 平台組織和 Jasper，並且已依照前述說明進行配置）的裝置往下探查功能表中檢視或更新。支援的 Jasper 作業為：

source: View overall Jasper data - Shows: Status, Rate Plan, month-to-date data usage, month-to-date SMS usage, month-to-date voice usage, overage limits, date added, and date modified.
de: Gesamte Jasper-Daten anzeigen - Folgendes wird angezeigt: Status, Tarifplan, Datennutzung für den Monat bisher, SMS-Nutzung für den Monat bisher, Telefonnutzung für den Monat bisher, Überschreitungsgrenzwerte, Hinzufügungsdatum und Änderungsdatum.
es: Ver datos de Jasper generales - Muestra: estado, plan de tarifas, uso de datos mensual hasta la fecha, uso de SMS mensual hasta la fecha, uso de voz mensual hasta la fecha, límites de recargo, fecha añadida y fecha modificada.
fr: Afficher les données Jasper globales : Affiche le statut, le plan tarifaire, l'utilisation mensuelle des données à ce jour, l'utilisation mensuelle des SMS à ce jour, l'utilisation mensuelle de la voix à ce jour, les limites de dépassement, les dates d'ajout et les dates de modification.
it: Visualizzare i dati generali di Jasper - Mostra: stato, piano tariffario, utilizzo dei dati da inizio mese, utilizzo di SMS da inizio mese, utilizzo voce da inizio mese, limiti in eccedenza, data di aggiunta e data di modifica.
ja: 全体的な Jasper データの表示。表示されるのは、状況、料金プラン、過去 1 カ月間のデータ使用状況、過去 1 カ月間の SMS 使用状況、過去 1 カ月間のボイス使用状況、超過分制限、追加日付、および変更日付です。
ko: 전체 Jasper 데이터 보기 - 표시: 상태, 등급 플랜, 당월 합계 데이터 사용, 당월 합계 SMS 사용, 당월 합계 음성 사용, 초과 한계, 추가된 날짜 및 수정된 날짜
pt_br: Visualizar dados Jasper em geral - Exibe: Status, Plano de Taxa, uso de dados mensal, uso de SMS mensal, uso de voz mensal, limites excedentes, data de inclusão e data de modificação.
zh_cn: 查看总体 Jasper 数据 - 显示：状态、套餐、本月至今数据使用情况、本月至今 SMS 使用情况、本月至今语音使用情况、超额限制、添加日期和修改日期。
zh_tw: 檢視整體 Jasper 資料 - 顯示：狀態、費率方案、月初至今的資料使用情形、月初至今的 SMS 使用情形、月初至今的語音使用情形、超額限制、新增日期和修改日期。

source: Change SIM activation state. - Select from: Inventory, Activation Ready, Activated, Deactivated, and Retired.
de: SIM-Aktivierungsstatus ändern. - Folgendes kann ausgewählt werden: Bestand, Aktivierungsbereit, Aktiviert, Inaktiviert und Ruhezustand.
es: Cambiar el estado de activación de SIM. - Puede seleccionar: Inventario, Preparado para la activación, Activado, Desactivado y Retirado.
fr: Modifier l'état d'activation du terminal SIM. Sélectionnez : Inventory, Activation Ready, Activated, Deactivated et Retired.
it: Modificare lo stato di attivazione della SIM.- Selezionare da: inventario, attivazione pronta, attivata, disattivata e ritirata.
ja: SIM アクティベーション状態の変更。インベントリー、アクティベーション準備完了、アクティブ、非アクティブ、廃止から選択します。
ko: SIM 활성화 상태를 변경하십시오.- 선택 소스: 인벤토리, 활성화 준비, 활성화됨, 비활성화됨 및 폐기됨
pt_br: Alterar estado de ativação do SIM. - Selecione: Inventário, Ativação Pronta, Ativado, Desativado e Obsoleto.
zh_cn: 更改 SIM 激活状态。- 从以下项中选择：库存、可随时激活、已激活、已取消激活和已废弃。
zh_tw: 變更 SIM 啟動狀態。- 從下列項目中選取：庫存、啟動就緒、已啟動、已關閉、已淘汰。

source: View SIM Usage - Shows: Cycle start date, billable and total data, billable and total SMS, billable and total voice. - The cycle start date can be set using a YYYY-MM-DD format.
de: SIM-Nutzung anzeigen - Folgendes wird angezeigt: Zyklusstartdatum, abrechnungsfähige und gesamte Datennutzung, abrechnungsfähige und gesamte SMS-Nutzung, abrechnungsfähige und gesamte Telefonnutzung. - Das Zyklusstartdatum kann im JJJJ-MM-TT-Format festgelegt werden.
es: Ver uso de SIM - Muestra: fecha de inicio de ciclo, datos totales y facturables, SMS totales y facturables, voz total y facturable. - La fecha de inicio de ciclo puede establecerse utilizando un formato AAAA-MM-DD.
fr: Afficher l'utilisation du terminal SIM : Affiche la date de début du cycle, les données facturables et le total des données, les SMS facturables et le total des SMS, la voix facturable et le total pour la voix. La date de début du cycle peut être définie au format AAAA-MM-JJ.
it: Visualizzare l'utilizzo della SIM - Mostra: data di inizio del ciclo, dati totali e fatturabili, SMS totali e fatturabili, voce totale e fatturabile. - È possibile impostare la data di inizio del ciclo utilizzando un formato AAAA-MM-GG.
ja: SIM 使用状況の表示。表示されるのは、サイクル開始日、請求対象および合計データ、請求対象および合計 SMS、請求対象および合計ボイスです。サイクル開始日は YYYY-MM-DD の形式を使用して設定できます。
ko: SIM 사용 보기 - 표시: 주기 시작 날짜, 청구 가능 및 총계 데이터, 청구 가능 및 총계 SMS, 청구 가능 및 총계 음성 - 주기 시작 날짜는 YYYY-MM-DD 형식으로 설정할 수 있습니다.
pt_br: Visualize o uso do SIM - Mostra: data de início do ciclo, dados cobrável e total, SMS cobrável e total, voz cobrável e total. - A data de início do ciclo de podem ser configurados utilizando um formato DD-MM-AAAA.
zh_cn: 查看 SIM 使用情况 - 显示：周期开始日期、计费数据和数据总量、计费 SMS 和 SMS 总量、计费语音和语音总量。- 可以使用 YYYY-MM-DD 格式设定周期开始日期。
zh_tw: 檢視 SIM 使用情形 - 顯示：週期開始日期、可入帳和總計資料，可入帳和總計 SMS、可入帳和語音總計。- 週期開始日期可使用 YYYY-MM-DD 格式來設定。
