Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/extensions/jasper.po
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

source: Jasper Integration in the IBM Internet of Things Foundation platform
de: Jasper-Integration in die IBM Internet of Things Foundation-Plattform
es: Integración de Jasper con la plataforma de IBM Internet of Things Foundation
fr: Intégration de Jasper à la plateforme IBM Internet of Things Foundation
it: Integrazione con Jasper nella piattaforma IBM Internet of Things Foundation
ja: IBM Internet of Things Foundation プラットフォームでの Jasper の統合
ko: IBM Internet of Things Foundation 플랫폼의 Jasper 통합
pt_br: Integração Jasper na plataforma IBM Internet of Things Foundation
zh_cn: IBM Internet of Things Foundation 平台中的 Jasper 集成
zh_tw: IBM Internet of Things Foundation 平台中的 Jasper 整合

source: What is Jasper?
de: Was ist Jasper?
es: ¿Qué es Jasper?
fr: Présentation de Jasper
it: Cos'è Jasper?
ja: Jasper について
ko: Jasper의 개념
pt_br: O que é Jasper?
zh_cn: 什么是 Jasper？
zh_tw: 何謂 Jasper？

source: Jasper is an administration and management platform for SIM devices. Jasper has been integrated into the IBM IoT Foundation platform dashboard, making it possible to administer Jasper devices through your IoTF platform organization dashboard.
de: Jasper ist eine Verwaltungs- und Managementplattform für SIM-Geräte. Jasper wurde in das Dashboard der IBM IoT Foundation-Plattform integriert, sodass es nun möglich ist, Jasper-Geräte über das Organisationsdashboard der IoTF-Plattform zu verwalten.
es: Jasper es una plataforma de administración y gestión de dispositivos SIM. Jasper se ha integrado en el panel de control de la plataforma de IBM IoT Foundation, lo que permite administrar dispositivos Jasper utilizando el panel de control de la organización de la plataforma de IoTF.
fr: Jasper est une plateforme de gestion et d'administration des terminaux SIM. Il a été intégré au tableau de bord de la plateforme IBM IoT Foundation pour permettre l'administration de terminaux Jasper via le tableau de bord de votre organisation dans la plateforme IoTF.
it: Jasper è una piattaforma di amministrazione e gestione per i dispositivi SIM. Jasper è stato integrato al dashboard della piattaforma IBM IoT Foundation, rendendo possibile l'amministrazione dei dispositivi Jasper tramite il dashboard dell'organizzazione della piattaforma IoTF.
ja: Jasper は SIM デバイスの管理プラットフォームです。Jasper は IBM IoT Foundation プラットフォームのダッシュボードに統合されているため、IoTF プラットフォーム組織のダッシュボードを使用して、Jasper デバイスを管理できます。
ko: Jasper는 SIM 디바이스의 관리 플랫폼입니다. Jasper가 IBM IoT Foundation 플랫폼 대시보드로 통합되어, IoTF 플랫폼 조직 대시보드를 통해 Jasper 디바이스를 관리할 수 있도록 했습니다.
pt_br: Jasper é uma plataforma de administração e gerenciamento para dispositivos SIM. O Jasper foi integrado no painel da plataforma IBM IoT Foundation, tornando possível a administrar dispositivos Jasper através do painel da organização de plataforma IoTF.
zh_cn: Jasper 是一个用于 SIM 设备的管理平台。Jasper 已集成到 IBM IoT Foundation 平台仪表板中，使您可以通过 IoTF 平台组织仪表板来管理 Jasper 设备。
zh_tw: Jasper 是 SIM 裝置的系統管理和管理平台。Jasper 已整合至 IBM IoT Foundation 平台儀表板中，讓您能夠透過 IoTF 平台組織儀表板來管理 Jasper 裝置。

source: What Operations can I perform with Jasper through IoTF?
de: Welche Operationen kann ich mit Jasper durch IoTF durchführen?
es: ¿Qué operaciones puedo realizar con Jasper mediante IoTF?
fr: Quelles opérations peut-on effectuer avec Jasper via IoTF ?
it: Quali operazioni posso eseguire con Jasper tramite IoTF?
ja: IoTF を介して Jasper で実行できる操作
ko: IoTF를 통해 Jasper로 수행할 수 있는 오퍼레이션
pt_br: Quais operações podem executar com o Jasper através do IoTF?
zh_cn: 可以通过 IoTF 使用 Jasper 执行哪些操作？
zh_tw: 我可以使用 Jasper 透過 IoTF 來執行哪些作業？

source: By using the built-in Jasper functions in the Internet of Things Foundation platform dashboard, you can perform the following Jasper operations:
de: Mithilfe der integrierten Jasper-Funktionen im Dashboard der Internet of Things Foundation-Plattform können die folgenden Jasper-Operationen durchgeführt werden:
es: Utilizando las funciones de Jasper incorporadas del panel de control de la plataforma de Internet of Things Foundation, puede realizar las siguientes operaciones de Jasper:
fr: Vous pouvez effectuer les opérations Jasper suivantes à l'aide des fonctions Jasper intégrées dans le tableau de bord de la plateforme Internet of Things Foundation :
it: Utilizzando le funzioni integrate di Jasper nel dashboard della piattaforma Internet of Things Foundation, è possibile eseguire le seguenti operazioni con Jasper:
ja: Internet of Things Foundation プラットフォームのダッシュボードの組み込み Jasper 機能を使用して、以下の Jasper 操作を実行できます。
ko: Internet of Things Foundation 플랫폼 대시보드에서 기본 제공 Jasper 기능을 사용하여 다음 Jasper 오퍼레이션을 수행할 수 있습니다.
pt_br: Utilizando as funções integradas do Jasper no painel do Internet of Things Foundation plataforma, é possível executar as seguintes operações:
zh_cn: 通过使用 Internet of Things Foundation 平台仪表板中内置的 Jasper 功能，您可以执行以下 Jasper 操作：
zh_tw: 使用 Internet of Things Foundation 平台儀表板中的內建 Jasper 功能，您可以執行下列 Jasper 作業：

source: View SIM usage
de: SIM-Nutzung anzeigen
es: Ver el uso de SIM
fr: Afficher l'utilisation d'un terminal SIM
it: Visualizzare l'utilizzo della SIM
ja: SIM 使用状況の表示。
ko: SIM 사용 보기
pt_br: Visualizar o uso do SIM
zh_cn: 查看 SIM 使用情况
zh_tw: 檢視 SIM 使用情形

source: Change SIM activation state.
de: SIM-Aktivierungsstatus ändern.
es: Cambiar el estado de activación de SIM
fr: Modifier l'état d'activation d'un terminal SIM
it: Modificare lo stato di attivazione della SIM.
ja: SIM アクティベーション状態の変更。
ko: SIM 활성화 상태를 변경하십시오.
pt_br: Alterar estado de ativação do SIM.
zh_cn: 更改 SIM 激活状态。
zh_tw: 變更 SIM 啟動狀態。

source: Send SMS to SIM
de: SMS an SIM senden
es: Enviar SMS a SIM
fr: Envoyer un SMS à un terminal SIM
it: Inviare SMS alla SIM
ja: SMS から SIM への送信。
ko: SIM에 SMS 전송
pt_br: Enviar SMS para o SIM
zh_cn: 将 SMS 发送到 SIM
zh_tw: 傳送 SMS 至 SIM

source: Change rate plan
de: Tarifplan ändern
es: Cambiar el plan de tarifas
fr: Modifier le plan tarifaire
it: Modificare il piano della tariffa
ja: 料金プランの変更
ko: 등급 플랜 변경
pt_br: Alterar o plano de taxa
zh_cn: 更改套餐
zh_tw: 變更費率方案

source: These operations can be accessed in the device drilldown of a Jasper connected device after the configuration steps below are completed.
de: Auf diese Operationen kann im Geräte-Drilldown eines verbundenen Jasper-Geräts zugegriffen werden, nachdem die nachfolgend beschriebenen Konfigurationsschritte abgeschlossen sind.
es: Puede acceder a estas operaciones en el menú Obtener detalles de dispositivo de un dispositivo conectado de Jasper, una vez realizados los pasos de configuración siguientes.
fr: Ces opérations sont accessibles dans le menu d'exploration d'un terminal connecté via Jasper, après l'exécution des étapes de configuration ci-dessous.
it: È possibile accedere a queste operazioni nel drill down di un dispositivo connesso a Jasper una volta completata la procedura di configurazione riportata di seguito.
ja: 以下の構成ステップを完了すると、Jasper 接続デバイスのデバイス・ドリルダウンで上記の操作にアクセスできます。
ko: 아래의 구성 단계가 완료된 후 Jasper 연결 디바이스의 디바이스 드릴다운에서 이러한 오퍼레이션에 액세스할 수 있습니다.
pt_br: Essas operações podem ser acessadas no drill down do dispositivo de um dispositivo conectado Jasper, após as etapas de configuração a seguir serem concluídas.
zh_cn: 完成以下配置步骤后，可以在连接 Jasper 的设备的设备向下钻取中访问这些操作。
zh_tw: 這些作業將可在下列配置步驟完成後，在已連接 Jasper 的裝置中透過裝置往下探查來存取。

source: Integrating my Jasper dashboard into my IoT Foundation Dashboard
de: Jasper-Dashboard in das IoT Foundation-Dashboard integrieren
es: Integración del panel de control de Jasper en mi panel de control de IoT Foundation
fr: Intégration de votre tableau de bord Jasper à votre tableau de bord IoT Foundation
it: Integrazione del dashboard Jasper nel dashboard di IoT Foundation
ja: IoT Foundation ダッシュボードへの Jasper ダッシュボードの統合
ko: 내 IoT Foundation 대시보드에 내 Jasper 대시보드 통합
pt_br: Integrando o meu painel Jasper em meu painel IoT Foundation
zh_cn: 将 Jasper 仪表板集成到 IoT Foundation 仪表板中
zh_tw: 將我的 Jasper 儀表板整合至 IoT Foundation 儀表板

source: In order to connect your Internet of Things Foundation platform organization with your Jasper account, there are two stages of configuration which must first be performed. The first stage of configuration is Organization Configuration.
de: Damit eine Verbindung zwischen der Organisation der Internet of Things Foundation-Plattform und dem Jasper-Konto hergestellt werden kann, sind zuvor zwei Konfigurationsphasen erforderlich. Die erste Konfigurationsphase besteht aus der Organisationskonfiguration.
es: Para poder conectar la organización de la plataforma de Internet of Things Foundation con su cuenta de Jasper, primero debe ejecutar dos etapas de configuración. La primera etapa de configuración es Configuración de organización.
fr: Pour connecter votre organisation de la plateforme Internet of Things Foundation à votre compte Jasper, vous devez d'abord effectuer deux étapes de configuration. La première étape de configuration est la configuration de l'organisation.
it: Per connettere l'organizzazione della piattaforma di Internet of Things Foundation all'account Jasper, vi sono due fasi di configurazione che è necessario eseguire. La prima fase della configurazione è la Configurazione organizzazione.
ja: Internet of Things Foundation プラットフォーム組織を Jasper アカウントに接続するために、最初に実行しなければならない 2 つの構成ステージがあります。最初の構成ステージは組織構成です。
ko: Jasper 계정으로 Internet of Things Foundation 플랫폼 조직을 연결하기 위해 우선 수행되어야 하는 구성의 두 가지 단계가 있습니다. 구성의 첫 번째 단계는 조직 구성입니다.
pt_br: Para conectar a sua organização de plataforma do Internet of Things Foundation com a sua conta Jasper, há dois estágios da configuração que devem ser executados primeiro. O primeiro estágio de configuração é de Configuração da Organização.
zh_cn: 为了将 Internet of Things Foundation 平台组织与您的 Jasper 帐户进行连接，必须先执行两个配置阶段。第一个配置阶段是组织配置。
zh_tw: 若要將您的 Internet of Things Foundation 平台組織與 Jasper 帳戶相連接，必須先執行兩個配置階段。第一個配置階段是「組織配置」。

source: Organization Configuration
de: Organisationskonfiguration
es: Configuración de organización
fr: Configuration de l'organisation
it: Configurazione organizzazione
ja: 組織構成
ko: 조직 구성
pt_br: Configuração da Organização
zh_cn: 组织配置
zh_tw: 組織配置

source: To connect your Jasper account to your Internet of Things Foundation platform organization, follow these steps:
de: Führen Sie diese Schritte aus, um eine Verbindung zwischen dem Jasper-Konto und der Organisation der Internet of Things Foundation-Plattform herzustellen.
es: Para conectar la cuenta de Jasper a la organización de la plataforma de Internet of Things Foundation, siga estos pasos:
fr: Pour connecter le compte Jasper à votre organisation de la plateforme Internet of Things Foundation, procédez comme suit :
it: Per connettere l'account Jasper all'organizzazione della piattaforma Internet of Things Foundation, effettuare le seguenti operazioni:
ja: Jasper アカウントを Internet of Things Foundation プラットフォーム組織に接続するには、以下のステップを実行します。
ko: Jasper 계정을 Internet of Things Foundation 플랫폼 조직에 연결하려면 다음 단계를 따르십시오.
pt_br: Para conectar a conta Jasper em sua organização de plataforma do Internet of Things Foundation, siga estas etapas:
zh_cn: 要将您的 Jasper 帐号连接到 Internet of Things Foundation 平台组织，请遵循以下步骤：
zh_tw: 若要將您的 Jasper 帳戶連接至 Internet of Things Foundation 平台組織，請遵循下列步驟：

source: When in your Internet of Things Foundation platform dashboard, click the wrench icon on the right to open the Configuration Settings.
de: Klicken Sie im Dashboard der Internet of Things Foundation-Plattform auf das Schraubenschlüsselsymbol auf der rechten Seite, um die Konfigurationseinstellungen zu öffnen.
es: En el panel de control de la plataforma de Internet of Things Foundation, pulse el icono de llave inglesa de la derecha para abrir Valores de configuración.
fr: Lorsque vous vous trouvez dans le tableau de bord de la plateforme Internet of Things Foundation, cliquez sur l'icône en forme de clé à molette dans la partie droite pour afficher les paramètres de configuration.
it: Una volta eseguito l'accesso al dashboard della piattaforma di Internet of Things Foundation, fare clic sull'icona a forma di chiave inglese sulla destra per aprire le Impostazioni di configurazione.
ja: Internet of Things Foundation プラットフォーム・ダッシュボードで、右側にあるレンチ・アイコンをクリックし、「構成設定値」を開きます。
ko: Internet of Things Foundation 플랫폼 대시보드에서는 오른쪽의 렌치 아이콘을 클릭하여 구성 설정을 여십시오.
pt_br: Quando no painel do Internet of Things Foundation plataforma, clique no ícone de chave inglesa à direita para abrir as Definições de Configuração.
zh_cn: 如果是在 Internet of Things Foundation 平台仪表板中，请单击右侧的扳手图标来打开配置设置。
zh_tw: 在您的 Internet of Things Foundation 平台儀表板中，按一下右側的板手圖示，以開啟「配置設定」。

source: Scroll down the to the Extensions section, and set Jasper to 'On'.
de: Blättern Sie nach unten zum Abschnitt zu den Erweiterungen und aktivieren Sie die Einstellung für Jasper.
es: Desplácese hacia abajo hasta la sección Extensiones y establezca Jasper en 'Activado'.
fr: Faites défiler la page jusqu'à la section Extensions, puis associez l'option Jasper à la valeur 'Activé'.
it: Scorrere verso il basso fino alla sezione Estensioni e impostare Jasper su 'Attivo'.
ja: 「拡張 (Extensions)」セクションまでスクロールダウンし、Jasper を「オン」に設定します。
ko: 확장기능 섹션으로 화면 이동하여 Jasper를 'On'으로 설정하십시오.
pt_br: Role para baixo para a seção Extensões e configure Jasper para 'On'.
zh_cn: 向下滚动到扩展部分，并将 Jasper 设置为“开启”。
zh_tw: 向下捲動至「延伸」區段，並將 Jasper 設為「開啟」。

source: Enter your Jasper username, password, license key, and API endpoint.
de: Geben Sie Ihren Jasper-Benutzernamen, das Kennwort, den Lizenzschlüssel und den API-Endpunkt ein.
es: Especifique su nombre de usuario de Jasper, la contraseña, la clave de licencia y el punto final de API.
fr: Entrez votre nom d'utilisateur, votre mot de passe, votre clé de licence et votre noeud final d'API Jasper.
it: Immettere il nome utente, la password, la chiave della licenza e l'endpoint dell'API di Jasper.
ja: Jasper のユーザー名、パスワード、ライセンス・キー、および API エンドポイントを入力します。
ko: Jasper 사용자 이름, 비밀번호, 라이센스 키 및 API 엔드포인트를 입력하십시오.
pt_br: Insira nome de usuário, senha, chave de licença e o terminal da API do Jasper.
zh_cn: 输入您的 Jasper 用户名、密码、许可证密钥和 API 端点。
zh_tw: 輸入您的 Jasper 使用者名稱、密碼、授權金鑰和 API 端點。

source: Device Configuration
de: Gerätekonfiguration
es: Configuración del dispositivo
fr: Configuration d'un terminal
it: Configurazione dispositivo
ja: デバイス構成
ko: 디바이스 구성
pt_br: Configuração de Dispositivo
zh_cn: 设备配置
zh_tw: 裝置配置

source: Devices which are connected to both your Internet of Things Foundation platform organization and your Jasper account can be configured to display data from Jasper in the IoT Foundation platform dashboard. Jasper configuration cannot be applied as part of the Add Device process, only already connected devices can be configured with Jasper. To configure your Jasper-connected devices, follow these steps:
de: Geräte, die sowohl mit der Organisation der Internet of Things Foundation-Plattform als auch mit dem Jasper-Konto verbunden sind, können so konfiguriert werden, dass Daten aus Jasper im Dashboard der IoT Foundation-Plattform angezeigt werden. Die Jasper-Konfiguration kann nicht im Rahmen des Prozesses zum Hinzufügen von Geräten angewendet werden, nur bereits verbundene Geräte können mit Jasper konfiguriert werden. Führen Sie die folgenden Schritte aus, um die mit Jasper verbundenen Geräte zu konfigurieren:
es: Los dispositivos que se conectan a la organización de la plataforma de Internet of Things Foundation y la cuenta de Jasper pueden configurarse para mostrar datos de Jasper en el panel de control de la plataforma de IoT Foundation. La configuración de Jasper no puede aplicarse como parte del proceso Añadir dispositivo; sólo pueden configurarse con Jasper dispositivos ya conectados. Para configurar los dispositivos conectados con Jasper, siga estos pasos:
fr: Les terminaux connectés à votre organisation de la plateforme Internet of Things Foundation et à votre compte Jasper peuvent être configurés pour afficher les données de Jasper dans le tableau de bord de la plateforme IoT Foundation. La configuration de Jasper ne peut pas être appliquée lors d'une procédure d'ajout d'un terminal ; seuls les terminaux déjà connectés peuvent être configurés avec Jasper. Pour configurer des terminaux connectés via Jasper, procédez comme suit :
it: I dispositivi connessi sia all'organizzazione della piattaforma di Internet of Things Foundation che all'account Jasper possono essere configurati in modo da mostrare i dati provenienti da Jasper nel dashboard della piattaforma di IoT Foundation. La configurazione di Jasper non può essere applicata come parte del processo Aggiungi dispositivo, solo i dispositivi già connessi possono essere configurati con Jasper. Per configurare i dispositivi connessi a Jasper, eseguire le seguenti operazioni:
ja: Internet of Things Foundation プラットフォーム組織と Jasper アカウントの両方に接続されているデバイスは、IoT Foundation プラットフォームのダッシュボードで Jasper からのデータを表示するように構成できます。Jasper 構成を「デバイスの追加」プロセスの一部として適用することはできません。Jasper で構成できるのは、既に接続されているデバイスだけです。Jasper 接続デバイスを構成するには、以下の手順を実行します。
ko: Internet of Things Foundation 플랫폼 조직 및 Jasper 계정 둘 다에 연결되는 디바이스를 구성하여 IoT Foundation 플랫폼 대시보드의 Jasper에서 데이터를 표시할 수 있습니다. Jasper 구성은 디바이스 추가 프로세스의 파트로 적용될 수 없고, 이미 연결된 디바이스만 Jasper로 구성될 수 있습니다. Jasper 연결 디바이스를 구성하려면 다음 단계를 따르십시오.
pt_br: Os dispositivos que estão conectados à organização de plataforma do Internet of Things Foundation e sua conta Jasper podem ser configurados para exibir dados do Jasper no painel da plataforma IoT Foundation. A configuração do Jasper não pode ser aplicada como parte do processo Incluir Dispositivo, apenas dispositivos já conectados podem ser configurados com o Jasper. Para configurar os dispositivos conectados por Jasper, siga estas etapas:
zh_cn: 可以配置同时连接到 Internet of Things Foundation 平台组织和 Jasper 帐户的设备，以在 IoT Foundation 平台仪表板中显示 Jasper 的数据。Jasper 配置不能用作“添加设备”流程的一部分，只有已连接的设备可以配置 Jasper。要配置与 Jasper 连接的设备，请遵循以下步骤：
zh_tw: 同時連接至您的 Internet of Things Foundation 平台組織和 Jasper 帳戶的裝置，可配置成在 IoT Foundation 平台儀表板中顯示來自 Jasper 的資料。Jasper 配置無法在「新增裝置」程序中套用，只有已連接的裝置，才可進行 Jasper 配置。若要對已連接 Jasper 的裝置進行配置，請遵循下列步驟：

source: In the devices tab of your Internet of Things Foundation platform dashboard, find the Jasper-connected device to be configured.
de: Suchen Sie auf der Registerkarte 'Geräte' des Dashboards der Internet of Things Foundation-Plattform das zu konfigurierende mit Jasper verbundene Gerät.
es: En el separador Dispositivos del panel de control de la plataforma de Internet of Things Foundation, busque el dispositivo conectado con Jasper que se va a configurar.
fr: Dans l'onglet des terminaux du tableau de bord de la plateforme Internet of Things Foundation, recherchez le terminal connecté via Jasper que vous souhaitez configurer.
it: Nella scheda Dispositivi del dashboard della piattaforma Internet of Things Foundation, individuare il dispositivo connesso a Jasper da configurare.
ja: Internet of Things Foundation プラットフォームのダッシュボードのデバイス・タブで、構成する Jasper 接続デバイスを見つけます。
ko: Internet of Things Foundation 플랫폼 대시보드의 디바이스 탭에서 구성될 Jasper 연결 디바이스를 찾으십시오.
pt_br: Na guia de dispositivos do painel de plataforma do Internet of Things Foundation, localize o dispositivo conectado por Jasper a ser configurado.
zh_cn: 在 Internet of Things Foundation 平台仪表板的设备选项卡中，查找要配置的与 Jasper 连接的设备。
zh_tw: 在 Internet of Things Foundation 平台儀表板的「裝置」標籤中，尋找已連接 Jasper 而要配置的裝置。

source: Select the device to open the Device Drilldown view.
de: Wählen Sie das Gerät aus, um die Drilldown-Ansicht für Geräte zu öffnen.
es: Seleccione el dispositivo para abrir la vista Obtener detalles de dispositivo.
fr: Sélectionnez le terminal pour ouvrir la vue Exploration du terminal.
it: Selezionare il dispositivo per aprire la vista Drill down dispositivo.
ja: デバイスを選択して、「デバイス・ドリルダウン (Device Drilldown)」ビューを開きます。
ko: 디바이스 드릴다운 보기를 열 디바이스를 선택하십시오.
pt_br: Selecione o dispositivo para abrir a visualização de Drilldown do Dispositivo.
zh_cn: 选择设备以打开“设备向下钻取”视图。
zh_tw: 選取裝置，以開啟「裝置往下探查」視圖。

source: Scroll down to the 'Extension Configuration section. The extension configuration must be entered as JSON in the following format:
de: Blättern Sie nach unten zum Abschnitt zur Erweiterungskonfiguration. Die Erweiterungskonfiguration muss als JSON im folgenden Format eingegeben werden.
es: Desplácese a la sección Configuración de extensiones. La configuración de extensión debe especificarse como JSON con el siguiente formato:
fr: Faites défiler la section Configuration d'une extension. La configuration d'une extension doit être indiquée sous la forme d'un objet JSON dans le format suivant :
it: Scorrere in basso fino alla sezione 'Configurazione estensione. È necessario immettere la configurazione dell'estensione come JSON nel seguente formato:
ja: 「拡張構成 (Extension Configuration)」セクションまでスクロールダウンします。拡張構成は、以下の形式で JSON として入力する必要があります。
ko: 확장기능 구성 섹션으로 화면 이동하십시오. 확장기능 구성은 다음 형식에서 JSON으로 입력되어야 합니다.
pt_br: Role para baixo até a seção Configuração da 'Extensão. A configuração de extensão deve ser inserida como JSON no seguinte formato:
zh_cn: 向下滚动到“扩展配置”部分。必须采用以下格式作为 JSON 输入扩展配置：
zh_tw: 向下捲動至「延伸配置」區段。延伸配置必須以下列格式輸入為 JSON：

source: When this has been entered, click 'Confirm changes' to save the configuration.
de: Klicken Sie nach der Eingabe auf 'Änderungen bestätigen', um die Konfiguration zu speichern.
es: Una vez especificado, pulse 'Confirmar cambios' para guardar la configuración.
fr: Une fois ces données entrées, cliquez sur 'Confirmer les modifications' pour sauvegarder la configuration.
it: Una volta immessa, fare clic su 'Conferma modifiche' per salvare la configurazione.
ja: これを入力したら、「変更の確認」をクリックして構成を保存します。
ko: 이를 입력하면 '변경사항 확인'을 클릭하여 구성을 저장하십시오.
pt_br: Quando isso tiver sido inserido, clique em 'Confirmar alterações' para salvar a configuração.
zh_cn: 输入该项后，请单击“确认更改”保存配置。
zh_tw: 輸入此項目後，請按一下「確認變更」以儲存配置。

source: If the Organization configuration has been completed correctly, the Extensions section should now appear below the Extensions Configuration section in the Device Drilldown.
de: Wenn die Organisationskonfiguration korrekt durchgeführt wurde, wird der Abschnitt zu den Erweiterungen nun unterhalb des Abschnitts zur Erweiterungskonfiguration im Geräte-Drilldown angezeigt.
es: Si la Configuración de organización se ha realizado satisfactoriamente, la sección Extensiones debe aparecer ahora debajo de la sección Configuración de extensiones en el menú Obtener detalles de dispositivo.
fr: Si la configuration de l'organisation a été effectuée correctement, la section Extensions doit maintenant apparaître sous la section Configuration d'une extension de la vue Exploration du terminal.
it: Se la configurazione dell'organizzazione è stata completata correttamente, la sezione Estensioni dovrebbe essere visualizzata sotto alla sezione Configurazione dell'estensione nel drill down del dispositivo.
ja: 組織構成が正しく完了していると、「デバイス・ドリルダウン (Device Drilldown)」の「拡張構成 (Extensions Configuration)」セクションの下に「拡張 (Extensions)」セクションが表示されているはずです。
ko: 조직 구성이 올바르게 완료된 경우 이제 확장기능 섹션이 디바이스 드릴다운에서 확장기능 구성 섹션 아래에 나타나야 합니다.
pt_br: Se a configuração da Organização tiver sido concluída corretamente, a seção Extensões deve agora aparecer abaixo da seção Configuração das Extensões no Drilldown de dispositivo.
zh_cn: 如果组织配置已正确完成，扩展部分现在应显示在“设备向下钻取”中的“扩展配置”部分下。
zh_tw: 如果「組織」配置已正確完成，「延伸」區段此時應會出現在「裝置往下探查」中的「延伸配置」區段下。

source: Operations
de: Operationen
es: Operaciones
fr: Opérations
it: Operazioni
ja: 操作
ko: 오퍼레이션
pt_br: Operações
zh_cn: 操作
zh_tw: 作業
