Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/custom_actions.po
Languages: es, fr, ko

source: Some company manufactures ``exampleDeviceType`` devices. Users of these devices have the ability to manage plug-ins which run on the devices. To facilitate remote management of plug-ins on ``exampleDeviceType`` devices, the manufacturer provides a device management extension which users can import into their Watson IoT Platform organization.
es: Una empresa fabrica dispositivos ``exampleDeviceType``. Los usuarios de estos dispositivos tienen la capacidad de gestionar los plug-ins que se ejecutan en los dispositivos. Para facilitar la gestión remota de los plug-ins en los dispositivos ``exampleDeviceType``, el fabricante proporciona una extensión de gestión de dispositivo que los usuarios pueden importar a su organización de Watson IoT Platform.
fr: Certaines sociétés fabriquent des terminaux ``exampleDeviceType``. Les utilisateurs de ces terminaux peuvent gérer les plug-in qui s'exécutent sur les terminaux. Pour faciliter la gestion distante des plug-in sur les terminaux ``exampleDeviceType``, le fabricant fournit une extension de gestion des terminaux que les utilisateurs peuvent importer dans leur organisation Watson IoT Platform.
ko: 일부 회사는 ``exampleDeviceType`` 디바이스를 제조합니다. 해당 디바이스의 사용자는 디바이스에서 실행하는 플러그인을 관리할 수 있는 기능을 가지고 있습니다. ``exampleDeviceType`` 디바이스에서 플러그인의 원격 관리를 쉽게 사용하도록 제조업체는 사용자의 Watson IoT Platform 조직으로 가져올 수 있는 디바이스 관리 확장을 제공합니다.

source: The extension JSON document used in this example:
es: El documento JSON de extensión utilizado en este ejemplo:
fr: Document JSON d'extension utilisé dans cet exemple :
ko: 이 예제에 사용된 확장 JSON 문서:

source: In this device management extension package, 4 actions are defined:
es: En este paquete de extensión de gestión de dispositivos, se definen 4 acciones:
fr: Quatre actions sont définies dans ce package d'extension de gestion des terminaux :
ko: 이 디바이스 관리 확장 패키지에 4개의 조치가 정의됩니다.

source: The extension is added using the REST API:
es: La extensión se añade utilizando la API REST:
fr: L'extension est ajoutée à l'aide de l'API REST :
ko: REST API를 사용하여 확장이 추가됩니다.

source: Devices registered in organization ``<orgId>`` are now able to specify that they support ``exampleDeviceType-actions-v1`` actions when publishing a manage request.
es: Los dispositivos registrados en la organización ``<orgId>`` pueden ahora especificar que soportan las acciones ``exampleDeviceType-actions-v1`` al publicar una solicitud de gestión.
fr: Les terminaux enregistrés dans l'organisation ``<IDorg>`` peuvent désormais spécifier qu'ils prennent en charge les actions ``exampleDeviceType-actions-v1`` lors de la publication d'une demande de gestion.
ko: ``<orgId>`` 조직에 등록된 디바이스는 이제 관리 요청 공개 시 디바이스가 ``exampleDeviceType-actions-v1`` 조치를 지원한다고 지정할 수 있습니다.

source: In this example, the manage request sent by a device would look like this:
es: En este ejemplo, la solicitud de gestión enviada por un dispositivo debe tener este aspecto:
fr: Dans cet exemple, la demande de gestion envoyée par un terminal est similaire à la demande suivante :
ko: 이 예제에서 디바이스가 전송한 관리 요청은 다음과 유사합니다.

source: The device should then receive the following response from the IoT Platform:
es: Entonces el dispositivo recibirá la siguiente respuesta de IoT Platform:
fr: Ensuite, le terminal reçoit la réponse suivante d'IoT Platform :
ko: 디바이스는 IoT Platform에서 다음과 같은 응답을 수신해야 합니다.

source: At this point, an action defined in the ``exampleIoT-exampleDeviceType-v1`` extension can be initiated against some devices.
es: En este punto, se puede iniciar una acción definida en la extensión ``exampleIoT-exampleDeviceType-v1`` para algunos dispositivos.
fr: A ce stade, une action définie dans l'extension ``exampleIoT-exampleDeviceType-v1`` peut être initiée sur certains terminaux.
ko: 현재 ``exampleIoT-exampleDeviceType-v1`` 확장에 정의되어 있는 조치는 일부 디바이스에 대해 시작할 수 있습니다.

source: The payload for initiating an ``installPlugin`` action will look like the following:
es: La carga útil para iniciar una acción ``installPlugin`` tendrá el aspecto siguiente:
fr: Le contenu pour l'initiation d'une action ``installPlugin`` est similaire à l'exemple suivant :
ko: ``installPlugin`` 조치를 시작하기 위한 페이로드는 다음과 유사합니다.

source: The request is initiated using the REST API:
es: La solicitud se inicia utilizando la API REST:
fr: La demande est initiée à l'aide de l'API REST :
ko: REST API를 사용하여 요청이 시작됩니다.

source: Devices ``device0`` and ``device1`` of type ``exampleDeviceType`` will then receive the following MQTT message:
es: Los dispositivos ``device0`` y ``device1`` del tipo ``exampleDeviceType`` recibirán entonces el siguiente mensaje de MQTT:
fr: Les terminaux ``device0`` et ``device1`` de type ``exampleDeviceType`` reçoivent ensuite le message MQTT suivant :
ko: ``exampleDeviceType`` 유형의 디바이스 ``device0`` 및 ``device1``은 다음 MQTT 메시지를 수신합니다.

source: Each device will take action on the message, installing the new plug-in. Once installation is complete, the devices respond with the following message to indicate that the action completed successfully:
es: Cada dispositivo actuará en el mensaje, instalando el nuevo plug-in. Una vez que se haya completado la instalación, los dispositivos responderán con el mensaje siguiente para indicar que la acción se ha completado satisfactoriamente:
fr: Chaque terminal effectue une action suite au message et installe le nouveau plug-in. Une fois l'installation terminée, les terminaux répondent avec le message suivant afin d'indiquer que l'action a abouti :
ko: 각 디바이스는 메시지에 대한 조치로서 새 플러그인을 설치합니다. 설치가 완료되면, 디바이스는 조치가 완료되었음을 표시하는 다음 메시지로 응답합니다.

source: At this point, the ``installPlugin`` action is now complete.
es: En este punto, la acción ``installPlugin`` ya se ha completado.
fr: A ce stade, l'action ``installPlugin`` a abouti.
ko: 현재 ``installPlugin`` 조치가 완료되었습니다.

source: API Examples
es: Ejemplos de API
fr: Exemples d'API
ko: API 예제

source: The following are examples of API requests that may be useful when performing device management actions:
es: A continuación se muestran ejemplos de solicitudes de API que pueden ser útiles al realizar acciones de gestión de dispositivos:
fr: Voici des exemples de demandes d'API pouvant être utiles lors de l'exécution d'actions de gestion des terminaux :
ko: 다음은 디바이스 관리 조치를 수행하는 경우 유용할 수 있는 API 요청의 예제입니다.

source: Create a new device management extension:
es: Crear una nueva extensión de gestión de dispositivos:
fr: Créez une extension de gestion des terminaux :
ko: 새 디바이스 관리 확장 작성:

source: ``curl -XPOST -d '<insert payload here>' -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``
es: ``curl -XPOST -d '<insertar carga útil aquí>' -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``
fr: ``curl -XPOST -d '<insérer le contenu ici>' -H "Content-Type: application/json" -u "<cléApi>:<jetonApi>" https://<IDorg>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``
ko: ``curl -XPOST -d '<여기에 페이로드 삽입>' -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``

source: List device management extensions:
es: Listar extensiones de gestión de dispositivos:
fr: Répertoriez les extensions de gestion des terminaux :
ko: 디바이스 관리 확장 목록:

source: ``curl -XGET -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``
fr: ``curl -XGET -H "Content-Type: application/json" -u "<cléApi>:<jetonApi>" https://<IDorg>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``

source: Initiate a device management request:
es: Iniciar una solicitud de gestión de dispositivos:
fr: Initiez une demande de gestion des terminaux :
ko: 디바이스 관리 요청 시작:

source: ``curl -XPOST -d '<insert payload here>' -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests``
es: ``curl -XPOST -d '<insertar carga útil aquí>' -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests``
fr: ``curl -XPOST -d '<insérer le contenu ici>' -H "Content-Type: application/json" -u "<cléApi>:<jetonApi>" https://<IDorg>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests``
ko: ``curl -XPOST -d '<여기에 페이로드 삽입>' -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests``

source: List in-progress or completed device management requests:
es: Listar solicitudes de gestión de dispositivos en curso o completadas:
fr: Répertoriez les demandes de gestion des terminaux en cours ou terminées :
ko: 진행 중이거나 완료된 디바이스 관리 요청 목록:

source: ``curl -XGET -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests``
fr: ``curl -XGET -H "Content-Type: application/json" -u "<cléApi>:<jetonApi>" https://<IDorg>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests``

source: View status of a particular device management request:
es: Ver el estado de un solicitud de gestión de dispositivo determinada:
fr: Affichez le statut d'une demande de gestion des terminaux particulière :
ko: 특정 디바이스 관리 요청의 상태 보기:

source: ``curl -XGET -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests/<requestId>``
fr: ``curl -XGET -H "Content-Type: application/json" -u "<cléApi>:<jetonApi>" https://<IDorg>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests/<IDdemande>``
