Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/custom_actions.po
Languages: es, fr, ko

source: Extending Device Management
es: Ampliación de gestión de dispositivos
fr: Extension de la gestion des terminaux
ko: 디바이스 관리 확장

source: This feature is currently available as part of a limited beta. Future updates may include changes incompatible with the current version of this feature. Try it out and `let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
es: Esta característica está disponible actualmente como parte de una versión beta limitada. Las actualizaciones futuras podrían incluir cambios incompatibles con la versión actual de esta característica. Pruébela y `denos su opinión <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
fr: Cette fonction est actuellement disponible dans le cadre d'une version bêta limitée. Il se peut que de futures mises à jour incluent des modifications incompatibles avec la version actuelle de cette fonction. Essayez-la et `faites-nous part de vos commentaires sur la page <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
ko: 이 기능은 현재 제한된 베타의 일부로 제공됩니다. 추가 업데이트에는 이 기능의 현재 버전과 호환되지 않는 변경사항이 포함될 수 있습니다. 이 기능을 사용해 본 후 `의견을 알려주십시오 <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_.

source: The IBM Watson IoT Platform provides the ability to extend the device management capabilities. This is done by adding device management extensions using either the REST APIs or the IoT Platform dashboard.
es: IBM Watson IoT Platform proporciona la posibilidad de ampliar las prestaciones de gestión de dispositivos. Esto se realiza añadiendo extensiones de gestión de dispositivos utilizando las API REST o el panel de control de IoT Platform.
fr: IBM Watson IoT Platform permet d'étendre les fonctions de gestion des terminaux via l'ajout d'extension de gestion des terminaux à l'aide des API REST ou du tableau de bord d'IoT Platform.
ko: IBM Watson IoT Platform은 디바이스 관리 기능을 확장합니다. 확장성은 REST API 또는 IoT Platform 대시보드 중 하나를 사용하여 디바이스 관리 확장 기능을 추가하는 방식으로 구현됩니다.

source: Devices which connect to the IoT Platform may have a wide range of capabilities. The device management actions supported by default in the IoT Platform (*device reboot*, *factory reset*, *firmware download* and *firmware update*) may not be sufficient to manage everything which a device can do.
es: Los dispositivos que se conectan a IoT Platform pueden tener un amplio rango de prestaciones. Es posible que las acciones de gestión de dispositivos soportadas de forma predeterminada en IoT Platform (*device reboot*, *factory reset*, *firmware download* y *firmware update*) no sean suficientes para gestionar todo lo que puede hacer un dispositivo.
fr: Les terminaux qui se connectent à IoT Platform peuvent mettre à disposition un large éventail de fonctions. Il se peut que les actions de gestion des terminaux prises en charge par défaut dans IoT Platform (*réamorçage du terminal*, *réinitialisation des paramètres d'usine*, *téléchargement du microprogramme* et *mise à jour du microprogramme*) ne suffisent pas pour gérer toutes les opérations qu'un terminal peut effectuer.
ko: IoT Platform에 연결하는 디바이스는 다양한 기능을 가질 수 있습니다. 기본적으로 IoT Platform에서 지원되는 디바이스 관리 조치(*디바이스 다시 부팅*, *팩토리 재설정*, *펌웨어 다운로드* 및 *펌웨어 업데이트*)는 디바이스에서 수행할 수 있는 모든 작업을 관리하기에 충분하지 않을 수 있습니다.

source: Device Management Extension Packages
es: Paquetes de extensión de gestión de dispositivos
fr: Packages d'extension de la gestion des terminaux
ko: 디바이스 관리 확장 패키지

source: An extension package is a JSON document which defines a set of device management actions. The actions can be initiated against one or more devices which support those actions. The actions are initiated in the same way as the default device management actions by using either the IoT Platform dashboard or the device management REST APIs.
es: Un paquete de extensión es un documento JSON que define un conjunto de acciones de gestión de dispositivos. Las acciones se pueden iniciar para uno o más dispositivos que soporten dichas acciones. Las acciones se inician de la misma manera que las acciones de gestión de dispositivos predeterminadas utilizando el panel de control de IoT Platform o las API REST de gestión de dispositivos.
fr: Un package d'extension est un document JSON qui définit un ensemble d'actions de gestion des terminaux. Les actions peuvent être initiées sur un ou plusieurs terminaux les prenant en charge. Elles le sont de la même façon que les actions de gestion des terminaux par défaut, dans le tableau de bord IoT Platform ou à l'aide des API REST de gestion des terminaux.
ko: 확장 패키지는 디바이스 관리 조치 세트를 정의하는 JSON 문서입니다. 이러한 조치를 지원하는 하나 이상의 디바이스에 대해 조치를 시작할 수 있습니다. 조치는 IoT Platform 대시보드 또는 디바이스 관리 REST API 중 하나를 사용하여 기본 디바이스 관리 조치와 동일한 방법으로 시작됩니다.

source: Device management extension packages have the following format:
es: Los paquetes de extensión de gestión de dispositivos tienen el formato siguiente:
fr: Le format des packages d'extension de gestion des terminaux est le suivant :
ko: 디바이스 관리 확장 패키지에 포함된 형식은 다음과 같습니다.

source: Extension Package Properties:
es: Propiedades de paquete de extensión:
fr: Propriétés de package d'extension :
ko: 확장 패키지 특성:

source: ``bundleId``: Unique identifier for a device management extension. Required.
es: ``bundleId``: Identificador exclusivo para una extensión de gestión de dispositivo. Necesario.
fr: ``bundleId`` : identificateur unique d'une extension de gestion des terminaux. Requis.
ko: ``bundleId``: 디바이스 관리 확장에 대한 고유 ID입니다. 필수입니다.

source: ``version``: Version string for a device management extension. Optional.
es: ``version``: Serie de versión para una extensión de gestión de dispositivo. Opcional.
fr: ``version`` : chaîne de version d'une extension de gestion des terminaux. Facultatif.
ko: ``version``: 디바이스 관리 확장에 대한 버전 문자열입니다. 선택사항입니다.

source: ``provider``: Provider string for a device management extension. Maximum length of 1024 characters. Optional.
es: ``provider``: Serie de proveedor para una extensión de gestión de dispositivos. Longitud máxima de 1024 caracteres. Opcional.
fr: ``provider`` : chaîne de fournisseur d'une extension de gestion des terminaux. La valeur ne peut pas comporter plus de 1024 caractères. Facultatif.
ko: ``provider``: 디바이스 관리 확장에 대한 제공업체 문자열입니다. 최대 길이 1024자입니다. 선택사항입니다.

source: ``displayName``: Map of ``locale``: ``String`` key-value pairs used for display in the IoT Platform dashboard. Required. Must contain at least one entry.
es: ``displayName``: Mapa de pares clave-valor ``locale``: ``String`` utilizados para visualizarse en el panel de control IoT Platform. Necesario. Debe contener como mínimo una entrada.
fr: ``displayName`` : mappe de paires clé-valeur ``locale``:``String`` utilisée à des fins d'affichage dans le tableau de bord d'IoT Platform. Requis. Doit contenir au moins une entrée.
ko: ``displayName``: IoT Platform 대시보드 표시에 사용되는 ``locale``: ``String`` 키-값 쌍의 맵핑입니다. 필수입니다. 하나 이상의 항목을 포함해야 합니다.

source: ``description``: Map of ``locale``: ``String`` key-value pairs used for display in the IoT Platform dashboard. Optional. If specified, must contain at least one entry.
es: ``description``: Mapa de pares clave-valor ``locale``: ``String`` utilizados para visualizarse en el panel de control de IoT Platform. Opcional. Si se especifica, debe contener al menos una entrada.
fr: ``description`` : mappe de paires clé-valeur ``locale``:``String`` utilisée à des fins d'affichage dans le tableau de bord d'IoT Platform. Facultatif. Si spécifiée, doit contenir au moins une entrée.
ko: ``description``: IoT Platform 대시보드 표시에 사용되는 ``locale``: ``String`` 키-값 쌍의 맵핑입니다. 선택사항입니다. 지정하는 경우 하나 이상의 항목을 포함해야 합니다.

source: ``actions``: Map of ``actionId``: ``<action>`` key-value pairs which defines the actions contained within a device management extension. Required. Must contain at least one entry.
es: ``actions``: Mapa de pares clave-valor ``actionId``: ``<action>`` que define las acciones contenidas en una extensión de gestión de dispositivos. Necesario. Debe contener como mínimo una entrada.
fr: ``actions`` : mappe de paires clé-valeur ``actionId``:``<action>`` qui définit les actions contenues dans une extension de gestion des terminaux. Requis. Doit contenir au moins une entrée.
ko: ``actions``: 디바이스 관리 확장 내에 포함된 조치를 정의하는 ``actionId``: ``<action>`` 키-값 쌍의 맵핑입니다. 필수입니다. 하나 이상의 항목을 포함해야 합니다.

source: Properties per action:
es: Propiedades por acción:
fr: Propriétés par action :
ko: 조치별 특성:

source: ``actionDisplayName``: Map of ``locale``: ``String`` key-value pairs used for display in the IoT Platform dashboard. Required. Must contain at least one entry.
es: ``actionDisplayName``: Mapa de pares clave-valor ``locale``: ``String`` utilizados para visualizarse en el panel de control de IoT Platform. Necesario. Debe contener como mínimo una entrada.
fr: ``actionDisplayName`` : mappe de paires clé-valeur ``locale``:``String`` utilisée à des fins d'affichage dans le tableau de bord d'IoT Platform. Requis. Doit contenir au moins une entrée.
ko: ``actionDisplayName``: IoT Platform 대시보드 표시에 사용되는 ``locale``: ``String`` 키-값 쌍의 맵핑입니다. 필수입니다. 하나 이상의 항목을 포함해야 합니다.

source: ``description``: Map of ``locale``: ``String`` key-value pairs used for display in the IoT Platform dashboard. Optional. If specified, must contain at least one entry.
es: ``description``: Mapa de pares clave-valor ``locale``: ``String`` utilizados para visualizarse en el panel de control de IoT Platform. Opcional. Si se especifica, debe contener al menos una entrada.
fr: ``description`` : mappe de paires clé-valeur ``locale``:``String`` utilisée à des fins d'affichage dans le tableau de bord d'IoT Platform. Facultatif. Si spécifiée, doit contenir au moins une entrée.
ko: ``description``: IoT Platform 대시보드 표시에 사용되는 ``locale``: ``String`` 키-값 쌍의 맵핑입니다. 선택사항입니다. 지정하는 경우 하나 이상의 항목을 포함해야 합니다.

source: ``parameters``: Array of parameters allowed for a particular action. Optional. If specified, must contain at least one entry.
es: ``parameters``: Matriz de parámetros permitidos para una acción determinada. Opcional. Si se especifica, debe contener al menos una entrada.
fr: ``parameters`` : tableau de paramètres autorisés pour une action particulière. Facultatif. Si spécifié, doit contenir au moins une entrée.
ko: ``parameters``: 특정 조치에 허용된 매개변수의 배열입니다. 선택사항입니다. 지정하는 경우 하나 이상의 항목을 포함해야 합니다.

source: Properties per action parameter:
es: Propiedades por parámetro de acción:
fr: Propriétés par paramètre d'action :
ko: 조치 매개변수별 특성:

source: ``name``: Unique identifier for a parameter within an action. Required.
es: ``name``: Identificador exclusivo para un parámetro en una acción. Necesario.
fr: ``name`` : identificateur unique d'un paramètre dans une action. Requis.
ko: ``name``: 조치 내의 매개변수에 대한 고유 ID입니다. 필수입니다.

source: ``value``: Regular expression used for validating parameter values when a request is initiated. Optional. If not specified, value will not be validated.
es: ``value``: Expresión regular utilizada para validar valores de parámetro cuando se inicia una solicitud. Opcional. Si no se especifica, el valor no se validará.
fr: ``value`` : expression régulière pour la validation des valeurs de paramètre lorsqu'une demande est initiée. Facultatif. Si elle n'est pas spécifiée, la valeur n'est pas validée.
ko: ``value``: 요청이 시작되는 경우 매개변수 값을 검증하는 데 사용되는 정규식입니다. 선택사항입니다. 지정되지 않은 경우 값이 검증되지 않습니다.

source: ``required``: Boolean value specifying whether the parameter is required. Optional. Default: False
es: ``required``: Valor booleano que especifica si el parámetro es necesario. Opcional. Valor predeterminado: False
fr: ``required`` : valeur booléenne qui indique si le paramètre est requis. Facultatif. Valeur par défaut : False.
ko: ``required``: 매개변수가 필수인지 지정하는 부울 값입니다. 선택사항입니다. 기본값: False

source: ``defaultValue``: Value to be used if the parameter is not provided when a request is initiated. Optional.
es: ``defaultValue``: Valor a utilizar si no se proporciona el parámetro cuando se inicia una solicitud. Opcional.
fr: ``defaultValue`` : valeur à utiliser si le paramètre n'est pas fourni lorsqu'une demande est initiée. Facultatif.
ko: ``defaultValue``: 요청이 시작될 때 매개변수가 제공되지 않는 경우 사용될 값입니다. 선택사항입니다.

source: The ``bundleId``, ``version``, ``actionId`` and ``parameterId`` values have the following restrictions:
es: Los valores de ``bundleId``, ``version``, ``actionId`` y ``parameterId`` tienen las restricciones siguientes:
fr: Les valeurs de ``bundleId``, ``version``, ``actionId`` et ``parameterId`` présentent les restrictions suivantes :
ko: ``bundleId``, ``version``, ``actionId`` 및 ``parameterId`` 값에 다음 제한사항이 적용됩니다.

source: Maximum length of 255 characters
es: Longitud máxima de 255 caracteres
fr: Longueur maximale de 255 caractères
ko: 최대 길이 255자

source: Must comprise only alpha-numeric characters (a-z, A-Z, 0-9) and the following special characters:
es: Debe constar sólo de caracteres alfanuméricos (a-z, A-Z, 0-9) y de los siguientes caracteres especiales:
fr: Elles ne peuvent comporter que des caractères alphanumériques (a à z, A à Z, 0 à 9) et les caractères spéciaux suivants :
ko: 영숫자 문자(a-z, A-Z, 0-9) 및 다음 특수 문자만 포함해야 함:

source: dash (-)
es: guión (-)
fr: Le trait d'union (-)
ko: 대시(-)

source: underscore (_)
es: subrayado (_)
fr: Le trait de soulignement (_)
ko: 밑줄(_)

source: dot (.)
es: punto (.)
fr: Le point (.)
ko: 점(.)

source: Extension packages are managed in the IoT Platform using the following REST APIs.
es: Los paquetes de extensión se gestionan en IoT Platform utilizando las siguientes API REST.
fr: Les packages d'extension sont gérés dans IoT Platform à l'aide des API REST ci-dessous.
ko: 확장 패키지는 IoT Platform에서 다음 REST API를 사용하여 관리됩니다.

source: List all device management extension packages:
es: Listar todos los paquetes de extensión de gestión de dispositivos:
fr: Répertoriez tous les packages d'extension de gestion des terminaux :
ko: 모든 디바이스 관리 확장 패키지 목록:

source: ``GET https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``
fr: ``GET https://<IDorg>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``

source: Create a new device management extension package:
es: Crear un nuevo paquete de extensión de gestión de dispositivos:
fr: Créez un package d'extension de gestion des terminaux :
ko: 새 디바이스 관리 확장 패키지 작성:

source: ``POST https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``
fr: ``POST https://<IDorg>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``

source: Get a specific device management extension package:
es: Obtener un paquete de extensión de gestión de dispositivos específico:
fr: Obtenez un package d'extension de gestion des terminaux spécifique :
ko: 특정 디바이스 관리 확장 패키지 가져오기:

source: ``GET https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle/{bundleId}``
fr: ``GET https://<IDorg>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle/{bundleId}``

source: Update a device management extension package:
es: Actualizar un paquete de extensión de gestión de dispositivos:
fr: Mettez à jour un package d'extension de gestion des terminaux :
ko: 디바이스 관리 확장 패키지 업데이트:

source: ``PUT https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle/{bundleId}``
fr: ``PUT https://<IDorg>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle/{bundleId}``

source: Delete a device management extension package:
es: Suprimir un paquete de extensión de gestión de dispositivos:
fr: Supprimez un package d'extension de gestion des terminaux :
ko: 디바이스 관리 확장 패키지 삭제:

source: ``DELETE https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle/{bundleId}``
fr: ``DELETE https://<IDorg>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle/{bundleId}``

source: For more information on the REST APIs for device management extension packages refer to the `version 2 API documentation <../../swagger/v0002.html>`_.
es: Para obtener más información sobre las API REST para paquetes de extensión de gestión de dispositivos, consulte la `documentación de API de la versión 2 <../../swagger/v0002.html>`_.
fr: Pour plus d'informations sur les API REST pour les packages d'extension de gestion des terminaux, voir la `documentation sur les API de version 2 <../../swagger/v0002.html>`_.
ko: 디바이스 관리 확장 패키지에 대한 REST API의 자세한 정보는 `버전 2 API 문서 <../../swagger/v0002.html>`_을 참조하십시오.

source: Supporting Custom Device Management Actions
es: Soporte de acciones de gestión de dispositivos personalizadas
fr: Prise en charge d'actions de gestion des terminaux personnalisées
ko: 사용자 정의 디바이스 관리 조치 지원

source: Device management actions defined in an extension package may only be initiated against devices which support those actions. A device specifies what types of actions it supports when it publishes a manage request to the IoT Platform. In order to allow a device to receive custom actions defined in a particular extension package, the device must specify that extension's bundle identifier in the supports object when publishing a manage request.
es: Las acciones de gestión de dispositivos definidas en un paquete de extensión sólo se pueden iniciar para dispositivos que soporten esas acciones. In dispositivo especifica qué tipos de acciones soporta cuando publica una solicitud de gestión a IoT Platform. Para permitir que un dispositivo reciba acciones personalizadas definidas en un paquete de extensión específico, el dispositivo debe especificar el identificador de paquete de esa extensión en el objeto de soporte al publicar una solicitud de gestión.
fr: Les actions de gestion des terminaux définies dans un package d'extension ne peuvent être initiées que sur les terminaux les prenant en charge. Un terminal spécifie les types d'action qu'il prend en charge lorsqu'il publie une demande de gestion dans IoT Platform. Pour qu'un terminal puisse recevoir des actions personnalisées définies dans un package d'extension particulier, il doit spécifier l'identificateur de bundle de cette extension dans l'objet des prises en charge (supports) lors de la publication d'une demande de gestion.
ko: 확장 패키지에 정의되어 있는 디바이스 관리 조치는 이러한 조치를 지원하는 디바이스에 대해서만 시작할 수 있습니다. IoT Platform에 관리 요청 공개 시 디바이스는 지원하는 조치의 유형을 지정합니다. 디바이스에서 특정 확장 패키지에 정의된 사용자 정의 조치를 수신하도록 허용하려면, 관리 요청을 공개할 때 디바이스가 해당 확장의 번들 ID를 지원 오브젝트에 지정해야 합니다.

source: For additional information about device manage requests, refer to `Device Management Protocol <index.html>`__.
es: Para obtener información adicional sobre solicitudes de gestión de dispositivos, consulte `Protocolo de gestión de dispositivos <index.html>`__.
fr: Pour des informations supplémentaires sur les demandes de gestion des terminaux, voir le `protocole de gestion des terminaux <index.html>`__.
ko: 디바이스 관리 요청에 대한 자세한 정보는 `디바이스 관리 프로토콜 <index.html>`__을 참조하십시오.

source: Initiating Custom Device Management Actions
es: Inicio de acciones de gestión de dispositivos personalizadas
fr: Initiation d'actions de gestion des terminaux personnalisées
ko: 사용자 정의 디바이스 관리 조치 시작

source: Custom device management actions are initiated using the same REST API as the default device management actions:
es: Las acciones de gestión de dispositivos personalizadas se inician utilizando la misma API REST que las acciones de gestión de dispositivos predeterminadas:
fr: Les actions de gestion des terminaux personnalisées sont initiées avec la même API REST que les actions de gestion des terminaux par défaut :
ko: 사용자 정의 디바이스 관리 조치는 기본 디바이스 관리 조치와 동일한 REST API를 사용하여 시작됩니다.

source: ``POST https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests``
fr: ``POST https://<IDorg>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests``

source: The following information must be provided when initiating a request:
es: Se debe proporcionar la información siguiente al iniciar una solicitud:
fr: Les informations suivantes doivent être fournies lors de l'initiation d'une demande :
ko: 요청을 시작할 때 다음 정보를 제공해야 합니다.

source: The action ``<bundleId>/<actionId>``
es: La acción ``<bundleId>/<actionId>``
fr: L'action ``<IDbundle>/<IDaction>``
ko: 조치 ``<bundleId>/<actionId>``

source: A list of devices to initiate the action against, with a maximum of 5000 devices
es: Una lista de dispositivos para los que iniciar la acción, con un máximo de 5000 dispositivos
fr: La liste des terminaux sur lesquels initier l'action (5000 maximum)
ko: 최대 5000개의 디바이스를 포함해 조치를 시작할 디바이스의 목록

source: A list of parameters as defined in the custom action definition
es: Una lista de parámetros tal como se han definido en la definición de acción personalizada
fr: La liste des paramètres définis dans la définition de l'action personnalisée
ko: 사용자 정의 조치 정의에 정의되어 있는 매개변수의 목록

source: The payload for initiating a request has the following format:
es: La carga útil para iniciar una solicitud tiene el formato siguiente:
fr: Le format du contenu pour l'initiation d'une demande est le suivant :
ko: 요청을 시작하기 위한 페이로드에 포함된 형식은 다음과 같습니다.

source: Handling Custom Device Management Actions
es: Manejo de acciones de gestión de dispositivos personalizadas
fr: Traitement des actions de gestion des terminaux personnalisées
ko: 사용자 정의 디바이스 관리 조치 처리

source: When a custom action is initiated against a device, an MQTT message will be published to the device. The message will contain any parameters that were specified as part of the request. When the device receives this message, it is expected to either execute the action or respond with an error code indicating that it cannot complete the action at this time.
es: Cuando se inicia una acción personalizada para un dispositivo, se publica un mensaje MQTT en el dispositivo. El mensaje contendrá los parámetros especificados como parte de la solicitud. Cuando el dispositivo recibe este mensaje, se espera que ejecute la acción o responda con un código de error indicando que no puede completar la acción en este momento.
fr: Lorsqu'une action personnalisée est initiée sur un terminal, un message MQTT est publié sur ce terminal. Le message contient les paramètres qui ont été spécifiés dans le cadre de la demande. Lorsque le terminal le reçoit, il doit exécuter l'action ou renvoyer un code d'erreur indiquant qu'il ne peut pas exécuter l'action à ce stade.
ko: 사용자 정의 조치가 디바이스에 대해 시작되면 MQTT 메시지가 디바이스로 공개됩니다. 메시지에는 요청의 일부로 지정된 매개변수가 포함됩니다. 디바이스가 이 메시지를 수신하면, 조치를 실행하거나 지금은 조치를 완료할 수 없다는 오류 코드와 함께 응답할 것으로 예상됩니다.

source: To indicate that the action was completed successfully, a device should publish a response with ``rc`` set to ``200``.
es: Para indicar que la acción se ha completado satisfactoriamente, un dispositivo debe publicar una respuesta con ``rc`` establecido en ``200``.
fr: Pour indiquer que l'action a abouti, un terminal doit publier une réponse dont le code retour ``rc`` a pour valeur ``200``.
ko: 조치가 완료되었음을 표시하려면, 디바이스는 ``rc``를 ``200``으로 설정하여 응답을 공개해야 합니다.

source: Below is an example exchange between the server and a device.
es: A continuación hay un ejemplo de intercambio entre el servidor y un dispositivo.
fr: Vous trouverez ci-dessous un exemple d'échange entre le serveur et un terminal.
ko: 아래는 서버와 디바이스 간의 교환 예제입니다.

source: Example
es: Ejemplo
fr: Exemple
ko: 예제

source: In this example, we will walk through defining a new device management extension and executing an action defined within that extension.
es: En este ejemplo, definiremos una nueva extensión de gestión de dispositivos y ejecutaremos una acción definida en esa extensión.
fr: Cet exemple explique comment définir une nouvelle extension de gestion des terminaux et exécuter une action définie dans cette extension.
ko: 이 예제에서 새 디바이스 관리 확장을 정의하고, 해당 확장 내에서 정의된 조치를 수행하는 작업에 대해 자세히 보여드리겠습니다.
