Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/index.po
Languages: es, fr, ko

source: Device Management Protocol
es: Protocolo de gestión de dispositivo
fr: Protocoles de gestion des terminaux
ko: 디바이스 관리 프로토콜

source: Introduction
es: Introducción
ko: 소개

source: The Device Management capabilities in the IoT Platform create a new class of connected devices, Managed Devices.
es: Las prestaciones de gestión de dispositivos de IoT Platform crean una nueva clase de dispositivos conectados, los dispositivos gestionados.
fr: Les fonctionnalités de gestion des terminaux d'IoT Platform créent une classe de terminaux connectés, appelés terminaux gérés.
ko: IoT Platform의 디바이스 관리 기능은 새로운 클래스의 연결된 디바이스 즉, 관리 디바이스를 작성합니다.

source: Managed Devices must, by definition, contain a management agent which can understand the IoT Platform Device Management Protocol, and send a Manage Device request to the IoT Platform Device Management server. Managed devices can access the device management operations as explained later in this document.
es: Por definición, los dispositivos gestionados deben contener un agente de gestión que pueda entender el protocolo de gestión de dispositivos de IoT Platform y enviar solicitudes de dispositivos gestionados al servidor de gestión de dispositivos de IoT Platform. Los dispositivos gestionados pueden acceder a las operaciones de gestión de dispositivos como se explica más adelante en el presente documento.
fr: Par définition, les terminaux gérés doivent inclure un agent de gestion capable de comprendre le protocole de gestion des terminaux IoT Platform, et d'envoyer une demande de gestion des terminaux au serveur de gestion des terminaux IoT Platform correspondant. Les terminaux gérés peuvent accéder aux opérations de gestion des terminaux, comme expliqué ultérieurement dans ce document.
ko: 관리 디바이스에는 의미상 IoT Platform 디바이스 관리 프로토콜을 이해하고 IoT Platform 디바이스 관리 서버에 디바이스 관리 요청을 보낼 수 있는 관리 에이전트가 있어야 합니다. 관리 디바이스는 디바이스 관리 오퍼레이션에 액세스할 수 있으며 이 오퍼레이션에 대해서는 이 문서의 후반부에 설명되어 있습니다.

source: The Device Management Protocol defines a set of supported operations. A device management agent can support a subset of the operations, but the Manage device and Unmanage device operations must be supported. A device supporting firmware action operations must also support observation.
es: El protocolo de gestión de dispositivos define un conjunto de operaciones admitidas. Un agente de gestión de dispositivos puede admitir un subconjunto de operaciones, pero es obligatorio que admita las operaciones Gestionar dispositivo y No gestionar dispositivo. Un dispositivo que admita operaciones de acción de firmware debe admitir también la observación.
fr: Le protocole de gestion des terminaux définit un ensemble d'opérations prises en charge. Un agent de gestion des terminaux peut prendre en charge un sous-ensemble de ces opérations mais les opérations de gestion d'un terminal et d'annulation de la gestion d'un terminal doivent être prises en charge. Un terminal qui prend en charge les opérations impliquant des actions sur le microprogramme doit également prendre en charge l'action d'observation.
ko: 디바이스 관리 프로토콜이 지원되는 오퍼레이션 세트를 정의합니다. 디바이스 관리 에이전트는 오퍼레이션의 서브세트를 지원하지만, 디바이스 관리 및 디바이스 관리 해제 오퍼레이션이 지원되어야 합니다. 펌웨어 조치 오퍼레이션을 지원하는 디바이스도 관찰을 지원해야 합니다.

source: The Device Management Protocol is built on top of MQTT. For details specific to how Device Management Protocol interacts with MQTT please see `MQTT Connectivity for Devices <../mqtt.html>`__
es: El protocolo de gestión de dispositivos está construido en la parte superior de MQTT. Para obtener detalles concretos de cómo interactúa el protocolo de gestión de dispositivos con MQTT, consulte `Conectividad de MQTT para dispositivos <../mqtt.html>`__
fr: Le protocole de gestion des terminaux se trouve au-dessus de MQTT. Pour des détails sur la façon dont le protocole de gestion des terminaux interagit avec MQTT, voir `Connectivité MQTT des terminaux <../mqtt.html>`__
ko: 디바이스 관리 프로토콜이 MQTT의 맨 위에 빌드됩니다. 디바이스 관리 프로토콜이 MQTT와 상호작용하는 방법에 대한 세부사항은 `디바이스를 위한 MQTT 연결 <../mqtt.html>`__의 내용을 참조하십시오.

source: The Device Management Lifecycle
es: Ciclo de vida de gestión de dispositivos
fr: Cycle de vie de la gestion des terminaux
ko: 디바이스 관리 라이프사이클

source: A device and its associated device type are created in the IoT Platform using the dashboard or API.
es: En IoT Platform se crean un dispositivo y su tipo de dispositivo asociado mediante el panel de control y la API REST.
fr: Un terminal et le type de terminal associé sont créés dans IoT Platform à l'aide du tableau de bord ou de l'API.
ko: 디바이스 및 연관된 디바이스 유형이 대시보드 또는 API를 통해 IoT Platform에 작성됩니다.

source: The device connects to the IoT Platform and uses the 'Manage Device' operation to become a managed device.
es: El dispositivo se conecta a IoT Platform y utiliza la operación 'Gestionar dispositivo' para convertirse en un dispositivo gestionado.
fr: Le terminal se connecte à IoT Platform et utilise l'opération 'Gérer le terminal' pour devenir un terminal géré.
ko: 디바이스가 IoT Platform에 연결되며 '디바이스 관리' 오퍼레이션을 사용하여 관리 디바이스로 설정합니다.

source: The device's metadata, as described in the Device Model can now be viewed and manipulated through device operations, for example, firmware update and device reboot.
es: Los metadatos del dispositivo, como se describe en el modelo de dispositivo, ahora se pueden ver y manipular mediante las operaciones de dispositivo, por ejemplo, la actualización de firmware y el reinicio del dispositivo.
fr: Les métadonnées du terminal, telles qu'elles sont décrites dans le modèle de terminal, peuvent désormais être affichées et manipulées via l'exécution d'opérations sur le terminal, par exemple la mise à jour du microprogramme et le réamorçage du terminal.
ko: 디바이스 모델에 설명된 대로 이제 디바이스의 메타데이터를 펌웨어 업데이트 및 디바이스 다시 부팅 등의 디바이스 오퍼레이션을 통해 보고 조작할 수 있습니다.

source: The device can communicate updates through the device-management protocol, such as location or diagnostic information and error codes.
es: El dispositivo puede comunicar actualizaciones mediante el protocolo de gestión de dispositivos, por ejemplo, información de la ubicación o de diagnóstico y códigos de error.
fr: Le terminal peut transmettre des mises à jour via le protocole de gestion des terminaux, comme des informations d'emplacement ou de diagnostic ou des codes d'erreur.
ko: 디바이스가 위치 또는 진단 정보와 오류 코드 등의 디바이스 관리 프로토콜을 통해 업데이트를 통신할 수 있습니다.

source: In order to provide a way to deal with defunct devices in large device populations, the 'Manage device' operation request has an optional lifetime parameter. This lifetime parameter is the number of seconds within which the device must make another 'Manage device' request in order to avoid being marked as dormant and becoming an unmanaged device.
es: Con el fin de proporcionar una forma de gestionar los dispositivos inactivos en poblaciones grandes de dispositivos, la solicitud de una operación 'Gestionar dispositivo' tiene un parámetro de tiempo de vida opcional. Este parámetro de tiempo de vida es el número de segundos durante el cual el dispositivo debe enviar otra solicitud 'Gestionar dispositivo' para evitar que se marque como inactivo y convertirse en un dispositivo no gestionado.
fr: Pour prendre en charge les terminaux obsolètes dans des parcs de terminaux volumineux, la demande de l'opération 'Gérer le terminal' inclut un paramètre de durée de vie (lifetime) facultatif. Ce paramètre correspond au nombre de secondes au cours desquelles le terminal doit effectuer une autre demande 'Gérer le terminal' pour éviter d'être considéré comme un terminal en veille et devenir un terminal non géré.
ko: 다수의 디바이스에서 존재하지 않는 디바이스를 처리하는 방법을 제공하도록 '디바이스 관리' 오퍼레이션 요청에 선택적 영구 매개변수가 있습니다. 이 영구 매개변수는 휴지 상태로 표시되어 관리 해제된 디바이스가 되지 않도록 디바이스가 다른 '디바이스 관리' 요청을 작성해야 하는 제한시간(초)입니다.

source: When a device is decommissioned it can be removed from the IoT Platform using the dashboard or REST API.
es: Cuando un dispositivo se pone fuera de servicio, se puede eliminar de IoT Platform mediante el panel de control o la API REST.
fr: Lorsqu'un terminal n'est plus utilisé, il peut être supprimé d'IoT Platform à l'aide du tableau de bord ou de l'API REST.
ko: 디바이스가 권한 해제되면 대시보드 또는 REST API를 통해 IoT Platform에서 제거할 수 있습니다.

source: Return Code Summary
es: Resumen de códigos de retorno
fr: Récapitulatif des codes retour
ko: 리턴 코드 요약

source: There are several return codes which are sent in response to the actions listed above.
es: Hay siete códigos de retorno que se envían en respuesta a las acciones listadas anteriormente.
fr: Plusieurs codes retour peuvent être envoyés en réponse aux actions indiquées ci-dessus.
ko: 위에 나열된 조치에 대한 응답으로 전송되는 여러 개의 리턴 코드가 있습니다.

source: 200: Operation succeeded
es: 200: La operación ha finalizado correctamente
fr: 200 : Réussite de l'opération
ko: 200: 오퍼레이션 성공

source: 202: Accepted (for initiating commands)
es: 202: Aceptado (para iniciar mandatos)
fr: 202 : Accepté (pour le lancement de commandes)
ko: 202: 허용(명령 시작용)

source: 204: Changed (for attribute updates)
es: 204: Modificado (para actualizaciones de atributo)
fr: 204 : Modifié (pour les mises à jour d'attributs)
ko: 204: 변경(속성 업데이트용)

source: 400: Bad request, for example, if a device is not in the appropriate state for this command
es: 400: Solicitud incorrecta, por ejemplo, si el estado del dispositivo no es correcto para este mandato
fr: 400 : Demande erronée, par exemple si un terminal ne se trouve pas dans l'état approprié pour cette commande
ko: 400: 잘못된 요청입니다. 예를 들어, 디바이스가 이 명령에 대해 적합한 상태가 아닌 경우가 있습니다.

source: 404: Attribute was not found, this code is also used if the operation was published to an invalid topic.
es: 404: El atributo no se ha encontrado, este código también se utiliza si la operación se ha publicado para un tema no válido.
fr: 404 : Attribut introuvable. Ce code est également utilisé si l'opération a été publiée dans un sujet non valide.
ko: 404: 속성을 찾을 수 없습니다. 이 코드는 오퍼레이션이 올바르지 않은 주제에 공개되는 경우에도 사용됩니다.

source: 409: Resource could not be updated due to a conflict, for example, the resource is being updated by two simultaneous requests, so update could be retried later
es: 409: El recurso no se puede actualizar debido a un conflicto, por ejemplo, dos solicitudes simultáneas están actualizando el recurso, por lo tanto, la actualización se puede intentar más tarde
fr: 409 : La ressource n'a pas pu être mise à jour en raison d'un conflit, par exemple lorsqu'elle est mise à jour par deux demandes simultanées. La tentative de mise à jour peut donc être effectuée ultérieurement.
ko: 409: 충돌로 인해 자원을 업데이트할 수 없습니다. 예를 들어, 2개의 동시 요청에서 자원이 업데이트 중이어서 업데이트를 나중에 다시 시도할 수 없습니다.

source: 500: Unexpected device error
es: 500: Error de dispositivo inesperado
fr: 500 : Erreur inattendue du terminal
ko: 500: 예상치 못한 디바이스 오류

source: 501: Operation not implemented
es: 501: Operación no implementada
fr: 501 : Opération non mise en oeuvre
ko: 501: 오퍼레이션이 구현되지 않음

source: Manage Device
es: Gestionar dispositivo
fr: Gérer le terminal
ko: 디바이스 관리

source: A device uses this request to become a managed device. It should be the first device management request sent by the device after connecting to the IoT Platform. It would be usual for a device management agent to send this whenever it starts or restarts.
es: Un dispositivo utiliza esta solicitud para convertirse en un dispositivo gestionado. Debe ser la primera solicitud de gestión de dispositivos enviada por el dispositivo después de conectarse a IoT Platform. Lo normal es que un agente de gestión de dispositivos envíe esta solicitud siempre que se inicie o se reinicie.
fr: Un terminal utilise cette demande pour devenir un terminal géré. Cette demande doit être la première demande de gestion envoyée par le terminal après sa connexion à IoT Platform. Un agent de gestion des terminaux envoie généralement cette demande à chaque démarrage ou redémarrage.
ko: 디바이스가 관리 디바이스가 되도록 이 요청을 사용합니다. 이 요청은 IoT Platform에 연결한 후 디바이스에서 첫 번째로 전송한 디바이스 관리 요청이어야 합니다. 이는 시작하거나 다시 시작할 때마다 이를 전송하도록 디바이스 관리 에이전트에 유용합니다.

source: Support for this operation is mandatory for any managed devices.
es: Es obligatorio que todos los dispositivos gestionados cuenten con soporte para esta operación.
fr: La prise en charge de cette opération est obligatoire pour tous les terminaux gérés.
ko: 이 오퍼레이션에 대한 지원은 관리 디바이스에 필수적입니다.

source: Topic
es: Tema
fr: Sujet
ko: 주제

source: A device publishes this request to the following topic:
es: Un dispositivo publica esta solicitud en el tema siguiente:
ko: 디바이스는 이 요청을 다음 주제에 공개합니다.

source: The server responds to this request on the following topic:
es: El servidor responde a esta solicitud en el tema siguiente:
ko: 서버는 다음 주제에서 이 요청에 대해 응답합니다.

source: Message Format
es: Formato del mensaje
fr: Format du message
ko: 메시지 형식

source: For the request, the ``d`` field and all of its sub-fields are optional. The ``metadata`` and ``deviceInfo`` field values replace the corresponding attributes for the sending device if they are sent.
es: En la solicitud, el campo 'd' y todos sus subcampos son opcionales. Los valores de campo 'metadata' y 'deviceInfo' sustituyen a los atributos correspondientes del dispositivo que realiza el envío si se envían.
fr: Pour la demande, la zone ``d`` et toutes ses sous-zones sont facultatives. Les valeurs des zones ``metadata`` et ``deviceInfo`` remplacent les attributs correspondants du terminal d'envoi, si elles sont envoyées.
ko: 요청의 경우 ``d`` 필드 및 모든 해당 하위 필드가 선택적입니다. ``metadata`` 및 ``deviceInfo`` 필드 값은 보내는 디바이스에 대해 해당되는 속성을 바꿉니다(전송되는 경우).

source: The optional ``lifetime`` field specifies the length of time in seconds within which the device must send another 'Manage device' request in order to avoid being reverted to an unmanaged device and marked as dormant. If omitted or if set to ``0``, the managed device will not become dormant. When set, the minimum supported setting is ``3600`` (1 hour).
es: El campo opcional 'lifetime' especifica el periodo de tiempo en segundos durante el cual el dispositivo debe enviar otra solicitud 'Manage device' para evitar convertirse en un dispositivo no gestionado y marcarse como inactivo. Si se omite o si se establece en '0'. el dispositivo gestionado no pasará a estar inactivo. Cuando se establece, el valor mínimo admitido es '3600' (1 hora).
fr: La zone facultative ``lifetime`` indique la période, en secondes, au cours de laquelle le terminal doit envoyer une autre demande 'Gérer le terminal' pour éviter de revenir à l'état d'un terminal non géré et passer en mode veille. Si la zone est omise ou correspond à ``0``, le terminal géré n'est pas mis en veille. Si la zone est définie, la valeur minimale acceptée est ``3600`` (1 heure).
ko: 선택적 ``lifetime`` 필드는 관리 해제된 디바이스로 되돌려서 휴지 상태로 표시되지 않도록 디바이스가 다른 '디바이스 관리' 요청을 전송해야 하는 시간(초)을 지정합니다. 생략되거나 ``0``으로 설정된 경우 관리 디바이스는 휴지 상태가 되지 않습니다. 설정된 경우 최소한으로 지원되는 설정값은 ``3600``(1시간)입니다.

source: Optional ``supports.deviceActions`` and ``supports.firmwareActions`` indicate the capabilities of the device management agent. If ``supports.deviceActions`` is set, the agent supports Reboot and Factory Reset actions. For a device that does not distinguish between rebooting and factory reset, it is acceptable to use the same behaviour for both actions. If ``supports.firmwareActions`` is set, the agent supports Firmware Download and Firmware Update actions.
es: Los campos 'supports.deviceActions' y 'supports.firmwareActions' indican las capacidades del agente de gestión de dispositivos. Si se configura 'supports.deviceActions', el agente admite las acciones Reinicio y Restablecimiento a configuración de fábrica. Para un dispositivo que no distingue entre el reinicio y el restablecimiento a configuración de fábrica, es válido utilizar el mismo comportamiento para las dos acciones. Si se configura 'supports.firmwareActions', el agente admite las acciones Descarga de firmware y Actualización de firmware.
fr: Facultatif. ``supports.deviceActions`` et ``supports.firmwareActions`` indiquent les fonctionnalités de l'agent de gestion des terminaux. Si ``supports.deviceActions`` est défini, l'agent prend en charge les actions Réamorcer et Réinitialiser avec les paramètres d'usine. Pour un terminal qui ne fait pas de distinction entre le réamorçage et la réinitialisation avec les paramètres d'usine, vous pouvez utiliser le même comportement pour les deux actions. Si ``supports.firmwareActions`` est défini, l'agent prend en charge les actions Télécharger le microprogramme et Mettre à jour le microprogramme.
ko: 선택적 ``supports.deviceActions`` 및 ``supports.firmwareActions``는 디바이스 관리 에이전트의 기능을 표시합니다. ``supports.deviceActions``가 설정된 경우 에이전트가 다시 부팅 및 팩토리 재설정 조치를 지원합니다. 다시 부팅 및 팩토리 재설정 간에 구별하지 않는 디바이스의 경우 두 조치 모두에 대해 동일한 동작을 사용할 수 있습니다. ``supports.firmwareActions``가 설정된 경우 에이전트가 펌웨어 다운로드 및 펌웨어 업데이트 조치를 지원합니다.

source: Request Format:
es: Formato de solicitud:
fr: Format de la demande :
ko: 요청 형식:

source: Response Format:
es: Formato de respuesta:
fr: Format de la réponse :
ko: 응답 형식:

source: Response Codes
es: Códigos de respuesta
fr: Codes de réponse
ko: 응답 코드

source: 200: The operation was successful.
es: 200: La operación se realizó correctamente.
fr: 200 : L'opération a abouti.
ko: 200: 오퍼레이션이 완료되었습니다.

source: 400: The input message does not match the expected format, or one of the values is out of the valid range.
es: 400: El mensaje de entrada no coincide con el formato esperado, o uno de los valores está fuera del rango válido.
fr: 400 : Le message d'entrée ne correspond pas au format attendu ou une des valeurs n'est pas comprise dans la plage valide.
ko: 400: 입력 메시지가 예상 형식과 일치하지 않거나 값 중 하나가 올바른 범위 밖에 있습니다.

source: 404: The topic name is incorrect, or the device is not in the database.
es: 404: El nombre del tema no es correcto, o el dispositivo no está en la base de datos.
fr: 404 : Le nom de sujet est incorrect ou le terminal n'est pas dans la base de données.
ko: 404: 주제 이름이 올바르지 않거나 디바이스가 데이터베이스에 없습니다.

source: 409: A conflict occurred during the device database update. To resolve this, simplify the operation is necessary.
es: 409: Se ha producido un conflicto durante la actualización de base de datos del dispositivo. Para resolverlo, simplifique la operación si es necesario.
fr: 409 : Un conflit s'est produit au cours de la mise à jour de la base de données de terminaux. Pour résoudre ce problème, simplifiez si nécessaire l'opération.
ko: 409: 디바이스 데이터베이스 업데이트 중에 충돌이 발생했습니다. 이를 해결하려면 오퍼레이션을 단순화해야 합니다.

source: Unmanage Device
es: No gestionar dispositivo
fr: Annuler la gestion du terminal
ko: 디바이스 관리 해제

source: A device uses this request when it no longer needs to be managed. The IoT Platform will no longer send new device management requests to this device and all device management requests from this device will be rejected other than a 'Manage device' request.
es: Un dispositivo utiliza esta solicitud cuando ya no necesita ser gestionado. IoT Platform ya no enviará nuevas solicitudes de gestión de dispositivos a este dispositivo, y todas las solicitudes de gestión de dispositivos procedentes de este dispositivo se rechazarán, excepto la solicitud 'Gestionar dispositivo'.
fr: Un terminal utilise cette demande lorsqu'il n'a plus besoin d'être géré. IoT Platform n'envoie plus de nouvelles demandes de gestion des terminaux à ce terminal et toutes les demandes de gestion des terminaux émises depuis ce terminal sont rejetées, à l'exception d'une demande 'Gérer le terminal'.
ko: 디바이스가 이제 관리될 필요가 없는 경우 이 요청을 사용합니다. IoT Platform에서 더 이상 새 디바이스 관리 요청을 이 디바이스에 보내지 않으며, 이 디바이스의 모든 디바이스 관리 요청이 '디바이스 관리' 요청을 제외하고 거부됩니다.

source: Update Location
es: Actualizar ubicación
fr: Mettre à jour l'emplacement
ko: 위치 업데이트

source: Devices can change their location over time. The update of the location can happen in two ways:
es: Los dispositivos pueden cambiar su ubicación con el tiempo. La actualización de la ubicación puede realizarse de dos formas:
fr: Les terminaux peuvent changer d'emplacement au fil du temps. La mise à jour de l'emplacement peut être effectuée de deux manières :
ko: 디바이스가 시간이 지나면서 해당 위치를 변경할 수 있습니다. 다음과 같이 두 가지 방식으로 위치가 업데이트될 수 있습니다.

source: The device itself notifies the IoT Platform about the location update: The device retrieves its location from a GPS receiver and sends a device management message to the IoT Platform to update its location. The timestamp captures the time at which the location was retrieved from the GPS receiver. This means that the timestamp is valid, even if the transmission of the location message was delayed. In the event that the timestamp is omitted from the device management message sent, the current date and time on message receipt will be used when the device's location metadata is updated.
es: El propio dispositivo notifica la actualización de la ubicación a IoT Platform: El dispositivo obtiene su ubicación a partir de un receptor GPS y envía un mensaje de gestión de dispositivos a IoT Platform para actualizar su ubicación. La indicación de fecha y hora recupera la hora a la que se obtuvo la ubicación del receptor GPS. Esto significa que la indicación de fecha y hora es válida, aunque se retrase la transmisión del mensaje de ubicación. En el caso de que la indicación de fecha y hora se omita en el mensaje de gestión de dispositivos enviado, la hora y fecha actuales de la recepción del mensaje se utilizarán cuando se actualicen los metadatos de ubicación del dispositivo.
fr: Le terminal signale lui-même la mise à jour de son emplacement à IoT Platform : il extrait son emplacement d'un récepteur GPS et envoie un message de gestion du terminal à IoT Platform pour mettre à jour son emplacement. L'horodatage capture l'heure à laquelle l'emplacement a été extrait du récepteur GPS. Cela signifie que l'horodatage est valide même si la transmission du message d'emplacement a été retardée. Si l'horodatage ne figure pas dans le message de gestion du terminal envoyé, la date et l'heure de réception du message sont utilisées lors de la mise à jour des métadonnées d'emplacement du terminal.
ko: 디바이스 자체는 위치 업데이트를 IoT Platform에 알립니다. 디바이스는 GPS 수신기에서 해당 위치를 검색하고 디바이스 관리 메시지를 IoT Platform에 전송하여 해당 위치를 업데이트합니다. 위치가 GPS 수신기에서 검색된 시간을 시간소인이 캡처합니다. 즉, 위치 메시지의 전송이 지연된 경우에도 시간소인은 유효합니다. 전송된 디바이스 관리 메시지에서 시간소인이 생략된 경우, 디바이스의 위치 메타데이터가 업데이트되면 메시지 수신 시 현재 날짜 및 시간이 사용됩니다.

source: A user / app updates the location of a device using the Rest API: The IoT Platform REST API is used to set the location metadata of a static device. This can be done at the time that the device is registered, or later if required. It is optional whether to include a timestamp. If omitted, the current date and time will be set as the device’s location metadata.
es: Un usuario o una aplicación actualizan la ubicación de un dispositivo mediante la API REST: La API REST de IoT Platform se utiliza para establecer los metadatos de ubicación de un dispositivo estático. Esto puede realizarse en el momento de registro del dispositivo, o más adelante si es necesario. La inclusión de una indicación de fecha y hora es opcional. Si se omite, la fecha y hora actuales se establecerán como los metadatos de ubicación del dispositivo.
fr: Un utilisateur ou une application met à jour l'emplacement d'un terminal à l'aide de l'API REST : l'API REST d'IoT Platform permet de définir les métadonnées d'emplacement d'un terminal statique. Cette opération peut être effectuée lors de l'enregistrement du terminal ou ultérieurement, si nécessaire. L'ajout d'un horodatage est facultatif. Si l'horodatage est omis, la date et l'heure en cours sont utilisées en tant que métadonnées d'emplacement du terminal.
ko: 사용자/앱은 Rest API를 통해 디바이스의 위치를 업데이트합니다. IoT Platform REST API를 사용하여 정적 디바이스의 위치 메타데이터를 설정합니다. 이는 디바이스 등록 시 완료될 수 있거나 필요한 경우 나중에 완료됩니다. 시간소인을 포함할지 여부는 선택사항입니다. 생략된 경우 현재 날짜 및 시간이 디바이스의 위치 메타데이터로 설정됩니다.
