Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/index.po
Languages: es, fr, ko

source: Location update triggered by device
es: Actualización de ubicación desencadenada por dispositivo
fr: Mise à jour de l'emplacement déclenchée par un terminal
ko: 디바이스에서 트리거된 위치 업데이트

source: Devices that can determine their location can choose to notify the IoT Platform device management server about location changes.
es: Los dispositivos con capacidad para determinar su propia ubicación pueden optar por notificar los cambios de ubicación al servidor de gestión de dispositivos de IoT Platform.
fr: Les terminaux qui peuvent déterminer leur emplacement peuvent décider de signaler la modification de leur emplacement au serveur de gestion des terminaux IoT Platform.
ko: 위치를 판별할 수 있는 디바이스는 IoT Platform 디바이스 관리 서버에 위치 변경을 알리도록 선택할 수 있습니다.

source: Location update triggered by user or app
es: Actualización de ubicación desencadenada por usuario o aplicación
fr: Mise à jour de l'emplacement déclenchée par un utilisateur ou une application
ko: 사용자 또는 앱에서 트리거된 위치 업데이트

source: When a user or application updates the location of an active managed device the device retrieves an update message:
es: Si un usuario o una aplicación actualizan la ubicación de un dispositivo gestionado activo, dicho dispositivo recupera un mensaje de actualización:
fr: Lorsqu'un utilisateur ou une application met à jour l'emplacement d'un terminal géré actif, le terminal extrait un message de mise à jour :
ko: 사용자 또는 애플리케이션이 활성 관리 디바이스의 위치를 업데이트하면 디바이스는 업데이트 메시지를 검색합니다.

source: The server publishes this request to the following topic:
es: El servidor publica esta solicitud en el tema siguiente:
ko: 서버는 이 요청을 다음 주제에 공개합니다.

source: The "measuredDateTime" is the date of location measurement. The "updatedDateTime" is the date of the update to the device information. For efficiency reasons, the IoT Platform may batch updates to location information so the updates may be slightly delayed. The "latitude" and "longitude" should be specified in decimal degrees using WGS84.
es: El valor "measuredDateTime" es la fecha de la medición de ubicación. El valor "updatedDateTime" es la fecha de la actualización de la información del dispositivo. Por motivos de eficiencia, IoT Platform puede realizar actualizaciones por lotes de la información de ubicación, por lo que las actualizaciones pueden retrasarse ligeramente. Los valores "latitude" y "longitude" deben especificarse en grados decimales mediante WGS84.
fr: La valeur de "measuredDateTime" représente la date de la mesure de l'emplacement. La valeur de "updatedDateTime" représente la date de mise à jour des informations du terminal. Dans un souci d'efficacité, IoT Platform peut regrouper par lots les mises à jour des informations d'emplacement, ce qui peut retarder légèrement leur application. Les valeurs de "latitude" et de "longitude" doivent être exprimées en degrés décimaux à l'aide de WGS84.
ko: "measuredDateTime"은 위치 측정 날짜입니다. "updatedDateTime"은 디바이스 정보에 대한 업데이트 날짜입니다. 효율성을 위해 IoT Platform이 위치 정보에 대한 업데이트를 일괄처리하므로 업데이트가 약간 지연될 수도 있습니다. "위도" 및 "경도"가 WGS84를 통해 10진수 도로 지정되어야 합니다.

source: Whenever location is updated, the values provided for latitude, longitude, elevation and uncertainty are considered as a single multi-value update. The latitude and longitude are mandatory and must both be provided with each update. Elevation and uncertainty are optional and can be omitted.
es: Siempre que se actualiza la ubicación, los valores suministrados para la latitud, longitud, elevación e incertidumbre se consideran como una actualización única de varios valores. La latitud y la longitud son obligatorios y ambos deben proporcionarse con cada actualización. La elevación y la incertidumbre son opcionales y se pueden omitir.
fr: Lorsque l'emplacement est mis à jour, les valeurs fournies pour longitude, elevation et uncertainty sont considérées comme une seule mise à jour comportant plusieurs valeurs. Les valeurs de latitude et de longitude sont obligatoires et doivent être indiquées pour chaque mise à jour. Les valeurs définies pour elevation et uncertainty sont facultatives et peuvent être omises.
ko: 위치가 업데이트될 때마다 위도, 경도, 엘리베이션 및 불확실성에 대해 제공된 값은 하나의 다중 값 업데이트로 간주됩니다. 위도 및 경도는 필수이고 둘 다 각 업데이트와 함께 제공되어야 합니다. 엘리베이션 및 불활실성은 선택사항이고 생략할 수 있습니다.

source: If an optional value is provided on an update and then omitted on a later update, the earlier value is deleted by the later update. Each update is considered as a complete multi-value set.
es: Si se suministra un valor opcional en una actualización y posteriormente se omite en una actualización posterior, el valor más antiguo se suprime por la actualización posterior. Cada actualización se considera como un conjunto completo de varios valores.
fr: Si une valeur facultative est indiquée pour une mise à jour, puis omise lors d'une mise à jour ultérieure, la valeur précédente est supprimée par la mise à jour plus récente. Chaque mise à jour est considérée comme un ensemble complet incluant plusieurs valeurs.
ko: 선택적 값이 업데이트 시 제공된 다음 나중 업데이트에서 생략된 경우 이전 값이 나중 업데이트에서 삭제됩니다. 각 업데이트는 전체 다중 값 세트로 간주됩니다.

source: Payload Format:
es: Formato de carga útil:
fr: Format du contenu :
ko: 페이로드 형식:

source: Please note: there is no reqId as no response by device is required.
es: Nota: No hay ningún reqId, ya que no se requiere ninguna respuesta del dispositivo.
fr: Remarque : il n'y a pas de reqId car aucune réponse du terminal n'est nécessaire.
ko: 참고로, 디바이스의 응답이 필요하지 않으므로 reqId가 없습니다.

source: Update Device Attributes
es: Actualizar atributos de dispositivo
fr: Mettre à jour les attributs du terminal
ko: 디바이스 속성 업데이트

source: The IoT Platform can send this request to a device to update values of one or more device attributes. Attributes that can be updated by the Rest API are location, metadata, device information and firmware.
es: IoT Platform puede enviar esta solicitud a un dispositivo para actualizar los valores de uno o varios atributos de dispositivo. Los atributos que se pueden actualizar con la API REST son: ubicación, metadatos, información de dispositivo y firmware.
fr: IoT Platform peut envoyer cette demande à un terminal pour mettre à jour les valeurs d'un ou de plusieurs attributs du terminal. Les attributs qui peuvent être mis à jour par l'API REST sont location, metadata, device information et firmware.
ko: IoT Platform이 이 요청을 디바이스로 전송하여 하나 이상의 디바이스 속성 값을 업데이트할 수 있습니다. Rest API에서 업데이트될 수 있는 속성은 위치, 메타데이터, 디바이스 정보 및 펌웨어입니다.

source: The "value" is the new value of the device attribute. It is a complex field matching the device model. Only writeable fields should be updated as a result of this operation. Values can be updated in:
es: El campo "value" es el nuevo valor del atributo de dispositivo. Se trata de un campo complejo que coincide con el modelo de dispositivo. Solo se deben actualizar los campos modificables como resultado de esta operación. Los valores se puede actualizar en:
fr: La zone "value" représente la nouvelle valeur de l'attribut du terminal. Cette zone est une zone complexe qui correspond au modèle du terminal. Seules les zones accessibles en écriture doivent être mises à jour lors de cette opération. Les valeurs peuvent être mises à jour dans :
ko: "value"는 디바이스 속성의 새 값입니다. 이는 디바이스 모델과 일치하는 복합 필드입니다. 쓰기 가능한 필드만 이 오퍼레이션의 결과로 업데이트되어야 합니다. 값을 업데이트할 수 있는 위치는 다음과 같습니다.

source: location (see Update location section for details)
es: location (consulte la sección Actualizar ubicación para obtener más detalles)
fr: location (pour plus d'informations, reportez-vous à la section Mettre à jour l'emplacement)
ko: 위치(세부사항은 위치 업데이트 섹션 참조)

source: metadata (Optional)
es: metadata (Opcional)
fr: metadata (facultatif)
ko: 메타데이터(선택사항)

source: deviceInfo (Optional)
es: deviceInfo (Opcional)
fr: deviceInfo (facultatif)
ko: deviceInfo(선택사항)

source: mgmt.firmware (see Firmware update process for details)
es: mgmt.firmware (consulte la sección Proceso de actualización de firmware para obtener más detalles)
fr: mgmt.firmware (pour plus d'informations, reportez-vous à la procédure de mise à jour du microprogramme)
ko: mgmt.firmware(세부사항은 펌웨어 업데이트 프로세스 참조)

source: Message format
es: Formato de mensaje
fr: Format du message
ko: 메시지 형식

source: Add Error Code
es: Añadir código de error
fr: Ajouter un code d'erreur
ko: 오류 코드 추가

source: Devices can choose to notify the IoT Platform device management server about changes in their error status.
es: Los dispositivos pueden optar por notificar al servidor de gestión de dispositivos de IoT Platform los cambios producidos en sus estados de error.
fr: Les terminaux peuvent signaler au serveur de gestion des terminaux IoT Platform les modifications de leur statut d'erreur.
ko: 디바이스는 IoT Platform 디바이스 관리 서버에 오류 상태의 변경을 알리도록 선택할 수 있습니다.

source: The "errorCode" is a current device error code that needs to be added to the IoT Platform.
es: "errorCode" es un código de error de dispositivo actual que es necesario añadir a IoT Platform.
fr: La valeur "errorCode" représente le code d'erreur en cours du terminal, qui doit être ajouté à IoT Platform.
ko: "errorCode"는 IoT Platform에 추가해야 하는 현재 디바이스 오류 코드입니다.

source: Clear Error Codes
es: Borrar códigos de error
fr: Effacer des codes d'erreur
ko: 오류 코드 지우기

source: Devices can request that the Internet of Things Foundation clear all of their error codes.
es: Los dispositivos pueden solicitar que Internet of Things Foundation borre todos sus códigos de error.
fr: Les terminaux peuvent demander à Internet of Things Foundation d'effacer tous leurs codes d'erreur.
ko: 디바이스가 Internet of Things Foundation에서 모든 오류 코드를 지우도록 요청할 수 있습니다.

source: Add Log
es: Añadir registro
fr: Ajouter un journal
ko: 로그 추가

source: Devices can choose to notify IoTF device management support about changes a new log entry. Log entry includes a log messages, its timestamp and severity, as well as an optional base64-encoded binary diagnostic data.
es: Los dispositivos pueden optar por notificar al servicio de soporte de gestión de dispositivos de IoTF los cambios en una entrada de registro nueva. La entrada de registro incluye mensajes de error, su marca de fecha y hora y gravedad, así como datos de diagnóstico binarios codificados en base 64.
fr: Les terminaux peuvent signaler la création d'une entrée de journal à la fonction de gestion des terminaux IoTF. L'entrée de journal inclut des messages de journal, l'horodatage et le niveau de gravité associés, ainsi que des données de diagnostic binaires facultatives codées en base64.
ko: 디바이스가 새 로그 항목의 변경사항에 대해 IoTF 디바이스 관리 지원에 알리도록 선택할 수 있습니다. 로그 항목에는 선택적 base64 인코딩된 2진 진단 데이터와 로그 메시지, 해당 시간소인 및 심각도가 포함됩니다.

source: "message" is a diagnostic message that needs to be added to IoTF. "timestamp" is a date and time of the log entry in ISO8601 format. "data" is an optional base64-encoded diagnostic data. "severity" is a severity of the message (0: informational, 1: warning, 2: error).
es: "message" es un mensaje de diagnóstico que es necesario añadir a IoTF. "timestamp" es la fecha y la hora de la entrada de registro en formato ISO8601. "data" son datos de diagnóstico opcionales codificados en base64. "severity" es la gravedad del mensaje (0: informativo, 1: aviso, 2: error).
fr: La zone "message" représente un message de diagnostic qui doit être ajouté à IoTF. La zone "timestamp" représente la date et à l'heure de l'entrée de journal au format ISO8601. La zone "data" représente des données de diagnostic facultatives, codées en base64. La zone "severity" représente le niveau de gravité du message (0 : informations, 1 : avertissement, 2 : erreur).
ko: "메시지"는 IoTF에 추가되어야 하는 진단 메시지입니다. "시간소인"은 ISO8601 형식으로 된 로그 항목의 날짜 및 시간입니다. "데이터"는 선택적 base64 인코딩된 진단 데이터입니다. "심각도"는 메시지의 심각도(0: 정보용, 1: 경고, 2: 오류)입니다.

source: Clear Logs
es: Borrar registros
fr: Effacer des journaux
ko: 로그 지우기

source: Devices can request that the Internet of Things Foundation clear all of their log entries.
es: Los dispositivos pueden solicitar que Internet of Things Foundation borre todas sus entradas de registro.
fr: Les terminaux peuvent demander à Internet of Things Foundation d'effacer toutes leurs entrées de journal.
ko: 디바이스가 Internet of Things Foundation에서 모든 로그 항목을 지우도록 요청할 수 있습니다.

source: Observe Attribute Changes
es: Observar cambios en atributos
fr: Observer les modifications d'attributs
ko: 속성 변경 관찰

source: The IoT Platform can send this request to a device to observe changes of one or more device attributes. When the device receives this request, it must send a notification request ("notify" message) to the IoT Platform whenever the observed attributes value changes.
es: IoT Platform puede enviar esta solicitud a un dispositivo para observar los cambios de uno o más atributos de dispositivo. Cuando el dispositivo recibe esta solicitud, debe enviar una solicitud de notificación (mensaje "notify") a la IoT Platform siempre que cambie el valor de los atributos observados.
fr: IoT Platform peut envoyer cette demande à un terminal pour observer les modifications d'un ou de plusieurs attributs du terminal. Lorsque le terminal reçoit cette demande, il doit envoyer une demande de notification (message "notify") à IoT Platform à chaque modification de la valeur des attributs observés.
ko: IoT Platform이 이 요청을 디바이스로 전송하여 하나 이상의 디바이스 속성 변경사항을 관찰할 수 있습니다. 디바이스가 이 요청을 수신하면 관찰된 속성 값이 변경될 때마다 IoT Platform에 알림 요청("notify" 메시지)을 보내야 합니다.

source: Devices must implement observe, notify & cancel operations in order to support :ref:`firmware-actions-update`.
es: Los dispositivos deben implementar las operaciones de observación, notificación y cancelación para admitir :ref:`firmware-actions-update`.
fr: Les terminaux doivent effectuer des opérations d'observation, de notification et d'annulation pour prendre en charge l'opération :ref:`firmware-actions-update`.
ko: :ref:`firmware-actions-update`를 지원하도록 디바이스가 관찰, 알림 및 취소 오퍼레이션을 구현해야 합니다.

source: The "fields" field is an array of the device attribute names from the device model. For example, values could be "location", "mgmt.firmware" or "mgmt.firmware.state". If a complex field, such as "mgmt.firmware" is specified, it is expected that its underlying fields are updated at the same time, such that only a single notify message is generated.
es: El campo "fields" es una matriz de los nombres de atributo de dispositivo procedente del modelo de dispositivo. Por ejemplo, los valores podrían ser "location", "mgmt.firmware" o "mgmt.firmware.state". Si se especifica un campo complejo, por ejemplo, "mgmt.firmware", se espera que sus campos subyacentes se actualicen al mismo tiempo, ya que solo se genera un mensaje de notificación.
fr: La zone "fields" est un tableau contenant les noms d'attributs du terminal, établis à partir du modèle de terminal. Par exemple, les valeurs peuvent être "location", "mgmt.firmware" ou "mgmt.firmware.state". Si une zone complexe, comme "mgmt.firmware", est indiquée, ses zones sous-jacentes doivent être mises à jour en même temps pour générer un seul message de notification.
ko: "fields" 필드는 디바이스 모델의 디바이스 속성 이름 배열입니다. 예를 들어, 값이 "location", "mgmt.firmware" 또는 "mgmt.firmware.state"일 수 있습니다. "mgmt.firmware" 등의 복합 필드가 지정되는 경우 기존 필드가 동시에 업데이트되어 단일 알림 메시지만 생성되는 것으로 예상됩니다.

source: The "message" field used in the response can be specified if "rc" is not 200. If any field value which was to be observed could not be retrieved, "rc" should be set to 404 (if not found) or 500 (any other reason). When values for fields to be observed cannot be found, "fields" should contain an array of elements with "field" set to the name of each field that could not be read, "value" fields should be omitted. For the response code to be set to 200, both "field" and "value" must be specified, "value" is the current value of an attribute identified by "field" content.
es: El campo "message" utilizado en la respuesta se puede especificar si "rc" no es 200. Si algún valor de campo que es necesario observar no se ha podido recuperar, "rc" se debe establecer en 404 (si no se encuentra) o en 500 (cualquier otro motivo). Cuando los valores de los campos para observar no se encuentren, "fields" debe contener una matriz de elementos con "field" establecido en el nombre de cada campo que no se ha podido leer y deben omitirse los campos "value". Para poder establecer el código de respuesta en 200, es necesario especificar "field" y "value"; "value" es el valor actual de un atributo identificado mediante el contenido de "field".
fr: La zone "message" utilisée dans la réponse peut être indiquée si "rc" ne correspond pas à 200. Si une valeur d'une zone à observer ne peut pas être extraite, "rc" doit correspondre à 404 (zone introuvable) ou à 500 (autre motif). Lorsque les valeurs des zones à observer sont introuvables, la zone "fields" doit inclure un tableau d'éléments avec une zone "field" correspondant au nom de chaque zone qui n'a pas pu être lu. Les zones "value" doivent être omises. Pour définir le code de réponse 200, les zones "field" et "value" doivent être indiquées. La zone "value" représente la valeur actuelle d'un attribut identifié par le contenu de la zone "field".
ko: "rc"가 200이 아닌 경우 응답에 사용된 "message" 필드를 지정할 수 있습니다. 관찰할 필드 값을 검색할 수 없는 경우 "rc"가 404(찾을 수 없는 경우) 또는 500(기타 이유)으로 설정되어야 합니다. 관찰할 필드의 값을 찾을 수 없는 경우 "fields"에 읽을 수 없는 각 필드의 이름으로 "field"가 설정되어 요소의 배열이 포함되어야 하고 "value" 필드를 생략해야 합니다. 응답 코드가 200으로 설정되려면 "field" 및 "value" 둘 다 지정되어야 하고 "value"가 "field" 컨텐츠에서 식별되는 속성의 현재 값입니다.

source: Cancel Attribute Observation
es: Cancelar la observación de los atributos
fr: Annuler l'observation d'attributs
ko: 속성 관찰 취소

source: The IoT Platform can send this request to a device to cancel the current observation of one or more device attributes. The "fields" is an array of the device attribute names from the device model, for example, values could be "location", "mgmt.firmware" or "mgmt.firmware.state".
es: IoT Platform puede enviar esta solicitud a un dispositivo para cancelar la observación actual de los cambios de uno o varios atributos de dispositivo. El campo "fields" es una matriz de nombres de atributo de dispositivo procedentes del modelo de dispositivo; por ejemplo, los valores podrían ser "location", "mgmt.firmware" o "mgmt.firmware.state".
fr: IoT Platform peut envoyer cette demande à un terminal pour annuler l'observation en cours d'un ou de plusieurs attributs du terminal. La zone "fields" est un tableau contenant les noms d'attributs du terminal, établis à partir du modèle de terminal. Par exemple, les valeurs peuvent être "location", "mgmt.firmware" ou "mgmt.firmware.state".
ko: IoT Platform이 이 요청을 디바이스로 전송하여 하나 이상의 디바이스 속성의 현재 관찰을 취소할 수 있습니다. "fields"가 디바이스 모델의 디바이스 속성 이름 배열입니다. 예를 들어, 값이 "location", "mgmt.firmware" 또는 "mgmt.firmware.state"일 수 있습니다.

source: The "message" field must be specified if "rc" is not 200.
es: El campo "message" se debe especificar si "rc" no es 200.
fr: La zone "message" doit être indiquée si la valeur de "rc" n'est pas 200.
ko: "rc"가 200이 아닌 경우 "message" 필드를 지정해야 합니다.

source: Notify Attribute Changes
es: Notificar cambios en atributos
fr: Notifier les modifications d'attributs
ko: 속성 변경 알림

source: The IoT Platform can make an observation request referring to a specific attribute or set of values. When the value of the attribute or attributes changes, the device must send a notification containing the latest value.
es: IoT Platform puede realizar una solicitud de observación que se refiera a un atributo específico o a conjunto de valores. Cuando el valor del atributo o los atributos cambie, el dispositivo debe enviar una notificación que contenga el valor más reciente.
fr: IoT Platform peut effectuer une demande d'observation applicable à un attribut spécifique ou à un ensemble de valeurs. Lorsque la valeur d'un ou de plusieurs attributs est modifiée, le terminal doit envoyer une notification contenant la valeur la plus récente.
ko: IoT Platform에서는 특정 속성 또는 값 세트를 참조하는 관찰 요청을 작성할 수 있습니다. 속성의 값이 변경되면 디바이스가 최신 값이 포함된 알림을 보내야 합니다.

source: The "field_name" value is the name of the attribute that has changed, the "field_value" is the current value of the attribute. The attribute can be a complex field, if multiple values in a complex field are updated as a result of a single operation, only a single notification message should be sent.
es: El valor "field_name" es el nombre del atributo que se ha modificado; "field_value" es el valor actual del atributo. El atributo puede ser un campo complejo, si varios valores de un campo complejo se actualizan como resultado de un sola operación, solo debe enviarse un mensaje de notificación.
fr: La valeur de "field_name" représente le nom de l'attribut qui a été modifié. La valeur de "field_value" représente la valeur actuelle de l'attribut. L'attribut peut être une zone complexe. Si plusieurs valeurs d'une zone complexe sont mises à jour lors d'une même opération, un seul message de notification doit être envoyé.
ko: "field_name" 값은 변경된 속성의 이름이고 "field_value"는 속성의 현재 값입니다. 속성은 복합 필드일 수 있으며, 복합 필드의 여러 값이 단일 오퍼레이션의 결과로 업데이트되는 경우 단일 알림 메시지만 보내야 합니다.

source: If notify request is processed successfully, "rc" should be set to 200. If the request is not correct, "rc" should be set to 400. If the field specified in the notify request is not being observed, "rc" should be set to 404.
es: Si la solicitud de notificación se procesa correctamente, "rc" debe establecerse en 200. Si la solicitud no es correcta, "rc" debe establecerse en 400. Si no se ha observado el campo especificado en la solicitud de notificación, "rc" debe establecerse en 404.
fr: Si la demande de notification est traitée correctement, la valeur de "rc" doit être 200. Si la demande est incorrecte, la valeur de "rc" doit être 400. Si la zone indiquée dans la demande de notification n'est pas observée, la valeur de "rc" doit être 404.
ko: 알림 요청이 성공적으로 처리되는 경우 "rc"가 200으로 설정되어야 합니다. 요청이 올바르지 않는 경우 "rc"가 400으로 설정되어야 합니다. 알림 요청에 지정된 필드를 관찰 중이 아닌 경우 "rc"가 404로 설정되어야 합니다.

source: 404: The topic name is incorrect, the device is not in the database, or there is no observation for the field reported.
es: 404: El nombre del tema no es correcto, el dispositivo no está en la base de datos o no hay observación para el campo notificado.
fr: 404 : Le nom de sujet est incorrect, le terminal n'est pas dans la base de données ou la zone signalée ne contient aucune observation.
ko: 404: 주제 이름이 올바르지 않거나 디바이스가 데이터베이스에 없거나 보고된 필드에 대해 관찰된 바가 없습니다.

source: 500: An internal error occurred, contact IBM Support.
es: 500: Se ha producido un error interno, póngase en contacto con el soporte de IBM.
fr: 500 : Une erreur interne s'est produite, contactez le support IBM.
ko: 500: 내부 오류가 발생했습니다. IBM 지원 센터에 문의하십시오.
