Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/requests.po
Languages: es, fr, ko

source: Device Management Requests
es: Solicitudes de gestión de dispositivos
fr: Demandes de gestion des terminaux
ko: 디바이스 관리 요청

source: The IoT Platform provides some actions which can be initiated against one or more devices. These actions can be initiated through the dashboard as well as by using the REST API. The available actions are split into two groups, device actions and firmware actions.
es: IoT Platform proporciona algunas acciones que se pueden iniciar respecto a uno o más dispositivos. Estas acciones se pueden iniciar mediante el panel de instrumentos y también mediante la API REST. Las acciones disponibles se dividen en dos grupos, acciones de dispositivo y acciones de firmware.
fr: IoT Platform met à disposition des actions qui peuvent être lancées pour un ou plusieurs terminaux. Ces actions peuvent être initiées depuis le tableau de bord ou à l'aide de l'API REST. Les actions disponibles sont réparties en deux groupes : les actions sur les terminaux et les actions sur le microprogramme.
ko: IoT Platform은 하나 이상의 디바이스에 대해 시작할 수 있는 몇 가지 조치를 제공합니다. 이러한 조치는 REST API 또는 대시보드를 사용하여 시작할 수 있습니다. 사용 가능한 조치는 디바이스 조치 및 펌웨어 조치라는 두 그룹으로 나뉩니다.

source: Initiating Device Management Requests through the dashboard
es: Inicio de solicitudes de gestión de dispositivos mediante el panel de control
fr: Initiation de demandes de gestion des terminaux dans le tableau de bord
ko: 대시보드를 통해 디바이스 관리 요청 시작

source: Requests can be initiated through the dashboard by navigating to the Actions tab of the Devices page. The **Initiate Action** button provides a dialog for selecting an action, picking the devices to take the action against, and specifying any additional parameters that the selected action supports.
es: Se pueden iniciar solicitudes mediante el panel de control navegando a la pestaña Acciones de la página Dispositivos. El botón **Iniciar acción** proporciona un diálogo para seleccionar una acción, seleccionando los dispositivos en los que realizar la acción y especificando los parámetros adicionales que soporte la acción seleccionada.
fr: Les demandes peuvent être initiées via le tableau de bord depuis l'onglet Actions de la page Terminaux. Le bouton **Lancer une action** ouvre une boîte de dialogue dans laquelle vous pouvez sélectionner une action, choisir les terminaux sur lesquels effectuer l'action, et spécifier des paramètres supplémentaires pris en charge par l'action sélectionnée.
ko: 디바이스 페이지의 조치 탭으로 이동하여 대시보드를 통해 요청을 시작할 수 있습니다. **조치 시작** 단추는 조치 선택, 조치를 수행할 디바이스 선택 및 선택한 조치가 지원하는 추가 매개변수 지정에 대한 대화 상자를 제공합니다.

source: Initiating Device Management Requests using the REST API
es: Inicio de solicitudes de gestión de dispositivos utilizando la API REST
fr: Initiation de demandes de gestion des terminaux à l'aide de l'API REST
ko: REST API를 사용하여 디바이스 관리 요청 시작

source: Requests can be initiated using the following REST API:
es: Se pueden iniciar solicitudes utilizando la siguiente API REST:
fr: Les demandes peuvent être initiées à l'aide de l'API REST suivante :
ko: 다음 REST API를 사용하여 요청을 시작할 수 있습니다.

source: For more information on the request body, refer to the `API documentation <../../swagger/v0002.html>`__.
es: Para obtener más información sobre el cuerpo de solicitud, consulte la `Documentación de API <../../swagger/v0002.html>`__.
fr: Pour plus d'informations sur le corps de demande, voir la `documentation de l'API <../../swagger/v0002.html>`__.
ko: 요청 본문에 대한 자세한 정보는 `API 문서 <../../swagger/v0002.html>`__를 참조하십시오.

source: Device Actions
es: Acciones de dispositivo
fr: Actions sur les terminaux
ko: 디바이스 조치

source: A device may specify that it supports device actions when it publishes a manage request. This indicates to the IoT Platform that the device is able to respond to device reboot and device reset actions.
es: Un dispositivo puede especificar que admite acciones de dispositivo cuando publica una solicitud de gestión. Esto indica a IoT Platform que dicho dispositivo puede responder a acciones de rearranque del dispositivo y de restablecimiento del dispositivo.
fr: Un terminal peut spécifier qu'il prend en charge les actions sur les terminaux lorsqu'il publie une demande de gestion. Ainsi, il indique à IoT Platform qu'il peut répondre à des actions de réamorçage et de réinitialisation de terminal.
ko: 디바이스가 관리 요청을 공개할 때 디바이스 조치를 지원하도록 지정할 수 있습니다. 이로 인해 IoT Platform에 디바이스가 디바이스 다시 부팅에 응답하고 디바이스 조치를 재설정할 수 있음이 표시됩니다.

source: Device Actions - Reboot
es: Acciones de dispositivos: Rearrancar
fr: Actions sur les terminaux - Réamorcer
ko: 디바이스 조치 - 다시 부팅

source: The reboot action can be initiated by using either the IoT Platform dashboard, or the REST API.
es: La acción de rearranque se puede iniciar mediante el panel de instrumentos de IoT Platform o la API REST.
fr: L'action de réamorçage peut être lancée depuis le tableau de bord d'IoT Platform ou à l'aide de l'API REST.
ko: IoT Platform 대시보드 또는 REST API를 사용하여 다시 부팅 조치를 시작할 수 있습니다.

source: To initiate a device reboot using the REST API, issue a POST request to:
es: Para iniciar un rearranque de dispositivo utilizando la API REST, emita una solicitud POST para:
fr: Pour initier un réamorçage du terminal à l'aide de l'API REST, émettez une demande POST pour :
ko: REST API를 사용하여 디바이스 다시 부팅을 시작하려면, 다음에 대해 POST 요청을 발행하십시오.

source: The information provided is:
es: La información proporcionada es:
fr: Les informations fournies sont les suivantes :
ko: 제공된 정보는 다음과 같습니다.

source: The action ``device/reboot``
es: La acción ``device/reboot``
fr: L'action ``device/reboot``
ko: 조치 ``device/reboot``

source: A list of devices to reboot, with a maximum of 5000 devices
es: Una lista de dispositivos para rearrancar, con un máximo de 5000 dispositivos.
fr: Liste des terminaux à réamorcer (5000 au maximum)
ko: 최대 5000개의 디바이스를 포함해 다시 부팅할 디바이스의 목록

source: Example device reboot request:
es: Ejemplo de solicitud de rearranque de dispositivo:
fr: Exemple de demande de réamorçage de terminal :
ko: 예제 디바이스 다시 부팅 요청:

source: Once a request has been initiated, an MQTT message will be published to all devices specified in the request body. For each device, a response must be sent back indicating whether or not the reboot action can be initiated. If this operation can be initiated immediately, set ``rc`` to ``202``. If the reboot attempt fails, set ``rc`` to ``500`` and set the ``message`` field accordingly. If reboot is not supported, set ``rc`` to ``501`` and optionally set the ``message`` field accordingly.
es: Una vez que se ha iniciado una solicitud, se publica un mensaje MQTT en todos los dispositivos especificados en al cuerpo de solicitud. Para cada dispositivo, se debe devolver una respuesta que indique si se puede iniciar o no la acción de rearranque. Si esta operación se puede iniciar inmediatamente, establezca 'rc' en '202'. Si el intento de rearranque fracasa, establezca 'rc' en '500' y establezca el campo 'message' como corresponda. Si el rearranque no se admite, establezca 'rc' en '501' y, opcionalmente, establezca el campo 'message' como corresponda.
fr: Une fois qu'une demande a été initiée, un message MQTT est publié sur tous les terminaux spécifiés dans le corps de demande. Pour chaque terminal, une réponse indiquant si l'action de réamorçage peut être lancée ou non doit être renvoyée. Si cette opération peut être initiée immédiatement, associez ``rc`` à la valeur ``202``. Si la tentative de réamorçage échoue, associez ``rc`` à la valeur ``500`` et définissez la zone ``message`` en conséquence. Si le réamorçage n'est pas pris en charge, associez ``rc`` à la valeur ``501`` et si vous le souhaitez, définissez la zone ``message`` en conséquence.
ko: 요청이 시작되면 요청 본문에서 지정된 모든 디바이스로 MQTT 메시지가 공개됩니다. 각 디바이스의 경우 다시 부팅 조치를 시작할 수 있는지 여부를 응답에 표시하여 다시 발송해야 합니다. 오퍼레이션을 즉시 시작할 수 있는 경우 ``rc``를 ``202``로 설정하십시오. 다시 부팅 시도에 실패하는 경우 ``rc``를 ``500``으로 설정하고 ``message`` 필드를 이에 따라 설정하십시오. 다시 부팅이 지원되지 않는 경우 ``rc``를 ``501``로 설정하고 선택적으로 ``message`` 필드를 이에 따라 설정하십시오.

source: The reboot action is considered complete when the device sends a Manage device request following its reboot.
es: La acción de rearranque se considera completada cuando el dispositivo envía una solicitud de gestión de dispositivo tras el reinicio.
fr: L'action de réamorçage est considérée comme terminée lorsque le terminal envoie une demande de gestion de terminal après son réamorçage.
ko: 디바이스가 다시 부팅에 이어 디바이스 관리 요청을 보내면 다시 부팅 조치가 완료된 것으로 간주됩니다.

source: Topic
es: Tema
fr: Sujet
ko: 주제

source: The server publishes this request to a device on the following topic:
es: El servidor publica esta solicitud en un dispositivo del tema siguiente:
fr: Le serveur publie cette demande sur un terminal dans le sujet suivant :
ko: 서버는 이 요청을 다음 주제의 디바이스에 공개합니다.

source: Message format
es: Formato de mensaje
fr: Format du message
ko: 메시지 형식

source: Request Format:
es: Formato de solicitud:
fr: Format de la demande :
ko: 요청 형식:

source: Response Format:
es: Formato de respuesta:
fr: Format de la réponse :
ko: 응답 형식:

source: Device Actions - Factory Reset
es: Acciones de dispositivos: Restablecimiento de fábrica
fr: Actions sur les terminaux - Réinitialiser avec les paramètres d'usine
ko: 디바이스 조치 - 팩토리 재설정

source: The factory reset action can be initiated by using either the IoT Platform dashboard, or the REST API.
es: La acción de restablecimiento de fábrica se puede iniciar mediante el panel de instrumentos de IoT Platform o la API REST.
fr: L'action de réinitialisation des paramètres d'usine peut être initiée depuis le tableau de bord d'IoT Platform ou à l'aide de l'API REST.
ko: IoT Platform 대시보드 또는 REST API를 사용하여 팩토리 재설정 조치를 시작할 수 있습니다.

source: To initiate a device factory reset using the REST API, issue a POST request to:
es: Para iniciar un restablecimiento de fábrica de dispositivo utilizando la API REST, emita una solicitud POST para:
fr: Pour initier une réinitialisation des paramètres d'usine à l'aide de l'API REST, émettez une demande POST pour :
ko: REST API를 사용하여 디바이스 팩토리 재설정을 시작하려면, 다음에 대해 POST 요청을 발행하십시오.

source: The action ``device/factoryReset``
es: La acción ``device/factoryReset``
fr: L'action ``device/factoryReset``
ko: 조치 ``device/factoryReset``

source: A list of devices to reset, with a maximum of 5000 devices
es: Una lista de dispositivos a restablecer, con un máximo de 5000 dispositivos
fr: La liste des terminaux à réinitialiser (5000 maximum)
ko: 최대 5000개의 디바이스를 포함해 재설정할 디바이스의 목록

source: Example device reset request:
es: Ejemplo de solicitud de restablecimiento de dispositivo:
fr: Exemple de demande de réinitialisation de terminal :
ko: 예제 디바이스 재설정 요청:

source: Once a request has been initiated, an MQTT message will be published to all devices specified in the request body. For each device, a response must be sent back indicating whether or not the factory reset action can be initiated. The response code should be set to ``202`` if this action can be initiated immediately. If the factory reset attempt fails, set ``rc`` to ``500`` and set the ``message`` field accordingly. If the factory reset action is not supported, set ``rc`` to ``501`` and optionally set the ``message`` field accordingly.
es: Una vez que se haya iniciado una solicitud, se publica un mensaje MQTT en todos los dispositivos especificados en al cuerpo de solicitud. Para cada dispositivo, se debe devolver una respuesta que indique si se puede iniciar o no la acción de restablecimiento de fábrica. Si esta acción se puede iniciar inmediatamente, el código de respuesta debería establecerse en ``202``. Si el intento de restablecimiento de fábrica fracasa, establezca 'rc' en '500' y establezca el campo 'message' como corresponda. Si la acción de restablecimiento de fábrica no se admite, establezca 'rc' en '501' y, opcionalmente, establezca el campo 'message' como corresponda.
fr: Une fois qu'une demande a été initiée, un message MQTT est publié sur tous les terminaux spécifiés dans le corps de demande. Pour chaque terminal, une réponse indiquant si l'action de réinitialisation des paramètres d'usine peut être lancée ou non doit être renvoyée. Le code de réponse doit avoir pour valeur ``202`` si cette action peut être lancée immédiatement. Si la réinitialisation des paramètres d'usine échoue, associez ``rc`` à la valeur ``500`` et définissez la zone ``message`` en conséquence. Si l'action de réinitialisation des paramètres d'usine n'est pas prise en charge, associez ``rc`` à la valeur ``501`` et si vous le souhaitez, définissez la zone ``message`` en conséquence.
ko: 요청이 시작되면 요청 본문에서 지정된 모든 디바이스로 MQTT 메시지가 공개됩니다. 각 디바이스의 경우 팩토리 재설정 조치를 시작할 수 있는지 여부를 응답에 표시하여 다시 발송해야 합니다. 이 조치를 즉시 시작할 수 있는 경우 응답 코드가 ``202``여야 합니다. 팩토리 재설정 시도에 실패하는 경우 ``rc``를 ``500``으로 설정하고 ``message`` 필드를 이에 따라 설정하십시오. 팩토리 재설정 조치가 지원되지 않는 경우 ``rc``를 ``501``로 설정하고 선택적으로 ``message`` 필드를 이에 따라 설정하십시오.

source: The factory reset action is considered complete when the device sends a Manage device request following its factory reset.
es: La acción de restablecimiento de fábrica se considera completada cuando el dispositivo envía una solicitud de gestión de dispositivo tras el restablecimiento de fábrica.
fr: L'action de réinitialisation des paramètres d'usine est considérée comme terminée lorsque le terminal envoie une demande de gestion de terminal après la réinitialisation des paramètres d'usine.
ko: 디바이스가 팩토리 재설정에 이어 디바이스 관리 요청을 보내면 팩토리 재설정 조치가 완료된 것으로 간주됩니다.

source: Firmware Actions
es: Acciones de firmware
fr: Actions sur le microprogramme
ko: 펌웨어 조치

source: The firmware level currently known to be on a given device is stored in the ``deviceInfo.fwVersion`` attribute. The ``mgmt.firmware`` attributes are used to perform a firmware update and observe its status.
es: El nivel de firmware que se sabe que existe actualmente en un determinado dispositivo se almacena en el atributo 'deviceInfo.fwVersion'. Los atributos 'mgmt.firmware' se utilizan para realizar una actualización de firmware y observar su estado.
fr: Le niveau du microprogramme actuellement identifié sur un terminal est stocké dans l'attribut ``deviceInfo.fwVersion``. Les attributs ``mgmt.firmware`` sont utilisés pour effectuer une mise à jour du microprogramme et observer son statut.
ko: 제공된 디바이스에 있는 것으로 현재 알려진 펌웨어 레벨이 ``deviceInfo.fwVersion`` 속성에 저장됩니다. ``mgmt.firmware`` 속성은 펌웨어 업데이트를 수행하고 상태를 관찰하는 데 사용됩니다.

source: The managed device must support observation of the ``mgmt.firmware`` attribute in order to support firmware actions.
es: El dispositivo gestionado debe admitir la observación del atributo 'mgmt.firmware' para admitir acciones de firmware.
fr: Le terminal géré doit prendre en charge l'observation de l'attribut ``mgmt.firmware`` pour permettre l'exécution des actions sur le microprogramme.
ko: 관리 디바이스는 펌웨어 조치를 지원하기 위해 ``mgmt.firmware`` 속성의 관찰을 지원해야 합니다.

source: The firmware update process is separated into two distinct actions, Downloading Firmware, and Updating Firmware. The status of each of these actions is stored in a separate attribute on the device. The ``mgmt.firmware.state`` attribute describes the status of the firmware download. The possible values for ``mgmt.firmware.state`` are:
es: El proceso de actualización del firmware se divide en dos acciones distintas: descarga de firmware y actualización de firmware. El estado de cada una de estas acciones se almacena en un atributo aparte en el dispositivo. El atributo 'mgmt.firmware.state' describe el estado de la descarga del firmware. Los valores posibles de 'mgmt.firmware.state' son:
fr: La procédure de mise à jour du microprogramme se compose de deux actions distinctes, à savoir le téléchargement et la mise à jour du microprogramme. Le statut de chacune de ces actions est stocké dans un attribut distinct sur le terminal. L'attribut ``mgmt.firmware.state`` indique le statut du téléchargement d'un microprogramme. Les valeurs admises pour ``mgmt.firmware.state``sont les suivantes :
ko: 펌웨어 업데이트 프로세스가 별개의 2가지 조치인 펌웨어 다운로드 및 펌웨어 업데이트로 분리됩니다. 이러한 조치 각각의 상태는 디바이스에서 별도의 속성에 저장됩니다. ``mgmt.firmware.state`` 속성이 펌웨어 다운로드의 상태에 대해 설명합니다. ``mgmt.firmware.state``의 가능한 값은 다음과 같습니다.

source: Value
es: Valor
fr: Valeur
ko: 값

source: State
es: Estado
fr: Etat
ko: 상태

source: Meaning
es: Significado
fr: Signification
ko: 의미

source: Idle
es: Inactivo
fr: Inactif
ko: 유휴

source: The device is currently not in the process of downloading firmware
es: El dispositivo no está actualmente en el proceso de descarga de firmware
fr: Le terminal n'est pas en train de télécharger le microprogramme.
ko: 디바이스가 현재 펌웨어를 다운로드하는 과정에 있지 안습니다.

source: Downloading
es: Descargando
fr: Téléchargement en cours
ko: 다운로드 중

source: The device is currently downloading firmware
es: El dispositivo está actualmente descargando el firmware
fr: Le terminal est en train de télécharger le microprogramme
ko: 디바이스가 현재 펌웨어를 다운로드 중입니다.

source: Downloaded
es: Descargado
fr: Téléchargé
ko: 다운로드됨

source: The device has successfully downloaded a firmware update and it is ready to install
es: El dispositivo ha descargado correctamente una actualización de firmware y está listo para instalarla
fr: Le terminal a correctement téléchargé une mise à jour du microprogramme et est prêt à l'installer
ko: 디바이스가 펌웨어 업데이트를 성공적으로 다운로드했으므로 설치할 수 있습니다.

source: The ``mgmt.firmware.updateStatus`` attribute describes the status of firmware update. The possible values for ``mgmt.firmware.updateStatus`` are:
es: El atributo 'mgmt.firmware.updateStatus' describe el estado de la actualización del firmware. Los valores posibles de ``mgmt.firmware.updateStatus`` son:
fr: L'attribut ``mgmt.firmware.updateStatus`` décrit le statut de la mise à jour du microprogramme. Les valeurs admises pour ``mgmt.firmware.updateStatus``sont les suivantes :
ko: ``mgmt.firmware.updateStatus`` 속성이 펌웨어 업데이트의 상태에 대해 설명합니다. ``mgmt.firmware.updateStatus``에 대해 가능한 값은 다음과 같습니다.

source: Success
es: Satisfactorio
fr: Réussite
ko: 성공

source: The firmware has been successfully updated
es: El firmware se ha actualizado satisfactoriamente
fr: Le microprogramme a été correctement mis à jour
ko: 펌웨어가 성공적으로 업데이트되었습니다.

source: In Progress
es: En curso
fr: En cours
ko: 진행 중

source: The firmware update has been initiated but is not yet complete
es: La actualización de firmware se ha iniciado pero no ha finalizado todavía
fr: La mise à jour du microprogramme a été lancée mais elle n'est pas encore terminée
ko: 펌웨어 업데이트가 시작되었으나 아직 완료되지 않았습니다.

source: Out of Memory
es: Sin memoria
fr: Mémoire insuffisante
ko: 메모리 부족

source: An out of memory condition has been detected during the operation.
es: Se ha detectado una condición de falta de memoria durante la operación.
fr: Le système a détecté une quantité de mémoire insuffisante lors de l'opération
ko: 메모리 부족 조건이 오퍼레이션 중 발견되었습니다.

source: Connection Lost
es: Se ha perdido la conexión
fr: Connexion perdue
ko: 연결 유실

source: The connection was lost during the firmware download
es: La conexión se ha perdido durante la descarga del firmware
fr: La connexion a été perdue lors du téléchargement du microprogramme
ko: 연결이 펌웨어 다운로드 중 유실되었습니다.

source: Verification Failed
es: La verificación ha fallado
fr: Echec de la vérification
ko: 검증 실패

source: The firmware did not pass verification
es: El firmware no han superado la verificación
fr: Le microprogramme a échoué au test de vérification
ko: 펌웨어가 검증을 통과하지 못했습니다.

source: Unsupported Image
es: Imagen no soportada
fr: Image non prise en charge
ko: 지원되지 않는 이미지

source: The downloaded firmware image is not supported by the device
es: El dispositivo no admite la imagen de firmware descargada
fr: L'image du microprogramme téléchargée n'est pas prise en charge par le terminal
ko: 다운로드된 펌웨어 이미지가 디바이스에서 지원되지 않습니다.

source: Invalid URI
es: URI no válido
fr: URI non valide
ko: 올바르지 않은 URI

source: The device could not download the firmware from the provided URI
es: El dispositivo no ha podido descargar el firmware desde el URI proporcionado
fr: Le terminal n'a pas pu télécharger le microprogramme à partir de l'URI indiqué
ko: 디바이스가 제공된 URI에서 펌웨어를 다운로드할 수 없습니다.

source: Firmware Actions - Download
es: Acciones del firmware: Descargar
fr: Actions sur le microprogramme - Télécharger
ko: 펌웨어 조치 - 다운로드

source: The Download Firmware action can be initiated by using either the IoT Platform dashboard, or the REST API.
es: La acción Descargar firmware se puede iniciar mediante el panel de instrumentos de IoT Platform o la API REST.
fr: L'action Télécharger le microprogramme peut être lancée à l'aide du tableau de bord IoT Platform ou de l'API REST.
ko: IoT Platform 대시보드 또는 REST API를 사용하여 펌웨어 다운로드 조치를 시작할 수 있습니다.

source: To initiate a firmware download using the REST API, issue a POST request to:
es: Para iniciar una descarga de firmware utilizando la API REST, emita una solicitud POST para:
fr: Pour initier un téléchargement de microprogramme à l'aide de l'API REST, émettez une demande POST pour :
ko: REST API를 사용하여 펌웨어 다운로드를 시작하려면, 다음에 대해 POST 요청을 발행하십시오.

source: The action ``firmware/download``
es: La acción 'firmware/download'
fr: L'action ``firmware/download``
ko: 조치 ``firmware/download``

source: The URI for the firmware image
es: El URI de la imagen de firmware
fr: L'URI de l'image du microprogramme
ko: 펌웨어 이미지의 URI

source: A list of devices to receive the image, with a maximum of 5000 devices
es: Una lista de dispositivos para recibir la imagen, con un máximo de 5000 dispositivos
fr: Une liste de terminaux qui doivent recevoir l'image (5000 terminaux au maximum)
ko: 최대 5000개의 디바이스가 포함되어 이미지를 수신할 디바이스의 목록

source: Optional verifier string to validate the image
es: Verificador opcional de serie para validar la imagen
fr: Une chaîne de vérification facultative permettant de valider l'image
ko: 이미지를 유효성 검증할 선택적 검사기 문자열

source: Optional firmware name
es: Nombre de firmware opcional
fr: Le nom du microprogramme (facultatif)
ko: 선택적 펌웨어 이름

source: Optional firmware version
es: Versión de firmware opcional
fr: La version du microprogramme (facultatif)
ko: 선택적 펌웨어 버전

source: Example firmware download request on which all the following example messages are based:
es: Solicitud de descarga de firmware de ejemplo en la que se basan todos los mensajes de ejemplo siguientes:
fr: Exemple de demande de téléchargement du microprogramme sur lequel tous les exemples de message suivants sont basés :
ko: 모든 다음 예제 메시지의 기반이 되는 예제 펌웨어 다운로드 요청:

source: The device management server in the IoT Platform uses the Device Management Protocol to send a request to the devices, initiating the firmware download. There are multiple steps:
es: El servidor de gestión de dispositivos de IoT Platform utiliza el protocolo de gestión de dispositivos para enviar una solicitud a los dispositivos e iniciar la descarga del firmware. Hay varios pasos:
fr: Le serveur de gestion des terminaux IoT Platform utilise le protocole de gestion des terminaux pour envoyer une demande aux terminaux et lancer le téléchargement du microprogramme. Cette procédure comprend plusieurs étapes :
ko: IoT Platform의 디바이스 관리 서버가 디바이스 관리 프로토콜을 사용하여 디바이스로 요청을 전송하여 펌웨어 다운로드를 시작합니다. 다음과 같이 여러 단계가 있습니다.

source: Firmware details update request sent on topic ``iotdm-1/device/update``:
es: Los detalles de firmware actualizan la solicitud enviada en el tema ``iotdm-1/device/update``:
fr: Demande de mise à jour des détails du microprogramme envoyée dans le sujet ``iotdm-1/device/update`` :
ko: 주제 ``iotdm-1/device/update``에 대해 전송된 펌웨어 세부사항 업데이트 요청:
