Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/requests.po
Languages: es, fr, ko

source: If firmware update attempt fails, ``rc`` should be set to ``500`` and the ``message`` field can optionally be set to contain relevant information.
es: Si el intento de actualización de firmware falla, 'rc' debe establecerse en '500' y el campo 'message' se puede configurar de forma opcional para que contenga información pertinente.
fr: Si la tentative de mise à jour du microprogramme échoue, ``rc`` doit correspondre à la valeur ``500`` et la zone ``message`` peut éventuellement être définie pour inclure des informations pertinentes.
ko: 펌웨어 업데이트 시도에 실패한 경우 ``rc``가 ``500``으로 설정되어야 하고 ``message`` 필드가 관련 정보를 포함하도록 선택적으로 설정될 수 있습니다.

source: If firmware update is not supported ``rc`` should be set to ``501`` and the ``message`` field can optionally be set to contain relevant information.
es: Si la actualización de firmware no es compatible, 'rc' debe establecerse en '501' y el campo 'message' se puede configurar de forma opcional para que contenga información pertinente.
fr: Si la mise à jour du microprogramme n'est pas prise en charge, ``rc`` doit être associé à la valeur ``501`` et la zone ``message`` peut éventuellement être définie pour inclure des informations pertinentes.
ko: 펌웨어 업데이트가 지원되지 않는 경우 ``rc``가 ``501``로 설정되어야 하고 ``message`` 필드가 관련 정보를 포함하도록 선택적으로 설정될 수 있습니다.

source: If ``mgmt.firmware.state`` is not ``2`` (Downloaded), an error should be reported with ``rc`` set to ``400`` and an optional message text.
es: Si 'mgmt.firmware.state' no es '2' (Descargado), debe notificarse un error con 'rc' establecido en '400' y un mensaje de texto opcional.
fr: Si ``mgmt.firmware.state`` ne correspond pas à ``2`` (Téléchargé), une erreur doit être signalée avec une zone ``rc`` correspondant à ``400`` et éventuellement le texte d'un message.
ko: ``mgmt.firmware.state``가 ``2``(다운로드됨)가 아닌 경우 오류가 ``400``으로 설정된 ``rc`` 및 선택적 메시지 텍스트와 함께 보고되어야 합니다.

source: Otherwise, ``mgmt.firmware.updateStatus`` should be set to ``1`` (In Progress) and firmware installation should start.
es: De lo contrario, 'mgmt.firmware.updateStatus' debe establecerse en '1' (En curso) y la instalación de firmware debe comenzar.
fr: Sinon, ``mgmt.firmware.updateStatus`` doit correspondre à la valeur ``1`` (En cours) et l'installation du microprogramme doit commencer.
ko: 그렇지 않으면, ``mgmt.firmware.updateStatus``가 ``1``(진행 중)로 설정되어야 하고 펌웨어 설치가 시작되어야 합니다.

source: If firmware installation fails, ``mgmt.firmware.updateStatus`` should be set to either:
es: Si falla la instalación de firmware, 'mgmt.firmware.updateStatus' se debe establecer en:
fr: Si l'installation du microprogramme échoue, ``mgmt.firmware.updateStatus`` doit correspondre à l'une des valeurs suivantes :
ko: 펌웨어 설치에 실패하는 경우 ``mgmt.firmware.updateStatus``가 다음 중 하나로 설정되어야 합니다.

source: ``2`` (Out of Memory)
es: '2' (Sin memoria)
fr: ``2`` (Mémoire insuffisante)
ko: ``2``(메모리 부족)

source: ``5`` (Unsupported Image)
es: '5' (Imagen no soportada)
fr: ``5`` (Image non prise en charge)
ko: ``5``(지원되지 않는 이미지)

source: All fields under ``mgmt.firmware`` must be set at the same time, so that if there is a current observation for ``mgmt.firmware``, only a single notify message is sent.
es: Todos los campos en 'mgmt.firmware' deben establecerse al mismo tiempo para que si hay una observación actual para 'mgmt.firmware', solo se envía un mensaje de notificación.
fr: Toutes les zones figurant sous ``mgmt.firmware`` doivent être définies au même moment afin d'envoyer un seul message de notification lorsqu'il y a une observation en cours pour ``mgmt.firmware``.
ko: ``mgmt.firmware``에 대한 현재 관찰이 있는 경우 하나의 알림 메시지만 전송되도록 ``mgmt.firmware`` 아래의 모든 필드가 동시에 설정되어야 합니다.
