Repository: IceRage/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/requests.po
Languages: es, fr, ko

source: This request let the device validate if the requested firmware differs from the currently installed firmware. If there is a difference, set ``rc`` to ``204``, which translates to the status ``Changed``. The following example shows which message is to be expected for the previously sent example firmware download request and what response should be sent, when a difference is detected:
es: Esta solicitud permite validar el dispositivo si el firmware solicitado varía del firmware instalado actualmente. Si existe alguna diferencia, establezca ``rc`` en ``204``, que convierte el estado en ``Changed``. El siguiente ejemplo muestra qué mensaje se espera para la solicitud de descarga de firmware de ejemplo enviada previamente y qué respuesta debe enviarse, cuando se detecta una diferencia:
fr: Cette demande laisse le terminal confirmer si le microprogramme demandé est différent du microprogramme actuellement installé. S'ils sont différents, ``rc`` doit correspondre à ``204`` pour faire passer le terminal à l'état ``Changed`` (Modifié). L'exemple ci-dessous indique le message attendu pour l'exemple de demande de téléchargement du microprogramme qui a été précédemment envoyée, ainsi que la réponse à transmettre lorsqu'une différence est détectée :
ko: 이 요청은 요청된 펌웨어가 현재 설치된 펌웨어와 다른지 디바이스가 유효성 검증하도록 합니다. 다른 경우 ``rc``를 ``204``로 설정하십시오. 이는 상태 ``변경됨``으로 변환됩니다. 다음 예제에서는 이전에 전송된 예제 펌웨어 다운로드 요청에 대해 예상되는 메시지와 전송되어야 하는 응답, 차이점이 발견되는 시기를 보여줍니다.

source: This response will trigger the next request.
es: Esta respuesta desencadenará la siguiente solicitud.
fr: Cette réponse déclenche la demande suivante.
ko: 이 응답으로 그 다음 요청이 트리거됩니다.

source: Observation request for firmware download status ``iotdm-1/observe``:
es: Solicitud de observación para el estado de descarga de firmware ``iotdm-1/observe``:
fr: Demande d'observation du statut de téléchargement du microprogramme ``iotdm-1/observe`` :
ko: 펌웨어 다운로드 상태 ``iotdm-1/observe``의 관찰 요청:

source: Verifies if the device is ready to start the firmware download. When the download can be started immediately, set ``rc`` to ``200`` (``Ok``), ``mgmt.firmware.state`` to ``0`` (``Idle``) and ``mgmt.firmware.updateStatus`` to ``0`` (``Idle``). Here an example exchange between the IoT Platform and device:
es: Verifica si el dispositivo está listo para iniciar la descarga de firmware. Cuando la descarga puede iniciarse inmediatamente, establezca ``rc`` en ``200`` (``Aceptar``), ``mgmt.firmware.state`` en ``0`` (``Inactivo``) y ``mgmt.firmware.updateStatus`` en ``0`` (``Inactivo``). A continuación se muestra un intercambio de ejemplo entre IoT Platform y el dispositivo:
fr: Vérifie si le terminal est prêt à lancer le téléchargement du microprogramme. Lorsque le téléchargement peut être lancé immédiatement, ``rc`` doit correspondre à ``200`` (``Ok``), ``mgmt.firmware.state`` à ``0`` (``Actif``) et ``mgmt.firmware.updateStatus`` à ``0`` (``Inactif``). Voici un exemple d'échange entre IoT Platform et le terminal :
ko: 디바이스가 펌웨어 다운로드를 시작할 수 있는지 확인합니다. 다운로드를 즉시 시작할 수 있는 경우 ``rc``를 ``200``(``확인``)으로 설정하고 ``mgmt.firmware.state``를 ``0`` (``유휴`)으로 설정하며 ``mgmt.firmware.updateStatus``를 ``0``(``유휴``)으로 설정하십시오. 다음은 IoT Platform과 디바이스 간 교환 예입니다.

source: This exchange will trigger the last step.
es: Este intercambio desencadenará el último paso.
fr: Cet échange déclenche la dernière étape.
ko: 이 교환으로 마지막 단계가 트리거됩니다.

source: Initiate the download request sent on topic ``iotdm-1/mgmt/initiate/firmware/download``:
es: Iniciar la solicitud de descarga en el tema ``iotdm-1/mgmt/initiate/firmware/download``:
fr: Demande de lancement du téléchargement envoyée dans le sujet ``iotdm-1/mgmt/initiate/firmware/download``:
ko: 주제 ``iotdm-1/mgmt/initiate/firmware/download``에 대해 전송된 다운로드 요청을 시작하십시오.

source: This request tells a device to actually start the firmware download. If the action can be initiated immediately, set ``rc`` to ``202``. Here an example:
es: Esta solicitud indica a un dispositivo que inicie la descarga de firmware. Si la acción se puede iniciar inmediatamente, establezca 'rc' en '202'. A continuación, se muestra un ejemplo:
fr: Cette demande indique à un terminal de lancer le téléchargement du microprogramme. Si l'action peut être lancée immédiatement, ``rc`` doit correspondre à la valeur ``202``. Exemple :
ko: 이 요청은 디바이스가 펌웨어 다운로드를 실제로 시작하도록 요청합니다. 조치를 즉시 시작할 수 있는 경우 ``rc``를 ``202``로 설정하십시오. 예를 들어, 다음과 같습니다.

source: After a firmware download is initiated this way, the device needs to report to the IoT Platform the status of the download. This is possible by publishing a message to the ``iotdevice-1/notify``-topic, where the ``mgmt.firmware.state`` is set to either ``1`` (``Downloading``) or ``2`` (``Downloaded``). Here some examples:
es: Una vez que se inicia una descarga de firmware de esta forma, el dispositivo debe notificar a IoT Platform el estado de la descarga. Para ello, se publica un mensaje en el tema ``iotdevice-1/notify``, donde ``mgmt.firmware.state`` se establece en ``1`` (``Descargando``) o ``2`` (``Descargado``). A continuación, se muestran algunos ejemplos:
fr: Lorsque le téléchargement du microprogramme est lancé de cette manière, le terminal doit signaler le statut du téléchargement à IoT Platform. Cette opération peut être effectuée en publiant un message dans le sujet ``iotdevice-1/notify``-, où ``mgmt.firmware.state`` correspond à ``1`` (``Téléchargement en cours``) ou à ``2`` (``Téléchargé``). Exemples :
ko: 펌웨어 다운로드가 이런 방식으로 시작되면 디바이스가 다운로드 상태를 IoT Platform에 보고해야 합니다. 이는 ``iotdevice-1/notify``-topic에 메시지를 공개하여 가능한데, 여기서 ``mgmt.firmware.state``가 ``1``(``다운로드 중``) 또는 ``2``(``다운로드됨``)로 설정됩니다. 일부 예제는 다음과 같습니다.

source: After the notification with ``mgmt.firmware.state`` set to ``2`` was published, a request will be triggered on the ``iotdm-1/cancel``-topic, which cancels the observation of the ``mgmt.firmware`` field. After a response with ``rc`` set to ``200`` was sent the firmware download is completed. Example:
es: Después de que se haya publicado la notificación con ``mgmt.firmware.state`` establecido en ``2``, se desencadenará una solicitud en el tema ``iotdm-1/cancel``, que cancela la observación del campo ``mgmt.firmware``. Una vez enviada una respuesta con ``rc`` establecido en ``200``, la descarga de firmware está completa. Ejemplo:
fr: Après la publication d'une notification où ``mgmt.firmware.state`` a pour valeur ``2``, une demande est déclenchée dans le sujet ``iotdm-1/cancel`, qui annule l'observation de la zone``mgmt.firmware``. Lorsqu'une réponse associée au code retour ``rc`` ``200`` est envoyée, la demande de téléchargement du microprogramme est terminée. Exemple :
ko: ``mgmt.firmware.state``가 ``2``로 설정되어 알림이 공개된 후 요청이 ``iotdm-1/cancel``-topic에서 트리거되는데, 이는 ``mgmt.firmware`` 필드의 관찰을 취소합니다. ``rc``가 ``200``으로 설정된 응답이 전송된 후 펌웨어 다운로드가 완료됩니다. 예제:

source: Useful information regarding error handling:
es: Información útil sobre el manejo de errores:
fr: Informations utiles pour le traitement des erreurs :
ko: 오류 처리에 관한 유용한 정보:

source: If ``mgmt.firmware.state`` is not ``0`` ("Idle") an error should be reported with response code ``400``, and an optional message text.-
es: Si 'mgmt.firmware.state' no es '00 ("Inactivo"), es necesario notificar un error con el código de respuesta '400' y un mensaje de texto opcional.-
fr: Si ``mgmt.firmware.state`` ne correspond pas à ``0`` ("Inactif"), une erreur doit être signalée avec le code de réponse ``400``et éventuellement le texte d'un message.-
ko: ``mgmt.firmware.state``가 ``0``("유휴")이 아니면 응답 코드 ``400`` 및 선택적 메시지 텍스트와 함께 오류가 보고되어야 합니다.-

source: If ``mgmt.firmware.uri`` is not set or is not a valid URI, set ``rc`` to ``400``.
es: Si no se establece 'mgmt.firmware.uri' no es un URI válido, establezca 'rc' en '400'.
fr: Si ``mgmt.firmware.uri`` n'est pas défini ou n'est pas un URI valide, associez ``rc`` à la valeur ``400``.
ko: ``mgmt.firmware.uri``가 설정되지 않았거나 올바른 URI가 아닌 경우 ``rc``를 ``400``으로 설정하십시오.

source: If firmware download attempt fails, set ``rc`` to ``500`` and optionally set ``message`` accordingly.
es: Si falla el intento de descarga, establezca 'rc' en '500' y opcionalmente configure 'message' en consecuencia.
fr: Si la tentative de téléchargement du microprogramme échoue, associez ``rc`` à la valeur ``500`` et définissez éventuellement la zone ``message`` en conséquence.
ko: 펌웨어 다운로드 시도에 실패하는 경우 ``rc``를 ``500``으로 설정하고 선택적으로 ``message``를 그에 따라 설정하십시오.

source: If firmware download is not supported, set ``rc`` to ``501`` and optionally set ``message`` accordingly.
es: Si la descarga de firmware no es compatible, establezca 'rc' en '501' y opcionalmente configure 'message' en consecuencia.
fr: Si le téléchargement du microprogramme n'est pas pris en charge, associez ``rc`` à la valeur ``501`` et définissez éventuellement la zone ``message`` en conséquence.
ko: 펌웨어 다운로드가 지원되지 않는 경우 ``rc``를 ``501``로 설정하고 선택적으로 ``message``를 그에 따라 설정하십시오.

source: When an excecute request is received by the device, ``mgmt.firmware.state`` should change from ``0`` (Idle) to ``1`` (Downloading).
es: Cuando el dispositivo recibe una solicitud de ejecución, 'mgmt.firmware.state' debe cambiar de '0' (Inactivo) a '1' (Descargando).
fr: Lorsqu'une demande d'exécution est reçue par le terminal, ``mgmt.firmware.state`` doit passer de ``0`` (Inactif) à ``1`` (Téléchargement en cours).
ko: 실행 요청이 디바이스에서 수신되면 ``mgmt.firmware.state``가 ``0``(유휴)에서 ``1``(다운로드 중)로 변경되어야 합니다.

source: When the download has been completed successfully, ``mgmt.firmware.state`` should be set to ``2`` (Downloaded).
es: Cuando la descarga se ha completado satisfactoriamente, 'mgmt.firmware.state' debe establecerse en '2' (Descargado).
fr: Lorsque le téléchargement s'est déroulé correctement, ``mgmt.firmware.state`` doit correspondre à la valeur ``2`` (Téléchargé).
ko: 다운로드가 성공적으로 완료되었으면 ``mgmt.firmware.state``가 ``2``(다운로드됨)로 설정되어야 합니다.

source: If an error occurrs during download ``mgmt.firmware.state`` should be set to ``0`` (Idle) and ``mgmt.firmware.updateStatus`` should be set to one of the error status values:
es: Si se ha producido un error durante la descarga 'mgmt.firmware.state' debe establecerse en '0' (Inactivo) y 'mgmt.firmware.updateStatus' debe definirse con uno de los valores de estado de error:
fr: Si une erreur se produit lors du téléchargement, ``mgmt.firmware.state`` doit être associé à la valeur ``0`` (Inactif) et ``mgmt.firmware.updateStatus`` doit être associé à l'une des valeurs de statut d'erreur suivantes :
ko: 다운로드 중 오류가 발생하는 경우 ``mgmt.firmware.state``가 ``0``(유휴)으로 설정되어야 하고 ``mgmt.firmware.updateStatus``가 오류 상태 값 중 하나로 설정되어야 합니다.

source: 2 (Out of Memory)
es: 2 (Sin memoria)
fr: 2 (Mémoire insuffisante)
ko: 2(메모리 부족)

source: 3 (Connection Lost)
es: 3 (Se ha perdido la conexión)
fr: 3 (Connexion perdue)
ko: 3(연결 유실)

source: 6 (Invalid URI)
es: 6 (URI no válido)
fr: 6 (URI non valide)
ko: 6(올바르지 않은 URI)

source: If a firmware verifier has been set, the device should attempt to verify the firmware image. If the image verification fails, ``mgmt.firmware.state`` should be set to ``0`` (Idle) and ``mgmt.firmware.updateStatus`` should be set to the error status value ``4`` (Verification Failed).
es: Si se ha establecido un verificador de firmware, el dispositivo debe intentar verificar la imagen de firmware. Si la verificación falla, 'mgmt.firmware.state' debe establecerse en '0' (Inactivo) y 'mgmt.firmware.updateStatus' debe establecerse en el valor de estado de error '4' (Error de verificación).
fr: Si une vérification du microprogramme a été définie, le terminal doit essayer de vérifier l'image du microprogramme. Si la vérification de l'image échoue, ``mgmt.firmware.state`` doit correspondre à la valeur ``0`` (Inactif) et ``mgmt.firmware.updateStatus`` doit correspondre à la valeur du statut d'erreur ``4`` (Echec de la vérification).
ko: 펌웨어 검사기가 설정된 경우 디바이스가 펌웨어 이미지를 확인하려고 시도해야 합니다. 이미지 검증에 실패하는 경우 ``mgmt.firmware.state``가 ``0``(유휴)으로 설정되어야 하고 ``mgmt.firmware.updateStatus``가 오류 상태 값 ``4``(검증 실패)로 설정되어야 합니다.

source: Firmware Actions - Update
es: Acciones del firmware: Actualizar
fr: Actions sur le microprogramme - Mettre à jour
ko: 펌웨어 조치 - 업데이트

source: The firmware update action supports 2 scenarios:
es: La acción de actualización de firmware soporta 2 escenarios:
fr: L'action de mise à jour du microprogramme prend en charge deux scénarios :
ko: 펌웨어 업데이트 조치는 2가지 시나리오를 지원합니다.

source: Installing firmware that is already on the device from a previously completed firmware download request, or
es: Instalación de firmware que ya está en el dispositivo de una solicitud de descarga de firmware completada anteriormente o
fr: L'installation d'un microprogramme qui se trouve déjà sur le terminal et qui provient d'une demande de téléchargement de microprogramme terminée précédente ou
ko: 이전에 완료된 펌웨어 다운로드 요청에서 디바이스에 이미 있는 펌웨어 설치, 또는

source: Downloading and installing firmware within a single device management request.
es: Descarga e instalación de firmware en una única solicitud de gestión de dispositivo.
fr: Le téléchargement et l'installation d'un microprogramme dans le cadre d'une demande de gestion des terminaux unique.
ko: 단일 디바이스 관리 요청 내에서 펌웨어 다운로드 및 설치.

source: The firmware update action is initiated using the REST API by issuing a POST request to:
es: La acción de actualización de firmware se inicia mediante la API REST emitiendo una solicitud POST para:
fr: L'action de mise à jour du microprogramme est lancée à l'aide de l'API REST en émettant une demande POST pour :
ko: 다음에 대해 POST 요청을 발행함으로써 REST API를 사용하여 펌웨어 업데이트 조치가 시작됩니다.

source: The information which should be provided is:
es: La información que se debe proporcionar es:
fr: Les informations qui doivent être indiquées sont les suivantes :
ko: 제공되어야 하는 정보는 다음과 같습니다.

source: The action ``firmware/update``
es: La acción 'firmware/update'
fr: L'action ``firmware/update``
ko: 조치 ``firmware/update``

source: The list of devices to receive the image, all of the same device type.
es: La lista de dispositivos que recibirán la imagen, todos con el mismo tipo de dispositivo.
fr: Liste de terminaux qui doivent recevoir l'image, tous du même type.
ko: 이미지를 수신할 디바이스의 목록이며, 모두 동일한 디바이스 유형입니다.

source: Optional The URI for the firmware image
es: Opcional El URI para la imagen de firmware
fr: URI de l'image du microprogramme (facultatif)
ko: 선택사항 - 펌웨어 이미지에 대한 URI

source: Here is an example request:
es: A continuación, se muestra una solicitud de ejemplo:
fr: Voici un exemple de demande :
ko: 예제 요청은 다음과 같습니다.

source: If any of the optional parameters are specified in the request, then the device management server will send a firmware details update to the device. The firmware details update request is sent on topic ``iotdm-1/device/update``.
es: Si se especifica alguno de los parámetros opcionales en la solicitud, el servidor de gestión de dispositivos enviará una actualización de detalles de firmware al dispositivo. La solicitud de actualización de detalles de firmware se envía en el tema ``iotdm-1/device/update``.
fr: Si des paramètres facultatifs sont spécifiés dans la demande, le serveur de gestion des terminaux envoie une mise à jour des détails du microprogramme au terminal. La demande de mise à jour des détails du microprogramme est envoyée dans le sujet `iotdm-1/device/update``.
ko: 요청에 선택적 매개변수가 지정되는 경우에는 디바이스 관리 서버가 펌웨어 세부사항 업데이트를 디바이스에 전송합니다. 펌웨어 세부사항 업데이트 요청이 ``iotdm-1/device/update`` 주제에 전송됩니다.

source: This request lets the device validate if the requested firmware differs from the currently installed firmware. If there is a difference, set ``rc`` to ``204``, which translates to the status ``Changed``. The following example shows which message is to be expected for the previously sent example firmware update request and what response should be sent, when a difference is detected:
es: Esta solicitud permite que el dispositivo se valide si el firmware solicitado difiere del firmware instalado actualmente. Si existe alguna diferencia, establezca ``rc`` en ``204``, que convierte el estado en ``Changed``. El ejemplo siguiente muestra qué mensaje se debe esperar para la solicitud de actualización de firmware de ejemplo enviada anteriormente y qué repuesta se debe enviar, cuando se detecta una diferencia:
fr: Cette demande laisse le terminal vérifier si le microprogramme demandé est différent du microprogramme actuellement installé. S'ils sont différents, ``rc`` doit correspondre à ``204`` pour faire passer le terminal à l'état ``Changed`` (Modifié). L'exemple ci-dessous indique le message attendu pour l'exemple de demande de mise à jour du microprogramme qui a été envoyée précédemment, ainsi que la réponse à transmettre lorsqu'une différence est détectée :
ko: 이 요청을 통해 디바이스는 요청된 펌웨어가 현재 설치된 펌웨어와 다른지 검증합니다. 다른 경우 ``rc``를 ``204``로 설정하십시오. 이는 상태 ``변경됨``으로 변환됩니다. 다음 예제에서는 이전에 전송된 예제 펌웨어 업데이트 요청에 대해 예상되는 메시지와 전송되어야 하는 응답, 차이점이 발견되는 시기를 보여줍니다.

source: In order to monitor the status of the firmware update the IoT Platform sends an observe request on the topic ``iotdm-1/observe``. When the device is ready to start the update process it sends a response with ``rc`` set to ``200``, ``mgmt.firmware.state`` set to ``0`` and ``mgmt.firmware.updateStatus`` set to ``0``.
es: Para supervisar el estado de la actualización de firmware, IoT Platform envía una solicitud de observación en el tema ``iotdm-1/observe``. Cuando el dispositivo está preparado para iniciar el proceso de actualización, envía una respuesta con ``rc`` establecido en ``200``, ``mgmt.firmware.state`` establecido en ``0`` y ``mgmt.firmware.updateStatus`` establecido en ``0``.
fr: Pour surveiller le statut d'une mise à jour de microprogramme, IoT Platform envoie une demande d'observation dans le sujet ``iotdm-1/observe``. Lorsque le terminal est prêt à lancer la procédure de mise à jour, il envoie une réponse dont le code retour ``rc`` a pour valeur ``200``, l'attribut ``mgmt.firmware.state`` a pour valeur ``0`` et l'attribut ``mgmt.firmware.updateStatus`` a pour valeur ``0``.
ko: 펌웨어 업데이트의 상태를 모니터하려고 IoT Platform은 ``iotdm-1/observe`` 주제에 대한 관찰 요청을 전송합니다. 디바이스가 업데이트 프로세스를 시작할 준비가 되면 ``rc``가 ``200``으로 설정되고 ``mgmt.firmware.state``가 ``0``으로 설정되며 ``mgmt.firmware.updateStatus``가 ``0``으로 설정된 응답을 전송합니다.

source: Here is an example:
es: A continuación se muestra un ejemplo:
fr: Exemple :
ko: 예제는 다음과 같습니다.

source: Afterwards the device management server in the IoT Platform uses the device management protocol to request that the devices specified initiate the firmware installation by publishing using the topic ``iotdm-1/mgmt/initiate/firmware/update``. If this operation can be initiated immediately, ``rc`` should be set to ``202``. If firmware was not previously downloaded successfully, ``rc`` should be set to ``400``.
es: Posteriormente, el servidor de gestión de dispositivos de IoT Platform utiliza el protocolo de gestión de dispositivos para solicitar que los dispositivos especificados inicien la instalación del firmware mediante publicación utilizando el tema ``iotdm-1/mgmt/initiate/firmware/update``. Si esta operación se puede iniciar inmediatamente, establezca 'rc' en '202'. Si el firmware no se ha descargado correctamente con anterioridad, 'rc' debe establecerse en '400'.
fr: Le serveur de gestion des terminaux d'IoT Platform utilise ensuite le protocole de gestion des terminaux pour demander aux terminaux indiqués de lancer l'installation du microprogramme en effectuant une publication à l'aide du sujet ``iotdm-1/mgmt/initiate/firmware/update``. Si cette opération peut être lancée immédiatement, ``rc`` doit correspondre à la valeur ``202``. Si le microprogramme n'a pas été téléchargé correctement, ``rc`` doit correspondre à la valeur ``400``.
ko: 이후 IoT Platform의 디바이스 관리 서버가 디바이스 관리 프로토콜을 사용하여 지정된 디바이스가 ``iotdm-1/mgmt/initiate/firmware/update`` 주제를 통해 공개하여 펌웨어 설치를 시작하도록 요청합니다. 이 오퍼레이션을 즉시 시작할 수 있는 경우 ``rc``가 ``202``로 설정되어야 합니다.펌웨어가 이전에 성공적으로 다운로드되지 않은 경우 ``rc``가 ``400``으로 설정되어야 합니다.

source: In order to finish the firmware update request the device has to report its update status to the IoT Platform via a status message published on its ``iotdevice-1/notify``-topic. Once firmware update is completed, ``mgmt.firmware.updateStatus`` should be set to ``0`` (``Success``), ``mgmt.firmware.state`` should be set to ``0`` (``Idle``), downloaded firmware image can be deleted from the device and ``deviceInfo.fwVersion`` should be set to the value of ``mgmt.firmware.version``.
es: Para poder finalizar la solicitud de actualización del firmware, el dispositivo debe notificar su estado de actualización a IoT Platform mediante un mensaje de estado publicado en su tema ``iotdevice-1/notify``. Una vez finalizada la actualización de firmware, ``mgmt.firmware.updateStatus`` debe establecerse en ``0`` (``Satisfactorio``), ``mgmt.firmware.state`` debe establecerse en ``0`` (``Inactivo``), la imagen de firmware descargada puede suprimirse del dispositivo y ``deviceInfo.fwVersion`` debe establecerse en el valor ``mgmt.firmware.version``.
fr: Pour finaliser la demande de mise à jour du terminal, le terminal doit signaler son statut de mise à jour à IoT Platform via un message de statut publié dans son sujet ``iotdevice-1/notify``. Une fois la mise à jour du microprogramme terminée, ``mgmt.firmware.updateStatus`` doit correspondre à ``0`` (``Réussite``) et ``mgmt.firmware.state`` doit correspondre à ``0`` (``Inactif``). L'image du microprogramme téléchargé peut être supprimée du terminal et ``deviceInfo.fwVersion`` doit correspondre à la valeur de ``mgmt.firmware.version``.
ko: 펌웨어 업데이트 요청을 완료하기 위해 디바이스는 ``iotdevice-1/notify``-topic에 공개된 상태 메시지를 통해 IoT Platform에 업데이트 상태를 보고해야 합니다. 펌웨어 업데이트가 완료되면 ``mgmt.firmware.updateStatus``가 ``0``(``성공``)으로 설정되고 ``mgmt.firmware.state``가 ``0``(``유휴``)로 설정되어야 하며 다운로드된 펌웨어 이미지가 디바이스에서 삭제될 수 있고 ``deviceInfo.fwVersion``이 ``mgmt.firmware.version``의 값으로 설정되어야 합니다.

source: Here is an example notify message:
es: A continuación encontrará un ejemplo de mensaje de notificación:
fr: Voici un exemple de message de notification :
ko: 예제 알림 메시지는 다음과 같습니다.

source: After the IoT Platform received the notify of a completed firmware update it will trigger a last request on the ``iotdm-1/cancel``-topic for cancelation of the observation of the ``mgmt.firmware``-field. After a response with ``rc`` set to ``200`` was sent the firmware update request is completed. Example:
es: Cuando IoT Platform recibe la notificación de que se ha completado una actualización del firmware, desencadena una última solicitud en el tema ``iotdm-1/cancel`` para la cancelación de la observación del campo ``mgmt.firmware``. Una vez enviada una respuesta con ``rc`` establecido en ``200``, la solicitud de actualización de firmware está completa. Ejemplo:
fr: Une fois qu'IoT Platform reçoit la notification signalant qu'une mise à jour du microprogramme est terminée, il déclenche une dernière demande dans le sujet ``iotdm-1/cancel``pour annuler l'observation de la zone ``mgmt.firmware``. Lorsqu'une réponse associée au code retour ``rc`` ``200`` est envoyée, la demande de mise à jour du microprogramme est terminée. Exemple :
ko: IoT Platform이 완료된 펌웨어 업데이트의 알림을 수신하면 ``mgmt.firmware``-field의 관찰을 취소하기 위해 ``iotdm-1/cancel``-topic에 대한 마지막 요청을 트리거합니다. ``rc``가 ``200``으로 설정된 응답이 전송된 후 펌웨어 업데이트 요청이 완료됩니다. 예제:

source: Useful information regarding error and process handling:
es: Información útil sobre el manejo de errores y procesos:
fr: Informations utiles pour le traitement des erreurs et des processus :
ko: 오류 및 프로세스 처리에 관한 유용한 정보:
